.config/doom/config.org
:DOC-CONFIG:
#+title: Doom Emacs configuration
#+author: Venky Iyer
#+email: indigoviolet@gmail.com
:END:

(Tangled on `doom sync`, not on save)

This is my literate Doom Emacs configuration.

See [[file:init.el][init.el]], [[file:packages.el][packages.el]] and [[file:config.el][config.el]] for the generated files. Also see [[file:custom.el][file:~/.config/doom/custom.el]] for customizations

Transient settings are in [[file:~/.emacs.d/.local/etc/transient/values][file:~/.emacs.d/.local/etc/transient/values]] (~transient-values-file~)


* Notes

** authinfo

https://www.masteringemacs.org/article/keeping-secrets-in-emacs-gnupg-auth-sources

** about writing doom config

- See [[https://github.com/hlissner/doom-emacs/blob/develop/modules/lang/emacs-lisp/demos.org ][api demos]] for how to use ~use-package!~, ~map!~, ~after!~, ~set-hook!~ etc.

- Most important thing for start up speed is to defer packages as much as possible.

  :defer, :bind, :commands, :after, :after-call, :defer-incrementally should be used in ~use-package!~

  ~after!~ should be used for doom's built in packages if it is simple

  ~:after-call (pre-command-hook after-find-file dired-before-readin-hook doom-first-buffer-hook doom-first-input-hook doom-first-file-hook ))~ <- some hooks that can be used for :after-call

https://github.com/hlissner/doom-emacs/issues/310#issuecomment-354424413
https://github.com/doomemacs/doomemacs/blob/master/docs/getting_started.org#packages-are-eagerly-loaded
[[help:use-package][use-package docs]]


** Debugging

- toggle-debug-on-error

- setq debug-on-message <regexp> (https://old.reddit.com/r/emacs/comments/aqmrkq/determine_source_of_messages_printed_to_messages/)

* To try:
** hyper/super keys
*** http://ergoemacs.org/emacs/emacs_hyper_super_keys.html

which keys? (ctrl is taken, caps is not reachable,)
how to define on ubuntu?
** prog-mode org-mode

are not the only modes we want things in; several other conf, yaml etc modes are "proggy", they inherit from text-mode or other things. Look at mode-minder. How to include these uniformly everywhere?

** [[*combobulate][combobulate]]

** Fonts

figure out why polars utf8 tables don't render correctly (even in vterm -- this is an emacs-wide problem, not ein only)

** edit-indirect (separedit),

sometimes edit-indirect seems to remember separedit comment-removal

** ein

*** font-locking

try to write a function that "updates" font-locking on all (markdown/code) cells

^ may be unncessary with outline-minor-faces-mode and removing all font attributes on markdown faces

*** firestarter + jupytext on save sync?

may not be necessary if we use jupyter-ascending

*** last execution time in ein

https://github.com/millejoh/emacs-ipython-notebook/blob/old-master/lisp/ein-timestamp.el

*** WAIT code-cells
:LOGBOOK:
- State "WAIT"       from              [2022-07-02 Sat 11:47]
:END:

cons: outputs aren't saved; this is not using polymode so that markdown isn't
supported (see https://github.com/polymode/polymode/issues/305 also)

*** fence-edit,




*** TODO Unpin ein

*** Create folding for ein notebooks using origami

https://github.com/elp-revive/origami.el

See for examples: https://github.com/elp-revive/origami.el/blob/master/origami-parsers.el
*** DONE undo is disabled?
:LOGBOOK:
- State "DONE"       from              [2022-09-27 Tue 15:09]
:END:

[2022-09-04T01:34:19]: Warning (ein): Disabling undo for undo-fu-only-undo Disable showing Disable logging

*** unknown errors on login


[2022-09-04T01:34:12]: Wrong type argument: ein:$notebook, nil: defaulting language to python [2 times]



** polymode (justfile?)
** https://framagit.org/steckerhalter/discover-my-major

** Insert item below isn't good

(+org/insert-item-below 1) will not respect content like (+org/insert-item-above 1) or (for headings, ) org-insert-heading-respect-content

We could try to create +org/insert-item-below with -above + shift down

We could create a better org-return-dwim using (org-at-item-p), (org-in-item-p) and friends

** KILL Better hydras?
:LOGBOOK:
- State "KILL"       from              [2022-09-03 Sat 14:40]
:END:

Punt for now: pretty/major-hydra is quite good

*** See if we can use https://gitlab.com/jjzmajic/hercules.el to make simpler hydras

*** Use transient to make expand-region more like easy-mark

https://www.reddit.com/r/emacs/comments/f3o0v8/anyone_have_good_examples_for_transient/

The problem with easy-mark is that it takes another key combo (C-SPC) to make an
active region (for replacing or moving or wrapping).

The problem with expand-region is that you can't start the region and then jump
to a particular kind of expansion, you have to cycle through
er/try-expand-alist.

However, if we can wrap a transient around set-mark-command, then we could use
er/mark-<foo> to recreate easy-mark, with active region.

** https://github.com/minad/consult/wiki#isearch-like-backwardforward-consult-line

** Figure out how to use dired efficiently

*** dired-sidebar
*** dirvish

https://github.com/alexluigit/dirvish
** Tramp issues

*** Figure out how to efficiently handle vterm, find-file in the presence of tramp

(+vterm/here seems to look for default-directory -- maybe we can fix that)

*** KILL treemacs freaks out in tramp?
:LOGBOOK:
- State "KILL"       from              [2022-09-03 Sat 14:41]
:END:

** Ideas from [[https://github.com/zzamboni/dot-doom/blob/master/doom.org][zzamboni]]
*** Jump to matching parens
*** variable pitch fonts & mixed fonts
*** kill whole line instead of emptying it
*** autosave and backup (disabled in doom)
*** confirm-kill-emacs
*** auto-restore emacs on startup?
*** org speed keys
** org-mode:
*** [[https://github.com/alphapapa/org-super-agenda][org-super-agenda]] -- Need to set org-super-agenda-groups
*** DONE org-mode company tweaks (see [[*Company backends][Company backends]])
:LOGBOOK:
- State "DONE"       from              [2022-07-02 Sat 11:24]
:END:

*** [[https://old.reddit.com/r/orgmode/comments/8n45ds/why_highlighting_text_is_so_painful_in_orgmode/dztalak/][Change emphasis colors/etc in org-mode]]
*** Escaping in org-mode https://emacs.stackexchange.com/a/16746/31740
*** org-mode Latex previewers:


https://github.com/yangsheng6810/org-latex-impatient
https://old.reddit.com/r/emacs/comments/k6rq84/display_equations_inline_with_mathpreview/
https://github.com/fuxialexander/emacs-webkit-katex-render



*** DONE org-appear (toggle visibility of emphasis markers)

*** figure out org-capture (into Notes todo, into emacs config.org todo, project todo)


https://fuco1.github.io/2019-02-10-Refiling-hydra-with-pre-defined-targets.html

*** one more implementation of org-tangle

https://github.com/trev-dev/org-tangle-config.el

*** Use org-remark instead of annotate
** [[https://sideshowcoder.com/2020/07/02/opening-sourcegraph-from-emacs/][Sourcegraph links via git-link]]
** https://github.com/tecosaur/emacs-everywhere
** harpoon bookmarks

** toml formatter using prettier and apheleia
** https://github.com/EricCrosson/unkillable-scratch

** DONE [[https://emacs.stackexchange.com/a/28391/31740][Set font size based on monitor/scaling?]]

*** See https://github.com/mnp/dispwatch and doom/*font* functions
** DONE maple-minibuffer (mini-frame replacement)
** DONE bufler (ibuffer replacement)
** DONE Pyright
:LOGBOOK:
- State "DONE"       from              [2022-07-02 Sat 11:18]
:END:

try lsp-pyright instead of mspyls. Previously didn't work with attrs, but now it
+seems to have some support+. Whoops, misspoke:
https://github.com/microsoft/pyright/issues/146 pyright still doesn't have attrs
support.

For LSP it's ok if we ignore all LSP errors and only use it for type hints etc -
for which it seems to work better than mspyls

- [ ] Figure out how to get pyright to watch fewer files?
- [ ] Revisit lsp completion with pyright: https://github.com/emacs-lsp/lsp-pyright/issues/16#issuecomment-676501575
- [ ] poetry and pyright: https://github.com/emacs-lsp/lsp-pyright/issues/24
- [X] Set up semantic for tabnine: https://www.tabnine.com/semantic, but see if we can use current language server instead of pyls (pyright or pylance?)


** KILL Pylance
:LOGBOOK:
- State "KILL"       from              [2022-07-02 Sat 11:18]
:END:

- [ ] try pylance: https://github.com/emacs-lsp/lsp-mode/issues/1863#issuecomment-652740357 (slower release cycle?)

** js-mode with tide instead of rjsx mode

https://www.reddit.com/r/emacs/comments/ca6q7v/emacs_for_web_dev_rjsx_webmode_tide_js2etc/
https://www.reddit.com/r/emacs/comments/9tr2vn/web_development_with_emacs_tips_and_tricks/
https://github.com/mooz/js2-mode
https://www.reddit.com/r/emacs/comments/bo741n/react_react_native_environment_setup/

** http://emacsrocks.com/
** http://whattheemacsd.com/
** https://github.com/grettke/help/blob/master/help.pdf
** Make rubocop fast async
https://emacs.stackexchange.com/questions/29086/non-shell-command-on-region

use apheleia?
** exwm
* Config file headers

Doom Emacs uses three config files:

- =init.el= defines which of the existing Doom [[https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#modules][modules]] are loaded. A Doom module is a bundle of packages, configuration and commands, organized into a unit that can be toggled easily from this file.
- =packages.el= defines which [[https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#package-management][packages]] should be installed, beyond those that are installed and loaded as part of the enabled modules.
- =config.el= contains all [[https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#configuring-doom][custom configuration]] and code.

There are other files that can be loaded, but theses are the main ones. The load order of different files is [[https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#load-order][defined depending on the type of session]] being started.

All the config files are generated from this Org file, to try and make its meaning as clear as possible. All =package!= declarations are written to =packages.el=, all other LISP code is written to =config.el=.

We start by simply defining the standard headers used by the three files. These headers come from the initial files generated by =doom install=, and contain either some Emacs-LISP relevant indicators like =lexical-binding=, or instructions about the contents of the file.

** init.el
#+begin_src emacs-lisp :tangle init.el
;;; init.el -*- lexical-binding: t; -*-

;; DO NOT EDIT THIS FILE DIRECTLY

;; This file controls what Doom modules are enabled and what order they load
;; in. Remember to run 'doom sync' after modifying it!

;; NOTE Press 'SPC h d h' (or 'C-h d h' for non-vim users) to access Doom's
;;      documentation. There you'll find a "Module Index" link where you'll find
;;      a comprehensive list of Doom's modules and what flags they support.

;; NOTE Move your cursor over a module's name (or its flags) and press 'K' (or
;;      'C-c c k' for non-vim users) to view its documentation. This works on
;;      flags as well (those symbols that start with a plus).
;;
;;      Alternatively, press 'gd' (or 'C-c c d') on a module to browse its
;;      directory (for easy access to its source code).

;; https://github.com/hlissner/doom-emacs/issues/5682
(defvar comp-deferred-compilation-deny-list nil)
#+end_src

#+RESULTS[18cf4f787585341b87168f71d76d5c343964a351]:
: comp-deferred-compilation-deny-list

** packages.el
#+begin_src emacs-lisp :tangle packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; DO NOT EDIT THIS FILE DIRECTLY

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;(package! some-package)

;; To install a package directly from a remote git repo, you must specify a
;; `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/raxod502/straight.el#the-recipe-format
;(package! another-package
;  :recipe (:host github :repo "username/repo"))

;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;(package! this-package
;  :recipe (:host github :repo "username/repo"
;           :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, you can do so here
;; with the `:disable' property:
;(package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;(package! builtin-package :recipe (:nonrecursive t))
;(package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see raxod502/straight.el#279)
;(package! builtin-package :recipe (:branch "develop"))

;; Use `:pin' to specify a particular commit to install.
;(package! builtin-package :pin "1a2b3c4d5e")


;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;(unpin! pinned-package)
;; ...or multiple packages
;(unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;(unpin! t)
#+end_src

#+RESULTS[5aa8a8040c0f63c76b60db387e2d9489831d8696]:

