.config/doom/config.el
;; config.el

;; [[file:config.org::*config.el][config.el:1]]
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; DO NOT EDIT THIS FILE DIRECTLY

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:

;; On ubuntu this would be set in Tweaks, but on mac we have to set it here
(setq! doom-font (font-spec :family "Iosevka Nerd Font Mono"))
;;  doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq! org-directory (file-truename "~/org/"))

;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
;; config.el:1 ends here

;; Themes


;; [[file:config.org::*Themes][Themes:1]]
;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
;; Themes:1 ends here



;; https://protesilaos.com/emacs/modus-themes


;; [[file:config.org::*modus][modus:2]]
(setq!
  modus-themes-disable-other-themes t
  modus-themes-italic-constructs t
  modus-themes-bold-constructs t
  modus-themes-mixed-fonts nil
  modus-themes-variable-pitch-ui nil
  modus-themes-org-blocks 'gray-background ; {nil,'gray-background,'tinted-background}
  )
(setq! modus-themes-common-palette-overrides
  '(
     ;;(bg-region bg-dim)

     (fg-region unspecified)
     (border-mode-line-active unspecified)
     (border-mode-line-inactive unspecified)
     (fg-mode-line-active fg-main)
     (border-mode-line-active blue-intense)
     (bg-tab-bar bg-main)
     (bg-tab-current bg-cyan-intense)
     (bg-tab-other bg-inactive)
     (bg-paren-match bg-magenta-intense)
     (prose-done green-intense)
     (prose-todo red-intense)
     (bg-term-black bg-term-black-bright)
     (fg-term-black fg-term-black-bright)
     ;; headings
     (fg-heading-1 fg-main)
     (bg-heading-1 bg-dim)
     (overline-heading-1 border)
     )
  )
(setq doom-theme 'modus-vivendi-tinted)
;; modus:2 ends here
