.config/doom/config.el



;; doom-debug-p renamed to init-file-debug (https://github.com/doomemacs/doomemacs/commit/14b239542414db812b32f9eca4fb58016d93d687)
;; ~emacs --debug-init~ to do profiling

;; according to the doom emacs issues, this block should be in init.el, but that
;; doesn't work.. so it's at the beginning of config.el and commented out.


;; [[file:config.org::*profiling code][profiling code:2]]
(when init-file-debug
  ;; https://github.com/dholm/benchmark-init-el/issues/15#issuecomment-766083560
  (define-advice define-obsolete-function-alias (:filter-args (ll) fix-obsolete)
    (let ((obsolete-name (pop ll))
          (current-name (pop ll))
          (when (if ll (pop ll) "1"))
          (docstring (if ll (pop ll) nil)))
      (list obsolete-name current-name when docstring)))
  ;; (require 'benchmark-init-modes)
  (require 'benchmark-init)
  (add-hook 'doom-first-input-hook #'benchmark-init/deactivate))
;; profiling code:2 ends here

;; Timestamped \*Messages\*

;; https://old.reddit.com/r/emacs/comments/16tzu9/anyone_know_of_a_reasonable_way_to_timestamp/

;; [[file:config.org::*Timestamped \*Messages\*][Timestamped \*Messages\*:1]]
;; timestamps in *Messages*

(require 'ts)
(defalias 'message-plain (symbol-function 'message))
(defun message (fmt-string &rest args)
  (let ((message-truncate-lines t))
    (apply
     'message-plain
     (concat (ts-format "[%Y-%m-%dT%T]: ") fmt-string)
     args)))
;; Timestamped \*Messages\*:1 ends here

;; General
