.config/doom/packages.el

;; https://github.com/hlissner/doom-emacs/issues/4498



;; [[file:config.org::*profiling code][profiling code:1]]
(package! benchmark-init)
;; profiling code:1 ends here

;; Disabled/unpinned packages

;; [[file:~/.emacs.d/lisp/packages.el][file:~/.emacs.d/lisp/packages.el]] see Pinned package versions


;; [[file:config.org::*Disabled/unpinned packages][Disabled/unpinned packages:1]]
;; magit-todos: was slow on the startup, unused
(disable-packages! magit-todos)
(disable-packages! which-key)
(disable-packages! dired-git-info)
(disable-packages! highlight-indent-guides)

;; (package! transient :pin "55d5d41b48d7f7bc1ecf1f90c012d7821dff5724")


;; updates to a version that has org-store-link compatibility instead of 6633d82c6e3c921c486ec284cb6542f33278b605
(unpin! helpful)

;; https://github.com/doomemacs/doomemacs/issues/7244#issuecomment-1643370848
(package! magit :pin "26be78e")
(package! forge :pin "dc4e9ca")
;; Disabled/unpinned packages:1 ends here
