.config/doom/config.org
** General
#+begin_src emacs-lisp
;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "Venky Iyer"
      user-mail-address "indigoviolet@gmail.com")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type nil)

;; For some reason Doom disables auto-save and backup files by default. Let's reenable them.
(setq auto-save-default t
      make-backup-files t)

;; Disable exit confirmation.
;; (setq confirm-kill-emacs nil)

(setq confirm-nonexistent-file-or-buffer 'after-completion)

;; indent anywhere, no completion on tab
(setq tab-always-indent t)

(setq scroll-preserve-screen-position 'always)

;; gets pageup/pagedown to ends of buffer
(setq scroll-error-top-bottom t)

;; https://stackoverflow.com/a/19782939/14044156
(setq suggest-key-bindings nil)

;; ;; truncates lines so that when you scroll toward the end of one, the line
;; ;; itself moves to the left independently of the rest of the text.
;; (setq auto-hscroll-mode 'current-line)
(setq auto-hscroll-mode t) ; not 'current-line

;; line wrapping
;;
(global-visual-line-mode t)
(add-hook! '(prog-mode-hook bufler-list-mode-hook)
           (defun vi/truncate-lines ()
             (setq-local truncate-partial-width-windows t)
             (visual-line-mode -1)))

;; truncate-lines t)
;;
(setq message-truncate-lines t)


;; https://www.masteringemacs.org/article/demystifying-emacs-window-manager
(setq switch-to-buffer-obey-display-actions t)

;; (global-git-gutter-mode t)

;; (repeat-mode 1)

;; (setq server-socket-dir "~/.emacs.d/server")
(require 'server)
(unless (server-running-p)
  (server-start))

;; https://pragmaticemacs.wordpress.com/2016/11/07/add-the-system-clipboard-to-the-emacs-kill-ring/
;; Save whatever’s in the current (system) clipboard before
;; replacing it with the Emacs’ text.
;; https://github.com/dakrone/eos/blob/master/eos.org
(setq save-interprogram-paste-before-kill t)

(defvar vi/home-dir (expand-file-name "~/")
  "The home directory path.")

;; https://github.com/emacs-lsp/lsp-mode#performance
;; vterm as well
(setq read-process-output-max (* 1024 1024)) ;; 1mb
(setq process-adaptive-read-buffering nil)
#+end_src

** uniquify


#+begin_src emacs-lisp
(setq! uniquify-buffer-name-style 'post-forward
  uniquify-after-kill-buffer-p t
  uniquify-min-dir-content 3
  uniquify-separator " | "
  uniquify-strip-common-prefix t)

#+end_src
** whitespace


#+begin_src emacs-lisp
;; (global-whitespace-mode +1)
(setq! whitespace-style '(face tabs tab-mark trailing))
(add-hook! (prog-mode org-mode text-mode) (whitespace-mode t))
#+end_src


** specpdl size

https://old.reddit.com/r/emacs/comments/9jp9zt/anyone_know_what_variable_binding_depth_exceeds/
#+begin_src emacs-lisp
(setq max-specpdl-size 25000)
#+end_src

** Custom.el handling

#+begin_src emacs-lisp
;; (setq custom-file (make-temp-file "emacs-custom"))
(setq custom-file (expand-file-name "custom.el" doom-private-dir))
;; (setq custom-file "/tmp/emacs-custom")

(load custom-file 'noerror)
#+end_src

** dir-locals.el safe Variables

Turn off "don't remember risky variables" feature

#+begin_src emacs-lisp
;; https://emacs.stackexchange.com/a/44604
;; This actually just skips them instead of setting them regardless
;; (advice-add 'risky-local-variable-p :override #'ignore)


(setq enable-local-variables :all)
#+end_src

** Prevent *Warnings* buffer from popping up


#+begin_src emacs-lisp
(setq warning-minimum-level :error)
#+end_src

** Unadvice functions

https://emacs.stackexchange.com/a/24658 -- not sure if this works?

#+begin_src emacs-lisp
(defun advice-unadvice (sym)
  "Remove all advices from symbol SYM."
  (interactive "aFunction symbol: ")
  (advice-mapc (lambda (advice _props) (advice-remove sym advice)) sym))
#+end_src
** persistent scratch


#+begin_src emacs-lisp :tangle packages.el
(package! persistent-scratch)
#+end_src


#+begin_src emacs-lisp
(use-package! persistent-scratch
  :after-call doom-first-buffer-hook
  :custom
  (persistent-scratch-save-file (concat doom-emacs-dir "persistent-scratch"))
  (persistent-scratch-backup-directory (concat doom-emacs-dir "/backups"))
  (persistent-scratch-backup-file-name-format "persistent-scratch-%Y-%m-%d--%H-%M-%S-%N")
  :config
  (persistent-scratch-setup-default)
  )
#+end_src

** backups




#+begin_src emacs-lisp
(defun vi/backup-enable-predicate (filename)
  "Enable backup for files in specific directories and their subdirectories"
  (let ((dirs '("~/.config/doom/" "~/")))
    (cl-some (lambda (dir)
               (string-prefix-p (file-truename dir) (file-truename filename)))
             dirs)))
(defvar --backup-directory (concat doom-emacs-dir "/backups"))
(if (not (file-exists-p --backup-directory))
        (make-directory --backup-directory t))

(setq backup-directory-alist `(("." . ,--backup-directory)))
(setq make-backup-files t               ; backup of a file the first time it is saved.
  backup-inhibited nil
      backup-by-copying t               ; don't clobber symlinks
      version-control t                 ; version numbers for backup files
      delete-old-versions t             ; delete excess backup files silently
      delete-by-moving-to-trash t
  kept-old-versions 25               ; oldest versions to keep when a new numbered backup is made (default: 2)
  kept-new-versions 25              ; newest versions to keep when a new numbered backup is made (default: 2)

  backup-enable-predicate #'vi/backup-enable-predicate
      )

(defun vi/backup-files ()
  "Find backup files for a specified file."
  (interactive)
  (let* ((filename (read-file-name "Enter file name: "))
         (backup-files (file-backup-file-names filename)))
    (if backup-files
      (let ((backup-file (completing-read "Select backup file: " backup-files)))
        (find-file backup-file))
      (message "No backup files found for %s" filename))))
#+end_src


* Global keybindings


#+begin_src emacs-lisp
(map! "M-i" #'delete-indentation
      "M-t" #'beginning-of-buffer
      "M-z" #'end-of-buffer
  "C-S-W" #'delete-region                 ;can use M-w C-w for kill-region
  "<escape>" #'keyboard-escape-quit
      "C-x k" #'kill-buffer-and-window
      "<f5>" (cmd! (revert-buffer t t)))
#+end_src

** digit-argument

Unbind digit-argument keys across multiple maps -- we never use this and it's
occupying keyspace

#+begin_src emacs-lisp
(dolist (num (number-sequence 0 9))
  (dolist (prefix (list "C-" "M-" "C-M-" "ESC "))
    (let ((k (concat prefix (format "%s" num))))
      (map! :map (global-map splash-screen-keymap) k nil)
      )))
#+end_src


** Eval

#+begin_src emacs-lisp :tangle packages.el
(package! pp+ :recipe (:host github :repo "emacsmirror/pp-plus"))
#+end_src

https://old.reddit.com/r/emacs/comments/qfhzjg/make_better_use_of_cx_ce/


#+begin_src emacs-lisp
(use-package! pp+
  :commands (pp-eval-expression pp-eval-last-sexp)
  :custom
  (pp-max-tooltip-size nil) ;; (cons 40 20)) ;; tooltips are slowww
  :config
  (global-set-key [remap eval-expression] 'pp-eval-expression)
  ;; (global-set-key [remap eros-eval-last-sexp] 'pp-eval-last-sexp)
  (global-set-key [remap eval-last-sexp] 'pp-eval-last-sexp))
#+end_src

