.config/doom/config.el

;; [[file:config.org::*General][General:1]]
;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "Venky Iyer"
      user-mail-address "indigoviolet@gmail.com")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type nil)

;; For some reason Doom disables auto-save and backup files by default. Let's reenable them.
(setq auto-save-default t
      make-backup-files t)

;; Disable exit confirmation.
;; (setq confirm-kill-emacs nil)

(setq confirm-nonexistent-file-or-buffer 'after-completion)

;; indent anywhere, no completion on tab
(setq tab-always-indent t)

(setq scroll-preserve-screen-position 'always)

;; gets pageup/pagedown to ends of buffer
(setq scroll-error-top-bottom t)

;; https://stackoverflow.com/a/19782939/14044156
(setq suggest-key-bindings nil)

;; ;; truncates lines so that when you scroll toward the end of one, the line
;; ;; itself moves to the left independently of the rest of the text.
;; (setq auto-hscroll-mode 'current-line)
(setq auto-hscroll-mode t) ; not 'current-line

;; line wrapping
;;
(global-visual-line-mode t)
(add-hook! '(prog-mode-hook bufler-list-mode-hook)
           (defun vi/truncate-lines ()
             (setq-local truncate-partial-width-windows t)
             (visual-line-mode -1)))

;; truncate-lines t)
;;
(setq message-truncate-lines t)


;; https://www.masteringemacs.org/article/demystifying-emacs-window-manager
(setq switch-to-buffer-obey-display-actions t)

;; (global-git-gutter-mode t)

;; (repeat-mode 1)

;; (setq server-socket-dir "~/.emacs.d/server")
(require 'server)
(unless (server-running-p)
  (server-start))

;; https://pragmaticemacs.wordpress.com/2016/11/07/add-the-system-clipboard-to-the-emacs-kill-ring/
;; Save whatever’s in the current (system) clipboard before
;; replacing it with the Emacs’ text.
;; https://github.com/dakrone/eos/blob/master/eos.org
(setq save-interprogram-paste-before-kill t)

(defvar vi/home-dir (expand-file-name "~/")
  "The home directory path.")

;; https://github.com/emacs-lsp/lsp-mode#performance
;; vterm as well
(setq read-process-output-max (* 1024 1024)) ;; 1mb
(setq process-adaptive-read-buffering nil)
;; General:1 ends here

;; uniquify



;; [[file:config.org::*uniquify][uniquify:1]]
(setq! uniquify-buffer-name-style 'post-forward
  uniquify-after-kill-buffer-p t
  uniquify-min-dir-content 3
  uniquify-separator " | "
  uniquify-strip-common-prefix t)
;; uniquify:1 ends here

;; whitespace



;; [[file:config.org::*whitespace][whitespace:1]]
;; (global-whitespace-mode +1)
(setq! whitespace-style '(face tabs tab-mark trailing))
(add-hook! (prog-mode org-mode text-mode) (whitespace-mode t))
;; whitespace:1 ends here

;; specpdl size

;; https://old.reddit.com/r/emacs/comments/9jp9zt/anyone_know_what_variable_binding_depth_exceeds/

;; [[file:config.org::*specpdl size][specpdl size:1]]
(setq max-specpdl-size 25000)
;; specpdl size:1 ends here

;; Custom.el handling


;; [[file:config.org::*Custom.el handling][Custom.el handling:1]]
;; (setq custom-file (make-temp-file "emacs-custom"))
(setq custom-file (expand-file-name "custom.el" doom-private-dir))
;; (setq custom-file "/tmp/emacs-custom")

(load custom-file 'noerror)
;; Custom.el handling:1 ends here

;; dir-locals.el safe Variables

;; Turn off "don't remember risky variables" feature


;; [[file:config.org::*dir-locals.el safe Variables][dir-locals.el safe Variables:1]]
;; https://emacs.stackexchange.com/a/44604
;; This actually just skips them instead of setting them regardless
;; (advice-add 'risky-local-variable-p :override #'ignore)


(setq enable-local-variables :all)
;; dir-locals.el safe Variables:1 ends here

;; Prevent *Warnings* buffer from popping up



;; [[file:config.org::*Prevent *Warnings* buffer from popping up][Prevent *Warnings* buffer from popping up:1]]
(setq warning-minimum-level :error)
;; Prevent *Warnings* buffer from popping up:1 ends here

;; Unadvice functions

;; https://emacs.stackexchange.com/a/24658 -- not sure if this works?


;; [[file:config.org::*Unadvice functions][Unadvice functions:1]]
(defun advice-unadvice (sym)
  "Remove all advices from symbol SYM."
  (interactive "aFunction symbol: ")
  (advice-mapc (lambda (advice _props) (advice-remove sym advice)) sym))
;; Unadvice functions:1 ends here

;; [[file:config.org::*persistent scratch][persistent scratch:2]]
(use-package! persistent-scratch
  :after-call doom-first-buffer-hook
  :custom
  (persistent-scratch-save-file (concat doom-emacs-dir "persistent-scratch"))
  (persistent-scratch-backup-directory (concat doom-emacs-dir "/backups"))
  (persistent-scratch-backup-file-name-format "persistent-scratch-%Y-%m-%d--%H-%M-%S-%N")
  :config
  (persistent-scratch-setup-default)
  )
;; persistent scratch:2 ends here

;; backups





;; [[file:config.org::*backups][backups:1]]
(defun vi/backup-enable-predicate (filename)
  "Enable backup for files in specific directories and their subdirectories"
  (let ((dirs '("~/.config/doom/" "~/")))
    (cl-some (lambda (dir)
               (string-prefix-p (file-truename dir) (file-truename filename)))
             dirs)))
(defvar --backup-directory (concat doom-emacs-dir "/backups"))
(if (not (file-exists-p --backup-directory))
        (make-directory --backup-directory t))

(setq backup-directory-alist `(("." . ,--backup-directory)))
(setq make-backup-files t               ; backup of a file the first time it is saved.
  backup-inhibited nil
      backup-by-copying t               ; don't clobber symlinks
      version-control t                 ; version numbers for backup files
      delete-old-versions t             ; delete excess backup files silently
      delete-by-moving-to-trash t
  kept-old-versions 25               ; oldest versions to keep when a new numbered backup is made (default: 2)
  kept-new-versions 25              ; newest versions to keep when a new numbered backup is made (default: 2)

  backup-enable-predicate #'vi/backup-enable-predicate
      )

(defun vi/backup-files ()
  "Find backup files for a specified file."
  (interactive)
  (let* ((filename (read-file-name "Enter file name: "))
         (backup-files (file-backup-file-names filename)))
    (if backup-files
      (let ((backup-file (completing-read "Select backup file: " backup-files)))
        (find-file backup-file))
      (message "No backup files found for %s" filename))))
;; backups:1 ends here

;; Global keybindings



;; [[file:config.org::*Global keybindings][Global keybindings:1]]
(map! "M-i" #'delete-indentation
      "M-t" #'beginning-of-buffer
      "M-z" #'end-of-buffer
  "C-S-W" #'delete-region                 ;can use M-w C-w for kill-region
  "<escape>" #'keyboard-escape-quit
      "C-x k" #'kill-buffer-and-window
      "<f5>" (cmd! (revert-buffer t t)))
;; Global keybindings:1 ends here

;; digit-argument

;; Unbind digit-argument keys across multiple maps -- we never use this and it's
;; occupying keyspace


;; [[file:config.org::*digit-argument][digit-argument:1]]
(dolist (num (number-sequence 0 9))
  (dolist (prefix (list "C-" "M-" "C-M-" "ESC "))
    (let ((k (concat prefix (format "%s" num))))
      (map! :map (global-map splash-screen-keymap) k nil)
      )))
;; digit-argument:1 ends here



;; https://old.reddit.com/r/emacs/comments/qfhzjg/make_better_use_of_cx_ce/



;; [[file:config.org::*Eval][Eval:2]]
(use-package! pp+
  :commands (pp-eval-expression pp-eval-last-sexp)
  :custom
  (pp-max-tooltip-size nil) ;; (cons 40 20)) ;; tooltips are slowww
  :config
  (global-set-key [remap eval-expression] 'pp-eval-expression)
  ;; (global-set-key [remap eros-eval-last-sexp] 'pp-eval-last-sexp)
  (global-set-key [remap eval-last-sexp] 'pp-eval-last-sexp))
;; Eval:2 ends here
