.config/doom/packages.el

;; persistent scratch



;; [[file:config.org::*persistent scratch][persistent scratch:1]]
(package! persistent-scratch)
;; persistent scratch:1 ends here

;; Eval


;; [[file:config.org::*Eval][Eval:1]]
(package! pp+ :recipe (:host github :repo "emacsmirror/pp-plus"))
;; Eval:1 ends here

;; (Disable) Mouse
