.config/doom/config.org
* (Disable) Mouse

#+begin_src emacs-lisp :tangle packages.el
(package! disable-mouse)
#+end_src

#+begin_src emacs-lisp
(use-package! disable-mouse
  :after-call doom-first-input-hook
  :config
  ;;(global-disable-mouse-mode)
  )
#+end_src

* Chords

https://dzone.com/articles/rare-letter-combinations-and


#+begin_example
❯ curl -Ov https://www.johndcook.com/unordered_bigram_frequencies.csv
❯ rg --pcre2 '^([A-Z])\1' unordered_bigram_frequencies.csv
29:JJ,0
43:KK,0
69:QQ,0
90:VV,0
96:WW,0
111:YY,0
135:HH,0.001
154:UU,0.001
197:AA,0.003
212:XX,0.003
215:ZZ,0.003
274:BB,0.011
299:II,0.023
302:GG,0.025
331:DD,0.043
378:NN,0.073
383:CC,0.083
400:MM,0.096
421:RR,0.121
426:PP,0.137
431:FF,0.146
442:TT,0.171
457:OO,0.21
526:EE,0.378
535:SS,0.405
572:LL,0.577
#+end_example


#+begin_src emacs-lisp :tangle packages.el
(package! key-chord)
#+end_src

#+begin_src emacs-lisp
;; distributed with use-package? TODO errors -- use key-chord-define-global directly
;; (use-package! use-package-chords)

(use-package! key-chord
  :after-call doom-first-input-hook
  :custom

  ;; Max time delay between two key presses to be considered a key chord
  (key-chord-two-keys-delay 0.2) ; default 0.1

  ;; Max time delay between two presses of the same key to be considered a key chord.
  ;; Should normally be a little longer than `key-chord-two-keys-delay'.
  (key-chord-one-key-delay 0.4) ; default 0.2
  (key-chord-safety-interval-forward 0.0)
  :config (key-chord-mode 1)
  )
#+end_src

* Colors/display
** dim other buffers

+Leads to all kinds of hell -- errors everywhere. unclear what this is conflicting with.
+https://github.com/mina86/auto-dim-other-buffers.el/issues/32+

#+begin_src emacs-lisp :tangle packages.el
(package! auto-dim-other-buffers)
#+end_src

#+begin_src emacs-lisp
(use-package! auto-dim-other-buffers
  :after-call doom-first-buffer-hook
  :config
  (auto-dim-other-buffers-mode t)
  )
#+end_src
