.config/doom/config.el

;; [[file:config.org::*(Disable) Mouse][(Disable) Mouse:2]]
(use-package! disable-mouse
  :after-call doom-first-input-hook
  :config
  ;;(global-disable-mouse-mode)
  )
;; (Disable) Mouse:2 ends here

;; [[file:config.org::*Chords][Chords:2]]
;; distributed with use-package? TODO errors -- use key-chord-define-global directly
;; (use-package! use-package-chords)

(use-package! key-chord
  :after-call doom-first-input-hook
  :custom

  ;; Max time delay between two key presses to be considered a key chord
  (key-chord-two-keys-delay 0.2) ; default 0.1

  ;; Max time delay between two presses of the same key to be considered a key chord.
  ;; Should normally be a little longer than `key-chord-two-keys-delay'.
  (key-chord-one-key-delay 0.4) ; default 0.2
  (key-chord-safety-interval-forward 0.0)
  :config (key-chord-mode 1)
  )
;; Chords:2 ends here

;; [[file:config.org::*dim other buffers][dim other buffers:2]]
(use-package! auto-dim-other-buffers
  :after-call doom-first-buffer-hook
  :config
  (auto-dim-other-buffers-mode t)
  )
;; dim other buffers:2 ends here
