.config/doom/packages.el
;; - State "KILL"       from "DONE"       [2022-01-26 Wed 17:28]
;; - State "DONE"       from "WAIT"       [2022-01-26 Wed 17:28]
;; - State "WAIT"       from "TODO"       [2022-01-26 Wed 17:28]
;; - State "KILL"       from "DONE"       [2022-01-26 Wed 17:28]
;; - State "DONE"       from "WAIT"       [2022-01-26 Wed 17:28]
;; - State "WAIT"       from "TODO"       [2022-01-26 Wed 17:28]
;; :END:


;; [[file:config.org::*Rainbow][Rainbow:1]]
(package! rainbow-mode)
(package! rainbow-delimiters)
(package! rainbow-identifiers)
;; Rainbow:1 ends here

;; pulsar



;; [[file:config.org::*pulsar][pulsar:1]]
(package! pulsar)
;; pulsar:1 ends here

;; highlights
