.config/doom/config.org
** ansi colors

Changes the colors used for mapping from SGR codes to emacs colors, in the
function ~ansi-color-apply~ in ansi-colors.el

These are controlled by the variable ~ansi-color-normal-colors-vector~~ which
lists a bunch of faces like ~ansi-color-red~

This is used in ein:tb buffers to (presumably) display some server-side
traceback in emacs, and ansi-color-yellow is particularly hard to read.
(:background yellow3)

#+begin_src emacs-lisp
(custom-set-faces!
  '(ansi-color-yellow :background "orange4")
  )
#+end_src

** COMMENT Solaire-mode

gives "unreal" (as defined by solaire-mode-real-buffer-fn returning nil) buffers
a darker background

*** vterm

solaire breaks ~rich~ (test with ~python -m rich.diagnose~), and therefore ~nbterm~

Hence we turn off solaire-mode in vterm by calling vterm buffers "real"

#+begin_src emacs-lisp
(defun vi/solaire-real-buffer-p ()
  (if (memq major-mode '(vterm-mode)) t
    (solaire-mode-real-buffer-p))
  )
(setq solaire-mode-real-buffer-fn #'vi/solaire-real-buffer-p)
#+end_src
** hl-line


#+begin_src emacs-lisp

;; https://christiantietze.de/posts/2022/03/hl-line-priority/
(setq hl-line-overlay-priority -100)
#+end_src

*** COMMENT hl-line+

#+begin_src emacs-lisp :tangle packages.el
(package! hl-line+ :recipe (:host github :repo "emacsmirror/hl-line-plus"))
#+end_src



#+begin_src emacs-lisp
(use-package! hl-line+
  :hook
  (window-scroll-functions . hl-line-flash)
  (focus-in . hl-line-flash)
  (post-command . hl-line-flash)

  :custom
  ;;(global-hl-line-mode nil)
  (hl-line-flash-show-period 0.5)
  ;; (hl-line-inhibit-highlighting-for-modes '(dired-mode))
  )
#+end_src


** cursor


#+begin_src emacs-lisp
(blink-cursor-mode)

;; Addition to nav-flash
;; (dolist (command '(scroll-up-command scroll-down-command previous-line next-line
;;                    recenter-top-bottom other-window))
;;   ;; (advice-add command :after #'pulse-line)
;;   (advice-add command :after #'+nav-flash-delayed-blink-cursor-h)
;;   )
#+end_src

*** pulsar


#+begin_src emacs-lisp :tangle packages.el
(package! pulsar)
#+end_src


#+begin_src emacs-lisp
(use-package! pulsar
  :custom
  (pulsar-pulse t)
  (pulsar-delay 0.05)
  (pulsar-iterations 3)
  (pulsar-face 'pulsar-red)
  (pulsar-highlight-face 'pulsar-yellow)
  :config
  (pulsar-global-mode 1)
  :hook (
          ;;(consult-after-jump . pulsar-recenter-top)
          (consult-after-jump . pulsar-reveal-entry)

          )
  :bind (
          ("C-x l" . pulsar-highlight-dwim)
          ("C-l" . pulsar-recenter-middle)
          )
  )

(custom-set-faces! '(pulsar-red :background "red"))
#+end_src
*** COMMENT centered

#+begin_src emacs-lisp :tangle packages.el
(package! centered-cursor-mode)
#+end_src


#+begin_src emacs-lisp
(global-centered-cursor-mode)
#+end_src

** font lock

Does this make things faster?
#+begin_src emacs-lisp
(setq font-lock-maximum-decoration nil)
#+end_src
** COMMENT tabs


#+begin_src emacs-lisp
(tab-bar-mode 1)                           ;; enable tab bar
(global-tab-line-mode t)
(setq tab-bar-show t)
(setq tab-bar-close-button-show nil)       ;; hide tab close / X button
(setq tab-bar-new-button-show nil)       ;; hide tab close / X button
(setq tab-bar-tab-hints nil)                 ;; show tab numbers
(setq tab-bar-format '(tab-bar-format-tabs tab-bar-separator))
(setq tab-bar-auto-width nil)

(setq tab-line-close-button-show nil)       ;; hide tab close / X button
(setq tab-line-new-button-show nil)       ;; hide tab close / X button

#+end_src


*** switching tabs

https://github.com/alphapapa/bufler.el/issues/84

- [] filter out hidden buffers and special tabs?
- [] cycle?
- wrap bufler's tabs function to be stable?

#+begin_src emacs-lisp
(defun vi/tab-line-first-buffer ()
  (seq-first (bufler-workspace-buffers)))

(defun vi/tab-line-last-buffer ()
  (let* (
          (bufs (bufler-workspace-buffers))
          (len (seq-length bufs))
          )
    (seq-elt bufs (- len 1))))

;; these select the first/last buffer on the tab-line of the next tab so that bufler-tabs-mode won't revert back
(defun vi/next-tab ()
  (interactive)
  (progn (tab-bar-switch-to-next-tab) (switch-to-buffer (vi/tab-line-first-buffer))))

(defun vi/prev-tab ()
  (interactive)
  (progn (tab-bar-switch-to-next-tab) (switch-to-buffer (vi/tab-line-last-buffer))))

;; these switch to the next buffer on the tab-line and then to the next tab when the last tab-line buffer is reached
(defun vi/next-tab-buffer ()
  (interactive)
  (if (eq (current-buffer) (vi/tab-line-last-buffer))
    (vi/next-tab)
    (tab-line-switch-to-next-tab)))

(defun vi/prev-tab-buffer ()
  (interactive)
  (if (eq (current-buffer) (vi/tab-line-first-buffer))
    (vi/prev-tab)
    (tab-line-switch-to-prev-tab)))


#+end_src
** highlights


#+begin_src emacs-lisp :tangle packages.el
(package! goggles :recipe (:host github :repo "minad/goggles"))
#+end_src


#+begin_src emacs-lisp
;; (volatile-highlights-mode -1)
(use-package! goggles
  :hook ((prog-mode text-mode org-mode) . goggles-mode)
  :config
  (setq-default goggles-pulse t)) ;; set to nil to disable pulsing
#+end_src
** diff-hl


#+begin_src emacs-lisp :tangle packages.el
(package! diff-hl)
#+end_src


#+begin_src emacs-lisp
(global-diff-hl-mode)
(add-hook 'magit-pre-refresh-hook 'diff-hl-magit-pre-refresh)
(add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)

#+end_src

* Parens

** with parens-mode

#+begin_src emacs-lisp
  (after! paren
    (setq show-paren-style 'expression)
    (setq show-paren-priority -25)
    (setq show-paren-delay 0.5)
    (custom-set-faces!
      ;; these are modus operandi faces
      '(show-paren-match :inherit bg-paren-match)
      '(show-paren-match-expression :inherit bg-paren-expression)
      '(show-paren-mismatch :weight bold :underline t :slant normal)
      ))
;; https://github.com/doomemacs/doomemacs/issues/6223
  (remove-hook 'doom-first-buffer-hook #'smartparens-global-mode)
#+end_src

** COMMENT with smartparens-mode

show-smartparens mode is slower than show-paren mode

#+begin_src emacs-lisp
(after! smartparens
  (show-smartparens-global-mode t)
  (setq sp-show-pair-delay 5)
  (setq sp-show-pair-match-priority -50)
  (custom-set-faces!
    '(sp-show-pair-match-content-face :background "darkgreen"))
  )
#+end_src

** wrap region

#+begin_src emacs-lisp :tangle packages.el
(package! wrap-region)
#+end_src

#+begin_src emacs-lisp
(use-package! wrap-region
  :after-call doom-first-input-hook
  :config
  (wrap-region-add-wrapper "~" "~" nil '(org-mode))
  (wrap-region-add-wrapper "'" "'" nil '(prog-mode))
  (wrap-region-add-wrapper "\"" "\"" nil '(prog-mode))
  :hook ((prog-mode . wrap-region-mode)
          (org-mode . wrap-region-mode))
  )
#+end_src

* COMMENT environment

#+begin_src emacs-lisp :tangle packages.el
(package! exec-path-from-shell)
#+end_src
* Garbage collection

#+begin_src emacs-lisp
(use-package! gcmh
    :custom
    (gcmh-verbose t)
    (gcmh-idle-delay '15)
    (gcmh-high-cons-threshold 10000000000)
  )

(defun vi/maybe-gc ()
  (interactive)
  (unless (frame-focus-state) (garbage-collect)))

(add-function :after
  after-focus-change-function
  (lambda () (run-with-timer 15 nil #'vi/maybe-gc)))

#+end_src
* Elisp

** Indentation

#+begin_src emacs-lisp
(use-package! emacs
    :after-call doom-first-buffer-hook
    :custom
    (lisp-body-indent 4)
    (lisp-indent-offset 2))
#+end_src

** Libraries
https://xenodium.com/modern-elisp-libraries/

TODO: Look into seq, map, cl- instead of dash/ht


#+begin_src emacs-lisp :tangle packages.el
(package! dash)
(package! s)
(package! f)
(package! ht)
(package! ts)
#+end_src



** Snippets

*** Find version of an installed package
#+begin_example elisp
(with-current-buffer (find-file-noselect (locate-library "consult.el"))
  (lm-version))
#+end_example

*** Debug hooks

#+begin_src emacs-lisp
(defun vi/call-logging-hooks (command &optional verbose)
  "Call COMMAND, reporting every hook run in the process.
Interactively, prompt for a command to execute.

Return a list of the hooks run, in the order they were run.
Interactively, or with optional argument VERBOSE, also print a
message listing the hooks."
  (interactive "CCommand to log hooks: \np")
  (let* ((log nil)
         (logger (lambda (&rest hooks)
                   (setq log (append log hooks nil)))))
    (vi/with-advice 'run-hooks :before logger
                    (call-interactively command))
    (when verbose
      (message
       (if log "Hooks run during execution of %s:"
         "No hooks run during execution of %s.")
       command)
      (dolist (hook log)
        (message "> %s" hook)))
    log))


(defmacro vi/with-advice (func where adfunc body)
  `(unwind-protect
       (progn
         (advice-add ,func ,where ,adfunc '((name . "vi/with-advice")))
         ,body)
     (advice-remove ,func "vi/with-advice")))
#+end_src

