.config/doom/config.el

;; Changes the colors used for mapping from SGR codes to emacs colors, in the
;; function ~ansi-color-apply~ in ansi-colors.el

;; These are controlled by the variable ~ansi-color-normal-colors-vector~~ which
;; lists a bunch of faces like ~ansi-color-red~

;; This is used in ein:tb buffers to (presumably) display some server-side
;; traceback in emacs, and ansi-color-yellow is particularly hard to read.
;; (:background yellow3)


;; [[file:config.org::*ansi colors][ansi colors:1]]
(custom-set-faces!
  '(ansi-color-yellow :background "orange4")
  )
;; ansi colors:1 ends here

;; hl-line



;; [[file:config.org::*hl-line][hl-line:1]]
;; https://christiantietze.de/posts/2022/03/hl-line-priority/
(setq hl-line-overlay-priority -100)
;; hl-line:1 ends here

;; cursor



;; [[file:config.org::*cursor][cursor:1]]
(blink-cursor-mode)

;; Addition to nav-flash
;; (dolist (command '(scroll-up-command scroll-down-command previous-line next-line
;;                    recenter-top-bottom other-window))
;;   ;; (advice-add command :after #'pulse-line)
;;   (advice-add command :after #'+nav-flash-delayed-blink-cursor-h)
;;   )
;; cursor:1 ends here

;; [[file:config.org::*pulsar][pulsar:2]]
(use-package! pulsar
  :custom
  (pulsar-pulse t)
  (pulsar-delay 0.05)
  (pulsar-iterations 3)
  (pulsar-face 'pulsar-red)
  (pulsar-highlight-face 'pulsar-yellow)
  :config
  (pulsar-global-mode 1)
  :hook (
          ;;(consult-after-jump . pulsar-recenter-top)
          (consult-after-jump . pulsar-reveal-entry)

          )
  :bind (
          ("C-x l" . pulsar-highlight-dwim)
          ("C-l" . pulsar-recenter-middle)
          )
  )

(custom-set-faces! '(pulsar-red :background "red"))
;; pulsar:2 ends here

;; font lock

;; Does this make things faster?

;; [[file:config.org::*font lock][font lock:1]]
(setq font-lock-maximum-decoration nil)
;; font lock:1 ends here

;; [[file:config.org::*highlights][highlights:2]]
;; (volatile-highlights-mode -1)
(use-package! goggles
  :hook ((prog-mode text-mode org-mode) . goggles-mode)
  :config
  (setq-default goggles-pulse t)) ;; set to nil to disable pulsing
;; highlights:2 ends here

;; [[file:config.org::*diff-hl][diff-hl:2]]
(global-diff-hl-mode)
(add-hook 'magit-pre-refresh-hook 'diff-hl-magit-pre-refresh)
(add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
;; diff-hl:2 ends here

;; with parens-mode


;; [[file:config.org::*with parens-mode][with parens-mode:1]]
(after! paren
    (setq show-paren-style 'expression)
    (setq show-paren-priority -25)
    (setq show-paren-delay 0.5)
    (custom-set-faces!
      ;; these are modus operandi faces
      '(show-paren-match :inherit bg-paren-match)
      '(show-paren-match-expression :inherit bg-paren-expression)
      '(show-paren-mismatch :weight bold :underline t :slant normal)
      ))
;; https://github.com/doomemacs/doomemacs/issues/6223
  (remove-hook 'doom-first-buffer-hook #'smartparens-global-mode)
;; with parens-mode:1 ends here

;; [[file:config.org::*wrap region][wrap region:2]]
(use-package! wrap-region
  :after-call doom-first-input-hook
  :config
  (wrap-region-add-wrapper "~" "~" nil '(org-mode))
  (wrap-region-add-wrapper "'" "'" nil '(prog-mode))
  (wrap-region-add-wrapper "\"" "\"" nil '(prog-mode))
  :hook ((prog-mode . wrap-region-mode)
          (org-mode . wrap-region-mode))
  )
;; wrap region:2 ends here

;; Garbage collection


;; [[file:config.org::*Garbage collection][Garbage collection:1]]
(use-package! gcmh
    :custom
    (gcmh-verbose t)
    (gcmh-idle-delay '15)
    (gcmh-high-cons-threshold 10000000000)
  )

(defun vi/maybe-gc ()
  (interactive)
  (unless (frame-focus-state) (garbage-collect)))

(add-function :after
  after-focus-change-function
  (lambda () (run-with-timer 15 nil #'vi/maybe-gc)))
;; Garbage collection:1 ends here

;; Indentation


;; [[file:config.org::*Indentation][Indentation:1]]
(use-package! emacs
    :after-call doom-first-buffer-hook
    :custom
    (lisp-body-indent 4)
    (lisp-indent-offset 2))
;; Indentation:1 ends here

;; Debug hooks


;; [[file:config.org::*Debug hooks][Debug hooks:1]]
(defun vi/call-logging-hooks (command &optional verbose)
  "Call COMMAND, reporting every hook run in the process.
Interactively, prompt for a command to execute.

Return a list of the hooks run, in the order they were run.
Interactively, or with optional argument VERBOSE, also print a
message listing the hooks."
  (interactive "CCommand to log hooks: \np")
  (let* ((log nil)
         (logger (lambda (&rest hooks)
                   (setq log (append log hooks nil)))))
    (vi/with-advice 'run-hooks :before logger
                    (call-interactively command))
    (when verbose
      (message
       (if log "Hooks run during execution of %s:"
         "No hooks run during execution of %s.")
       command)
      (dolist (hook log)
        (message "> %s" hook)))
    log))


(defmacro vi/with-advice (func where adfunc body)
  `(unwind-protect
       (progn
         (advice-add ,func ,where ,adfunc '((name . "vi/with-advice")))
         ,body)
     (advice-remove ,func "vi/with-advice")))
;; Debug hooks:1 ends here



;; Notes:
