.config/doom/packages.el



;; [[file:config.org::*highlights][highlights:1]]
(package! goggles :recipe (:host github :repo "minad/goggles"))
;; highlights:1 ends here

;; diff-hl



;; [[file:config.org::*diff-hl][diff-hl:1]]
(package! diff-hl)
;; diff-hl:1 ends here

;; wrap region


;; [[file:config.org::*wrap region][wrap region:1]]
(package! wrap-region)
;; wrap region:1 ends here

;; Libraries
;; https://xenodium.com/modern-elisp-libraries/

;; TODO: Look into seq, map, cl- instead of dash/ht



;; [[file:config.org::*Libraries][Libraries:1]]
(package! dash)
(package! s)
(package! f)
(package! ht)
(package! ts)
;; Libraries:1 ends here
