.config/doom/config.org
* Find file - mark readonly

#+begin_src emacs-lisp :tangle packages.el
(package! hardhat :recipe (:host github :repo "rolandwalker/hardhat"))
#+end_src

Notes:

- If a file is incorrectly marked read-only by hardhat, check variable ~~hardhat-reasons~~ (buffer-local), or ~hardhat-status~
- ~hardhat-computed-regexps~ is _cached_. Clear using ~(puthash major-mode nil hardhat-computed-regexps)~ -- see the hook below
- hardhat will only act after _the first interactive command in the buffer_

#+begin_src emacs-lisp
(use-package! hardhat
  :after-call doom-first-file-hook
  :config
  (add-to-list 'hardhat-fullpath-protected-regexps "/node_modules/")
  (add-to-list 'hardhat-fullpath-protected-regexps "/site-packages/")
  (add-to-list 'hardhat-fullpath-protected-regexps "/straight/repos/")

  ;; We want to edit Jupytext files via ein/Jupyter
  (add-to-list 'hardhat-bof-content-protected-regexps '(python-mode . "^# +jupytext:"))

  ;; ignoramus-file-exact-names matches this
  ;; hardhat-fullpath-editable-regexps doesn't match it in all cases (eg. yadm/repo.git/COMMIT_EDITMSG)
  (add-to-list 'hardhat-basename-editable-regexps "\\`COMMIT_EDITMSG\\'")

  ;; (setq ignoramus-file-exact-names (remove "COMMIT_EDITMSG" ignoramus-file-exact-names))

  ;; clear the cache upon toggling
  (add-hook! 'hardhat-mode-hook (puthash major-mode nil hardhat-computed-regexps))
  (global-hardhat-mode 1)
  )
#+end_src
* Auto saving and backups

https://pragmaticemacs.wordpress.com/2016/05/23/auto-save-and-backup-every-save/

#+begin_src emacs-lisp
;; Every 20 characters
(setq! auto-save-interval 20)
#+end_src

** backups

#+begin_src emacs-lisp
(setq! kept-new-versions 20
       vc-make-backup-files t
       kept-old-versions 0)
#+end_src

* modeline

Debugging: look at mode-line-format, mode-line-misc-info

TODO: would like to add a segment like anzu for iterm, ctrlf

#+begin_src emacs-lisp

(setq doom-emoji-fallback-font-families nil)
(after! doom-modeline
  (setq mode-line-default-help-echo nil
    doom-modeline-checker-simple-format nil
    show-help-function nil
    doom-modeline-vcs-max-length 24
    ;; doom-modeline-icon nil
    ;; doom-modeline-major-mode-color-icon nil
    doom-modeline-persp-name nil)

  (doom-modeline-def-segment purpose
    ;; Purpose-mode segment
    (when (and (boundp 'purpose-mode) purpose-mode (doom-modeline--active) (not doom-modeline--limited-width-p))
      (format (if (purpose-window-purpose-dedicated-p) "[%s]*" "[%s]") (purpose-window-purpose))))


  (doom-modeline-def-segment vi/window-info
    ;; Useful for debugging: show window name in the modeline
    (concat (doom-modeline-spc) (format "%s" (get-buffer-window))))

  (doom-modeline-def-segment recursion-depth
    "Recursive-edit depth indicator. Used in yadm-status"
    (let ((rd (recursion-depth)))
      (when (> rd 0)
        (concat (doom-modeline-spc)
          (propertize
            (concat
              " "
              (doom-modeline-icon 'faicon "nf-fa-recycle" nil nil
                :face 'all-the-icons-dsilver
                :height 0.9
                :v-adjust 0.0)
              (format " %s " rd))
            'face 'doom-modeline-warning
            'help-echo "Recursive-edit: C-] to quit")
            ))))


  ;; best to name this 'main, since main gets set as the default in
  ;; doom-modeline. other names don't seem to take effect as default..
  (doom-modeline-def-modeline 'main
    '(bar buffer-info-simple selection-info remote-host recursion-depth check matches)
    '(debug repl process lsp vcs minor-modes major-mode misc-info))

  (doom-modeline-def-modeline 'org-src
   '(bar buffer-info-simple selection-info matches)
    '(debug lsp minor-modes major-mode))

  (doom-modeline-def-modeline 'vcs
    '(bar buffer-info-simple selection-info remote-host recursion-depth)
    '( debug github process vcs minor-modes major-mode misc-info))


  ;; don't think we need this, since we modified 'main
  ;;(add-hook! '(prog-mode-hook org-mode-hook) (doom-modeline-set-modeline 'main))
  )
#+end_src



** minor modes
#+begin_src emacs-lisp :tangle packages.el
(package! minions)
#+end_src

#+begin_src emacs-lisp
(after! doom-modeline
  (setq doom-modeline-minor-modes t)
  (minions-mode)
  )
#+end_src

*** mode minder

#+begin_src emacs-lisp :tangle packages.el
(package! mode-minder :recipe (:host github :repo "jdtsmith/mode-minder"))
#+end_src

#+begin_src emacs-lisp
(use-package! mode-minder)
#+end_src



* window/Buffer management


** delete-other-windows

#+begin_src emacs-lisp
(setq ignore-window-parameters t)
#+end_src
** Dedupe windows


#+begin_src emacs-lisp
(defun vi/dedup-window-op (w table)
  (let ((b (window-buffer w)))
    ;; (message (format "%s" b))
    (if (ht-contains? table b)
        (progn
          (message (format "Deleting %s %s" w b))
          (delete-window w)
         )
      (ht-set! table b t))
    ))


(defun vi/dedup-windows()
  (interactive)
  (let ((table (ht-create)))
    (--each (window-list-1) (vi/dedup-window-op it table))
    ))
#+end_src

** Movement


#+begin_src emacs-lisp :tangle packages.el
(package! windmove)
#+end_src

#+begin_src emacs-lisp
(use-package! windmove
  :after-call doom-first-buffer-hook
  :custom
  (windmove-wrap-around nil)
  :config
  (windmove-default-keybindings 'shift)
  )
#+end_src

*** COMMENT Windmove conflicts

org-replace-disputed-keys is supposed to not affect date selection, but it
messes it up somehow. It's easier to get windmove to not use shift, instead
using ctrl.

https://orgmode.org/manual/Conflicts.html
Don't use disputed keys in org: conflicts with windmove. Putting this in
(use-package! org :init) doesn't appear to work
If you do this,
> When set, Org moves the following key bindings in
> Org files, and in the agenda buffer—but not during date selection.
>
> S-UP ⇒ M-p	S-DOWN ⇒ M-n
> S-LEFT ⇒ M--	S-RIGHT ⇒ M-+
> C-S-LEFT ⇒ M-S--	C-S-RIGHT ⇒ M-S-+


#+begin_src emacs-lisp
https://orgmode.org/org.html#Conflicts
(setq org-replace-disputed-keys t)
(after! (org windmove)
  (add-hook! 'org-shiftup-final-hook #'windmove-up)
  (add-hook! 'org-shiftleft-final-hook #'windmove-left)
  (add-hook! 'org-shiftdown-final-hook #'windmove-down)
  (add-hook! 'org-shiftright-final-hook #'windmove-right)
  )
#+end_src



** Splitting

#+begin_src emacs-lisp
(defun vi/split-window-horizontally ()
  (interactive)
  (split-window-horizontally)
  (balance-windows))
(defun vi/split-window-vertically ()
  (interactive)
  (split-window-vertically)
  (balance-windows))
(defun vi/delete-window ()
  (interactive)
  (delete-window)
  (balance-windows))

(defadvice delete-window (after restore-balance activate)
  (balance-windows))

(map! :g
      "C-x |" #'vi/split-window-horizontally
      "C-x _" #'vi/split-window-vertically
  "C-x -" #'balance-windows
      "C-x /" #'vi/delete-window)

;; https://emacs.stackexchange.com/a/40517
;; control splitting to prefer vertical? (see split-window-sensibly)
(setq split-height-threshold 80)
(setq split-width-threshold 30)
#+end_src

*** Keep windows balanced
#+begin_src emacs-lisp
;; (defadvice split-window-below (after restore-balance-below activate)
;;   (balance-windows))

;; (defadvice split-window-right (after restore-balance-right activate)
;;   (balance-windows))

;; (defadvice delete-window (after restore-balance activate)
;;   (balance-windows))
#+end_src

