.config/doom/config.el

;; - If a file is incorrectly marked read-only by hardhat, check variable ~~hardhat-reasons~~ (buffer-local), or ~hardhat-status~
;; - ~hardhat-computed-regexps~ is _cached_. Clear using ~(puthash major-mode nil hardhat-computed-regexps)~ -- see the hook below
;; - hardhat will only act after _the first interactive command in the buffer_


;; [[file:config.org::*Find file - mark readonly][Find file - mark readonly:2]]
(use-package! hardhat
  :after-call doom-first-file-hook
  :config
  (add-to-list 'hardhat-fullpath-protected-regexps "/node_modules/")
  (add-to-list 'hardhat-fullpath-protected-regexps "/site-packages/")
  (add-to-list 'hardhat-fullpath-protected-regexps "/straight/repos/")

  ;; We want to edit Jupytext files via ein/Jupyter
  (add-to-list 'hardhat-bof-content-protected-regexps '(python-mode . "^# +jupytext:"))

  ;; ignoramus-file-exact-names matches this
  ;; hardhat-fullpath-editable-regexps doesn't match it in all cases (eg. yadm/repo.git/COMMIT_EDITMSG)
  (add-to-list 'hardhat-basename-editable-regexps "\\`COMMIT_EDITMSG\\'")

  ;; (setq ignoramus-file-exact-names (remove "COMMIT_EDITMSG" ignoramus-file-exact-names))

  ;; clear the cache upon toggling
  (add-hook! 'hardhat-mode-hook (puthash major-mode nil hardhat-computed-regexps))
  (global-hardhat-mode 1)
  )
;; Find file - mark readonly:2 ends here

;; Auto saving and backups

;; https://pragmaticemacs.wordpress.com/2016/05/23/auto-save-and-backup-every-save/


;; [[file:config.org::*Auto saving and backups][Auto saving and backups:1]]
;; Every 20 characters
(setq! auto-save-interval 20)
;; Auto saving and backups:1 ends here

;; backups


;; [[file:config.org::*backups][backups:1]]
(setq! kept-new-versions 20
       vc-make-backup-files t
       kept-old-versions 0)
;; backups:1 ends here

;; modeline

;; Debugging: look at mode-line-format, mode-line-misc-info

;; TODO: would like to add a segment like anzu for iterm, ctrlf


;; [[file:config.org::*modeline][modeline:1]]
(setq doom-emoji-fallback-font-families nil)
(after! doom-modeline
  (setq mode-line-default-help-echo nil
    doom-modeline-checker-simple-format nil
    show-help-function nil
    doom-modeline-vcs-max-length 24
    ;; doom-modeline-icon nil
    ;; doom-modeline-major-mode-color-icon nil
    doom-modeline-persp-name nil)

  (doom-modeline-def-segment purpose
    ;; Purpose-mode segment
    (when (and (boundp 'purpose-mode) purpose-mode (doom-modeline--active) (not doom-modeline--limited-width-p))
      (format (if (purpose-window-purpose-dedicated-p) "[%s]*" "[%s]") (purpose-window-purpose))))


  (doom-modeline-def-segment vi/window-info
    ;; Useful for debugging: show window name in the modeline
    (concat (doom-modeline-spc) (format "%s" (get-buffer-window))))

  (doom-modeline-def-segment recursion-depth
    "Recursive-edit depth indicator. Used in yadm-status"
    (let ((rd (recursion-depth)))
      (when (> rd 0)
        (concat (doom-modeline-spc)
          (propertize
            (concat
              " "
              (doom-modeline-icon 'faicon "nf-fa-recycle" nil nil
                :face 'all-the-icons-dsilver
                :height 0.9
                :v-adjust 0.0)
              (format " %s " rd))
            'face 'doom-modeline-warning
            'help-echo "Recursive-edit: C-] to quit")
            ))))


  ;; best to name this 'main, since main gets set as the default in
  ;; doom-modeline. other names don't seem to take effect as default..
  (doom-modeline-def-modeline 'main
    '(bar buffer-info-simple selection-info remote-host recursion-depth check matches)
    '(debug repl process lsp vcs minor-modes major-mode misc-info))

  (doom-modeline-def-modeline 'org-src
   '(bar buffer-info-simple selection-info matches)
    '(debug lsp minor-modes major-mode))

  (doom-modeline-def-modeline 'vcs
    '(bar buffer-info-simple selection-info remote-host recursion-depth)
    '( debug github process vcs minor-modes major-mode misc-info))


  ;; don't think we need this, since we modified 'main
  ;;(add-hook! '(prog-mode-hook org-mode-hook) (doom-modeline-set-modeline 'main))
  )
;; modeline:1 ends here

;; [[file:config.org::*minor modes][minor modes:2]]
(after! doom-modeline
  (setq doom-modeline-minor-modes t)
  (minions-mode)
  )
;; minor modes:2 ends here

;; [[file:config.org::*mode minder][mode minder:2]]
(use-package! mode-minder)
;; mode minder:2 ends here

;; delete-other-windows


;; [[file:config.org::*delete-other-windows][delete-other-windows:1]]
(setq ignore-window-parameters t)
;; delete-other-windows:1 ends here

;; Dedupe windows



;; [[file:config.org::*Dedupe windows][Dedupe windows:1]]
(defun vi/dedup-window-op (w table)
  (let ((b (window-buffer w)))
    ;; (message (format "%s" b))
    (if (ht-contains? table b)
        (progn
          (message (format "Deleting %s %s" w b))
          (delete-window w)
         )
      (ht-set! table b t))
    ))


(defun vi/dedup-windows()
  (interactive)
  (let ((table (ht-create)))
    (--each (window-list-1) (vi/dedup-window-op it table))
    ))
;; Dedupe windows:1 ends here

;; [[file:config.org::*Movement][Movement:2]]
(use-package! windmove
  :after-call doom-first-buffer-hook
  :custom
  (windmove-wrap-around nil)
  :config
  (windmove-default-keybindings 'shift)
  )
;; Movement:2 ends here

;; Splitting


;; [[file:config.org::*Splitting][Splitting:1]]
(defun vi/split-window-horizontally ()
  (interactive)
  (split-window-horizontally)
  (balance-windows))
(defun vi/split-window-vertically ()
  (interactive)
  (split-window-vertically)
  (balance-windows))
(defun vi/delete-window ()
  (interactive)
  (delete-window)
  (balance-windows))

(defadvice delete-window (after restore-balance activate)
  (balance-windows))

(map! :g
      "C-x |" #'vi/split-window-horizontally
      "C-x _" #'vi/split-window-vertically
  "C-x -" #'balance-windows
      "C-x /" #'vi/delete-window)

;; https://emacs.stackexchange.com/a/40517
;; control splitting to prefer vertical? (see split-window-sensibly)
(setq split-height-threshold 80)
(setq split-width-threshold 30)
;; Splitting:1 ends here

;; Keep windows balanced

;; [[file:config.org::*Keep windows balanced][Keep windows balanced:1]]
;; (defadvice split-window-below (after restore-balance-below activate)
;;   (balance-windows))

;; (defadvice split-window-right (after restore-balance-right activate)
;;   (balance-windows))

;; (defadvice delete-window (after restore-balance activate)
;;   (balance-windows))
;; Keep windows balanced:1 ends here

;; Switching
