.config/doom/packages.el

;; Find file - mark readonly


;; [[file:config.org::*Find file - mark readonly][Find file - mark readonly:1]]
(package! hardhat :recipe (:host github :repo "rolandwalker/hardhat"))
;; Find file - mark readonly:1 ends here

;; minor modes

;; [[file:config.org::*minor modes][minor modes:1]]
(package! minions)
;; minor modes:1 ends here

;; mode minder


;; [[file:config.org::*mode minder][mode minder:1]]
(package! mode-minder :recipe (:host github :repo "jdtsmith/mode-minder"))
;; mode minder:1 ends here

;; Movement



;; [[file:config.org::*Movement][Movement:1]]
(package! windmove)
;; Movement:1 ends here

;; Restore


;; [[file:config.org::*Restore][Restore:1]]
(package! winner)
;; Restore:1 ends here

;; burly



;; [[file:config.org::*burly][burly:1]]
(package! burly)
;; burly:1 ends here

;; bufler


;; [[file:config.org::*bufler][bufler:1]]
(package! bufler)
;; bufler:1 ends here

;; Popups
