.config/doom/config.org
** Switching

#+begin_src emacs-lisp

(defmacro minibuffer-quit-and-run (&rest body)
  "Quit the minibuffer and run BODY afterwards."
  `(progn
     (put 'quit 'error-message "")
     (run-at-time nil nil
                  (lambda ()
                    (put 'quit 'error-message "Quit")
                    ,@body))
     (minibuffer-keyboard-quit)))


(map! "M-k" #'consult-buffer)
;; (map! :g
;;   "M-<right>" #'next-buffer
;;   "M-<left>" #'previous-buffer
;;   )

;; (map! :map org-mode-map
;;   "M-<right>" nil
;;   "M-<left>" nil
;; )

(setq! switch-to-prev-buffer-skip
  (lambda (win buf bury) (doom-special-buffer-p buf)))

;; (map! "M-k" #'purpose-switch-buffer-with-purpose)
;; (map! "M-k" #'vi/persp-consult-buffer)
;; (map! :map minibuffer-local-map "M-k" (cmd! (minibuffer-quit-and-run (consult-buffer))))
#+end_src

** Restore

#+begin_src emacs-lisp :tangle packages.el
(package! winner)
#+end_src

See [[*digit-argument][digit-argument]] for unbinding

#+begin_src emacs-lisp
(use-package! winner
  :config
  (winner-mode)
  :bind
  ;; relies on unbinding digit-argument
  ("M-9" . winner-undo)
  ("M-0" . winner-redo)
  )
#+end_src

*** zygospore

Reversible C-x 1: if there are multiple windows, it does a winner-undo. Otherwise, delete-other-windows.

Inspired by https://github.com/LouisKottmann/zygospore.el

#+begin_src emacs-lisp
(defun vi/zygospore ()
  (interactive)
  (if (= (count-windows) 1) (winner-undo) (delete-other-windows)))

(map! :g "C-x 1" #'vi/zygospore)
#+end_src

** COMMENT zoom


#+begin_src emacs-lisp :tangle packages.el
(package! zoom) ;; :recipe (:host github :repo "cyrus-and/zoom"))
#+end_src


https://github.com/doomemacs/doomemacs/issues/2225

#+begin_src emacs-lisp
(use-package! zoom
  ;; :hook (doom-first-buffer . zoom-mode)
  :custom
  (zoom-size '(0.618 . 0.618))
  (zoom-ignored-major-modes '(undo-tree-visualizer-mode vundo--mode))
  (zoom-ignore-predicates (list (lambda () (< (count-lines (point-min) (point-max)) 20))))
  )
#+end_src

** burly


#+begin_src emacs-lisp :tangle packages.el
(package! burly)
#+end_src



#+begin_src emacs-lisp
(defhydra hydra-burly (:color blue :hint nil)
  "
Burly Commands
--------------
_b_: Open bookmarks    _s_: Save layout
_r_: Restore layout    _n_: New layout
_q_: Quit
"
  ("b" burly-open-bookmark)
  ("s" burly-bookmark-windows)
  ("r" burly-open-bookmark)
  ("n" burly-reset-window-layout)
  ("q" nil :color blue))
#+end_src

** bufler

#+begin_src emacs-lisp :tangle packages.el
(package! bufler)
#+end_src

Bufler groups:

- Constructs a tree, buffers are the leaves.
- Each buffer is assigned its path from the root to the leaf; so bufler-groups
  is ultimately a function like ~(buf) -> [node]~, where each ~node~ is a string.
- Each type function is ~(buf) -> node~; they assign one step along this path.
  eg. ~auto-*, *-match, dir, hidden~
- A list of type functions will therefore return ~[node]~ - the simple case.
- ~group*()~ functions define branching in this logic: if a buffer "matches" the
  group, it is then "captured" by this group and recurses into the type
  functions within that group for the remainder of its path.
- "Matching" a group can mean:

  ~group(T1 T2...)~ -> if T1 returns non-nil
  ~group-and(T1 T2...)~ -> if all T* return non-nil
  ~group-or(T1 T2...)~ -> if any of T* return non-nil

  Note that T* above are returning steps in ~[node]~.

  Any node == nil is dropped.

- Since groups will capture, their order matters, since buffers will recurse
  into the first group they match.

- ~bufler-filter-name-regexps~ and ~bufler-filter-buffer-modes~ can specify rules to
  match buffers to the hidden entirely; ~bufler-filter-buffer-fns~ implement the
  above filters via ~bufler--buffer-{mode,name}-filtered-p~


#+begin_src emacs-lisp
(use-package! bufler
  :after-call doom-first-buffer-hook
  :custom
  (bufler-vc-state nil)
  (bufler-columns '("Name" "VC" "Path" "Mode"))
  (bufler-filter-name-regexps '("\\*Compile-Log\\*"
                                 "\\*Disabled Command\\*"
                                 ;; "\\*Org [^z-a]+Output\\*"
                                 ))
  (bufler-filter-buffer-modes '(bufler-list-mode
                                 ;; calendar-mode
                                 magit-diff-mode
                                 magit-process-mode
                                 magit-revision-mode
                                 magit-section-mode
                                 ;; special-mode
                                 timer-list-mode))
  (bufler-filter-buffer-fns
    '(bufler--buffer-hidden-p bufler--buffer-mode-filtered-p bufler--buffer-name-filtered-p)
    )
  (bufler-groups
    (bufler-defgroups
      ;; suppressed above by bufler--buffer-hidden-p
      ;; (group (hidden))
      (group
        ;; Group all Ein buffers
        (name-match "*Ein*" (rx bos (or " *ein" "*ein"))))
      (group (mode-match "*Vterm*" (rx bos "vterm-")))
      (group
        ;; Subgroup collecting all `help-mode' and `info-mode' buffers.
        (group-or "*Help/Info*"
          (mode-match "*Help*" (rx bos "help-"))
          (mode-match "*Info*" (rx bos "info-"))))
      (group
        ;; Subgroup collecting all special buffers (i.e. ones that are not
        ;; file-backed), except `magit-status-mode'/dired buffers (which are allowed to fall
        ;; through to other groups, so they end up grouped with their project buffers).
        (group-and "*Special*"
          (lambda (buffer)
            (unless (or (funcall (mode-match "Magit" (rx bos "magit-status")) buffer)
                      (funcall (mode-match "Dired" (rx bos "dired")) buffer)
                      (funcall (auto-file) buffer))
              "*Special*"))
          )
        (group
          ;; Subgroup collecting these "special special" buffers
          ;; separately for convenience.
          (name-match "**Extra-Special**"
            (rx bos "*" (or "Messages" "Warnings" "scratch" "Backtrace") "*")))
        (group
          ;; Subgroup collecting all other Magit buffers, grouped by directory.
          (mode-match "*Magit* (non-status)" (rx bos (or "magit" "forge") "-"))
          (auto-directory)
          )
        ;; Remaining special buffers are grouped automatically by mode.
        (auto-mode))
      ;; (group-and "Remaining specials?" (auto-special))
      ;; All buffers under "~/.emacs.d" (or wherever it is).
      (dir user-emacs-directory)
      (group
        ;; Subgroup collecting buffers in `org-directory'
        (dir org-directory)
        (group
          ;; Subgroup collecting indirect Org buffers, grouping them by file.
          ;; This is very useful when used with `org-tree-to-indirect-buffer'.
          (auto-indirect)
          (auto-file)
          )
        ;; Group remaining buffers by whether they're file backed, then by mode.
        (group-not "*special*" (auto-file))
        (auto-mode)
        )
      (group
        ;; Subgroup collecting buffers in a projectile project.
        ;; (auto-projectile)

        (auto-project)
        (group (filename-match "venv" (rx ".venv/")))
        (auto-mode)
        )

      ;; Group remaining buffers by directory, then major mode.
      (auto-directory)
      (auto-mode)
      )
    )
  :config
  ;; (bufler-workspace-tabs-mode)

  ;; Note: tab-bar doesn't always update immediately
  ;; (add-hook! '(doom-switch-buffer-hook doom-switch-window-hook consult-after-jump-hook)
  ;;   (defun vi/bufler-workspace-focus-buffer ()
  ;;     (when (not (eq major-mode #'minibuffer-mode))
  ;;       ;; (message (format "Focusing %s %s" (current-buffer) (bufler-workspace-focus-buffer (current-buffer))))))
  ;;       (bufler-workspace-focus-buffer (current-buffer))))
  ;;   )

  :bind
  ("C-x C-b" . bufler)
  )

(after! bufler
  (bufler-define-buffer-command revert "Revert buffer."
    (lambda (buffer)
      (when (buffer-file-name buffer)
        (with-current-buffer buffer
          (revert-buffer)))))
  (map! :mode bufler-list-mode "v" #'bufler-list-buffer-revert)

  )
#+end_src

