.config/doom/config.org
** Popups


https://github.com/karthink/popper/issues/38
#+begin_src emacs-lisp :tangle packages.el
(package! popper :recipe (:host github :repo "karthink/popper" :branch "local-mode-line-format"))
#+end_src


#+begin_src emacs-lisp
(use-package! popper
  :init
  (setq popper-mode-line " POP ")
  (setq popper-reference-buffers
        '(
             ;; "\\*Messages\\*"
          "Output\\*$"
          "\\*Async Shell Command\\*"
          "\\*doom eval\\*"
          help-mode
          comint-mode
          helpful-mode
          python-pytest-mode
          ;; bufler-list-mode

          ;; we want to use a custom doom-modeline segment vterm-copy-mode
          ;; vterm-mode ;; https://github.com/karthink/popper/issues/38

          flycheck-error-list-mode
          flycheck-projectile-error-list-mode
          inferior-python-mode
          compilation-mode))
  (popper-mode +1)
  (popper-echo-mode +1))

(after! popper
  (add-hook! 'doom-escape-hook
             (defun vi/close-popup()
               ;; Return nil so the rest of the hooks do run
               (progn (popper-close-latest) nil))))
#+end_src
** COMMENT purpose

#+begin_src emacs-lisp :tangle packages.el
(package! window-purpose)
#+end_src


#+begin_src emacs-lisp
(use-package! window-purpose
  :custom
  (purpose-user-mode-purposes '(
                                (prog-mode . prog) (org-mode . prog)
                                ;; Protect the minibuffer from opening things while previewing
                                (minibuffer-mode . minibuf)
                                (vterm-mode . term)))
  (purpose-user-regexp-purposes '(
                                  ;; Ein has some hidden buffers with the
                                  ;; appropriate prog mode, but we want them in
                                  ;; the same window
                                  ("\\` ?\\*ein" . ein)
                                  ("\\` " . hidden)
                                  ("\\*" . special)
                                  ))
  (purpose-use-default-configuration nil)
  :after-call doom-first-buffer-hook
  :config

  (purpose-compile-user-configuration)

  ;; Dedicate all non-general windows so that they don't get other-purpose
  ;; buffers in them
  (defun vi/dedicate-if-purpose (&optional win)
    (let ((win (or win (get-buffer-window))))
      ;; (message (format "Fired dedication hook %s" win))
      (when (and
             ;; not already dedicated
             (not (purpose-window-purpose-dedicated-p win))
             ;; and not 'general
             (not (eq (purpose-window-purpose win) default-purpose)))
        ;; (message (format "Dedicating %s" win))
        (purpose-set-window-purpose-dedicated-p win t)
        )))

  ;; I tried window-buffer-change-functions (got reset to doom-run-switch-buffer-hooks), purpose-display-buffer-functions --
  ;; they didn't seem to work, but not sure
  (add-hook! '(doom-switch-buffer-hook doom-switch-window-hook) #'vi/dedicate-if-purpose)

  (purpose-mode)
  )

;; If we want consult preview to not open in different windows according to purpose
(after! (consult window-purpose)
  (defun without-purpose-advice (orig-fun &rest args)
    (without-purpose (apply orig-fun args)))
  (advice-add 'consult--with-preview-1 :around #'without-purpose-advice))

(after! (embark window-purpose)
  (map! :map embark-become-file+buffer-map "B" #'purpose-switch-buffer-overload)
  (map! "C-;" #'iedit-mode)
  )
#+end_src

** COMMENT persp customizations

persp-mode is built in with doom but let's specify it anyway

#+begin_src emacs-lisp :tangle packages.el
(package! persp-mode)
(unpin! persp-mode)
#+end_src

*** COMMENT auto persps for projectile

We don't need auto-persps for projectile; we can create those via doom easily

#+begin_src emacs-lisp :tangle packages.el
(package! persp-mode-projectile-bridge :recipe (:host github :repo "Bad-ptr/persp-mode-projectile-bridge.el"))
#+end_src

#+begin_src emacs-lisp
(use-package! persp-mode-projectile-bridge
    :after-call doom-first-buffer-hook
    :custom
    (persp-mode-projectile-bridge-persp-name-prefix "[p] ")
    :config
    (persp-mode-projectile-bridge-mode 1)
    )
#+end_src

*** auto persps

#+begin_src emacs-lisp
(after! persp-mode
  (persp-def-auto-persp "vterm"
    :parameters '((dont-save-to-file . t))
    :mode 'vterm-mode
    :dyn-env '(after-switch-to-buffer-functions ;; prevent recursion
                (persp-add-buffer-on-find-file nil)
                persp-add-buffer-on-after-change-major-mode)
    :hooks '(after-switch-to-buffer-functions)
    :on-match #'vi/set-auto-persp-on-match
    :switch 'frame)
  (persp-def-auto-persp "ein"
    :parameters '((dont-save-to-file . t))
    :buffer-name "*ein:"
    :dyn-env '(after-switch-to-buffer-functions ;; prevent recursion
                (persp-add-buffer-on-find-file nil)
                persp-add-buffer-on-after-change-major-mode)
    :hooks '(after-switch-to-buffer-functions)
    :on-match #'vi/set-auto-persp-on-match
    :switch 'frame)
  )
#+end_src

#+begin_src emacs-lisp
(defun vi/persp-consult-buffer()
    (interactive)
    (with-persp-buffer-list () (consult-buffer)))
#+end_src

**** Reset auto persp

One problem is that these auto perspectives don't restrict which buffers can be
added to them. So it would be nice to reset them; how to do that?

persp-buffer-list will contain all the manually added buffers

persp-buffer-match-auto-persp-p doesn't work: https://github.com/Bad-ptr/persp-mode.el/issues/135

We could use the :after-match function to set some buffer-local variable
tracking all perspectives that were set auto.

Note that this won't work with persp-mode-projectile-bridge (look at
~persp-mode-projectile-bridge-find-perspective-for-buffer~ for how to handle it -- we'll need a custom ~matches-auto-persp-p~, and test ~safe-persp-parameters~ for ~persp-mode-projectile-bridge t~ )?

#+begin_src emacs-lisp
(defun vi/set-auto-persp (persp buf)
  ;; track the auto persps that this buf belongs to, in a buffer local hash
  (with-current-buffer buf
    (-let ((ap (or (bound-and-true-p vi--auto-persps) (ht-create))))
        (progn
            (ht-set! ap (safe-persp-name persp) t)
            (setq-local vi--auto-persps ap))
        )
    ))

(defun vi/set-auto-persp-on-match (state)
  ;; on-match hook for persp-def-auto-persp
    (-let ((persp (alist-get 'persp state))
              (buffer (alist-get 'buffer state)))
        (vi/set-auto-persp persp buffer))
    state)

(defun vi/matches-auto-persp-p (persp buf)
  ;; replacement for persp-buffer-match-auto-persp-p that actually works, using our own vi--auto-persps machinery
  (with-current-buffer buf
    (and (buffer-local-boundp 'vi--auto-persps buf) (ht-contains? vi--auto-persps persp))
    ))

(defun vi/persp-auto-buffer-list()
  ;; persp-buffer-list filtered for buffers belonging to the current auto persp
  (let ((persp (safe-persp-name (get-current-persp))))
    (--filter (vi/matches-auto-persp-p persp it) (persp-buffer-list))
    )
  )

(defun vi/reset-auto-persp-windows()
  ;; reset current (auto) persp to only buffers matching it
    (interactive)
    (delete-other-windows)
    (--each (vi/persp-auto-buffer-list) (display-buffer-pop-up-window it ()))
  )
#+end_src


** recentf

Load recentf files on startup

#+begin_src emacs-lisp
(add-hook! 'doom-first-input-hook #'recentf-mode)
#+end_src
** buffer expose
:PROPERTIES:
:CREATED:  [2023-10-23 Mon 15:13]
:END:


#+begin_src emacs-lisp :tangle packages.el
(package! buffer-expose)
#+end_src

