.config/doom/config.el

;; [[file:config.org::*Popups][Popups:3]]
(use-package! popper
  :after-call doom-first-buffer-hook
  :init
  (setq popper-mode-line " POP ")
  (setq popper-reference-buffers
        '(
             ;; "\\*Messages\\*"
          "Output\\*$"
          "\\*Async Shell Command\\*"
          "\\*doom eval\\*"
          help-mode
          comint-mode
          helpful-mode
          python-pytest-mode
          ;; bufler-list-mode

          ;; we want to use a custom doom-modeline segment vterm-copy-mode
          ;; vterm-mode ;; https://github.com/karthink/popper/issues/38

          flycheck-error-list-mode
          flycheck-projectile-error-list-mode
          inferior-python-mode
          compilation-mode))
  (popper-mode +1)
  (popper-echo-mode +1))

(after! popper
  (add-hook! 'doom-escape-hook
             (defun vi/close-popup()
               ;; Return nil so the rest of the hooks do run
               (progn (popper-close-latest) nil))))
;; Popups:3 ends here

;; recentf

;; Load recentf files on startup


;; [[file:config.org::*recentf][recentf:1]]
(add-hook! 'doom-first-input-hook #'recentf-mode)
;; recentf:1 ends here

;; home grown
;; :PROPERTIES:
