.config/doom/packages.el


;; https://github.com/karthink/popper/issues/38

;; [[file:config.org::*Popups][Popups:1]]
(package! popper :recipe (:host github :repo "karthink/popper" :branch "local-mode-line-format"))
;; Popups:1 ends here

;; [[file:config.org::*Popups][Popups:2]]
;; (package! popper )
;; Popups:2 ends here

;; buffer expose
;; :PROPERTIES:
;; :CREATED:  [2023-10-23 Mon 15:13]
;; :END:



;; [[file:config.org::*buffer expose][buffer expose:1]]
(package! buffer-expose)
;; buffer expose:1 ends here
