.config/doom/config.org
*** home grown
:PROPERTIES:
:CREATED:  [2023-10-23 Mon 15:29]
:END:


#+begin_src emacs-lisp
(defun vi/get-buffers-by-predicate (pred)
  "Return a list of buffers that satisfy the given predicate."
  (seq-filter pred (buffer-list)))

(defun is-prime (n)
  "Check if N is a prime number."
  (if (< n 2)
      nil
    (not (cl-some (lambda (x) (= 0 (% n x))) (number-sequence 2 (floor (sqrt n)))))))

(defun closest-factors-based-on-frame (n w h)
  "Find the closest factors of N based on frame dimensions W x H."
  (message "n=%s w=%s h=%s" n w h)
  (if (< n 4)
      (list 1 n)
    (let ((aspect-ratio (/ (float w) h))
           (best-diff 9999999)
           (best-factors nil))
      (dotimes (i (floor (sqrt n)))
        (let* ((rows (1+ i))
                (cols (ceiling (/ (float n) rows)))
                (grid-aspect-ratio (/ (float cols) rows))
                (diff (abs (- aspect-ratio grid-aspect-ratio))))
          (when (and (< diff best-diff)
                  (> rows 1))  ; Avoid 1xn grids
            (setq best-diff diff)
            (setq best-factors (list rows cols)))))
      best-factors)))

(defun split-window-multiple-ways (x y)
  "Split the current frame into a grid of X columns and Y rows."
  (interactive "nColumns: \nnRows: ")
  ;; one window
  (delete-other-windows)
  (dotimes (i (1- x))
      (split-window-horizontally)
      (dotimes (j (1- y))
	(split-window-vertically))
      (other-window y))
  (dotimes (j (1- y))
    (split-window-vertically))
  (balance-windows))

(autoload 'windmove-find-other-window "windmove"
"Return the window object in direction DIR.

\(fn dir &optional arg window)")

(declare-function windmove-find-other-window "windmove" (dir &optional arg window))

(defun get-window-in-frame (x y &optional frame)
  "Find Xth horizontal and Yth vertical window from top-left of FRAME."
  (let ((orig-x x) (orig-y y)
        (w (frame-first-window frame)))
    (while (and (windowp w) (> x 0))
      (setq w (windmove-find-other-window 'right 1 w)
            x (1- x)))
    (while (and (windowp w) (> y 0))
      (setq w (windmove-find-other-window 'down 1 w)
            y (1- y)))
    (unless (windowp w)
      (error "No window at (%d, %d)" orig-x orig-y))
    w))

(defun set-window-buffer-in-frame (x y buffer &optional frame)
  "Set Xth horizontal and Yth vertical window to BUFFER from top-left of FRAME."
  (set-window-buffer (get-window-in-frame x y frame) buffer))

(defun vi/layout-buffers-in-grid (buffer-list)
  "Layout buffers in a grid."
  (let* ((total-buffers (length buffer-list))
         (is-total-buffers-prime (is-prime total-buffers))
         (w (frame-width))
         (h (frame-height))
         (factors (closest-factors-based-on-frame (if is-total-buffers-prime
                                                      (1+ total-buffers)
                                                    total-buffers) w h))
         (rows (car factors))
         (cols (cadr factors))
         (counter 0))

    (if is-total-buffers-prime
        (setq buffer-list (append buffer-list (list (generate-new-buffer " *dummy*")))))

    (message "%s %s %s %s" total-buffers rows cols factors)

    ;; Use your function to split the window into a grid
    (split-window-multiple-ways cols rows)

    (balance-windows)

    ;; Populate windows with buffers
    (dotimes (y rows)
      (dotimes (x cols)
        (when (< counter total-buffers)
          (set-window-buffer-in-frame x y (nth counter buffer-list))
          (setq counter (1+ counter)))))

    ;; Cleanup
    (when is-total-buffers-prime
      (kill-buffer " *dummy*"))))


(defun vi/tile-buffers-for-mode (mode)
  "Tile all buffers with the given major mode."
  (let ((buffers (vi/get-buffers-by-predicate (lambda (buf)
                                                (with-current-buffer buf
                                                  (eq major-mode mode))))))
    (delete-other-windows)
    (vi/layout-buffers-in-grid buffers)))


(defun vi/tile-vterm-buffers ()
  "Tile all vterm buffers."
  (interactive)
  (vi/tile-buffers-for-mode 'vterm-mode))


(defun vi/get-project-buffers ()
  "Get all non-* buffers in the current project."
  (let ((project-root (projectile-project-root)))
    (if project-root
        (vi/get-buffers-by-predicate
         (lambda (buf)
           (and (not (string-prefix-p "*" (buffer-name buf)))
                (string-prefix-p project-root (or (buffer-file-name buf) "")))))
      (progn
        (message "Project root is nil")
        '()))))


(defun vi/tile-project-buffers ()
  "Tile all non-* buffers in the current project."
  (interactive)
  (let ((project-buffers (vi/get-project-buffers)))
    (if project-buffers
      (vi/layout-buffers-in-grid project-buffers)
      (message "No project buffers found."))))

;; TODO: make package https://chat.openai.com/share/7dfa1e04-31f2-459d-bb47-a914a85e9889

(defun vi/fix-window-size ()
  "Change process window size."
  (interactive)
  (message "fixing window size")
  (when (derived-mode-p 'comint-mode)
    (let ((process (get-buffer-process (current-buffer))))
      (unless (eq nil process)
        (set-process-window-size process (window-height) (window-width))))))

(defun vi/toggle-window-dedicated ()
  "Toggle whether the current active window is dedicated or not"
  (interactive)
  (message
   (if (let (window (get-buffer-window (current-buffer)))
         (set-window-dedicated-p window
           (not (window-dedicated-p window))))
       "Window '%s' is dedicated"
     "Window '%s' is normal")
   (current-buffer)))

#+end_src

* Fonts

** Fontsets
*** Notes

- Emacs uses fontsets, which are a bundle of fonts, so that missing glyphs in
  one font can fall through to others.
  https://archive.casouri.cat/note/2021/fontset/index.html
- there are three defined automatically (https://www.gnu.org/software/emacs/manual/html_node/emacs/Defining-Fontsets.html)
  - fontset-startup (which I guess is based on the environment where Emacs runs;
    in our case it picks up fonts from Gnome. the "default" face uses this
    currently)
  - fontset-default (is the fallback)
  - fontset-standard (is only used when selected explicitly). Based on ~standard-fontset-spec~
- It is possible to define mappings for individual glyphs, ranges of glyphs,
  scripts, charsets etc to a font (-spec) using ~set-fontset-font~.
- The ~unicode-fonts~ package, which Doom sets up using ~:ui unicode~ does this for
  you for a large subset of Unicode blocks. It has a bunch of fonts configured
  by default (~unicode-fonts-block-font-mapping~), and then filters that list for
  the ones on your system, and finally calls ~set-fontset-font~ appropriately.
- ~doom-font~ and ~doom-unicode-font~ are Doom-specific settings; when unicode-fonts
  is used, Doom makes ~doom-unicode-font~ the priority for all blocks in
  ~unicode-fonts-block-font-mapping~
- When ~use-default-font-for-symbols~ is non-nil, Emacs uses the default font for
  symbols, but then identifies a fallback for each missing glyph
  (https://emacs.stackexchange.com/a/62056). This can mean that different glyphs
  come from different fonts, and in some contexts (eg. ~vundo~,
  https://github.com/casouri/vundo/issues/12#issuecomment-1075991819), they can
  interact poorly.

http://idiocy.org/emacs-fonts-and-fontsets.html
https://www.emacswiki.org/emacs/FontSets
http://xahlee.info/emacs/emacs/emacs_list_and_set_font.html
https://emacs.stackexchange.com/questions/5689/force-a-single-font-for-all-unicode-glyphs
https://en.wikipedia.org/wiki/Unicode_block

**** Why not use :ui unicode-fonts

unicode-fonts seems to be best tuned if you want a number of different
scripts/languages to be visible (eg. ~view-hello-file~).

We don't care so much about this, instead we want various glyphs and icon fonts
to work together, and this seems to add complexity and hide what is happening.

So it may be simpler to use ~set-fontset-font~ directly.

In fact, in practice, ~view-hello-file~ looks a lot better with unicode-fonts
turned off!


*** Fonts for various unicode ranges

- We want to use "patched" fonts (see https://github.com/ryanoasis/nerd-fonts),
  which include a bunch of nice glyphs in their unused slots, and can be used in
  terminal prompts etc.
- ~all-the-icons~ provides some icon fonts which get used in treemacs, vertico
  buffers etc.
- We want to be able to select a specific font for our coding, without regard to
  whether this has all symbol ranges represented.
- We want to force specific Unicode blocks/ranges to use a single font to avoid
  inconsistencies b/w glyphs (eg. vundo).

**** Notes on font-startup fontset

- When you ~describe-fontset~, pay attention to "REQUESTED" and [OPENED] -- Emacs
  is trying to find fonts with specific glyphs that match some font-spec in the
  fontset. It is unclear to me how this search is ranked, but it usually returns
  Gnome's monospace font first -- which is why Emacs runs with that for most
  symbols.

*** COMMENT prevent using system font

This doesn't prevent fontset-startup from getting created, but Emacs no longer
responds to changes in the system monospace text font. Actually it's nice to
have Emacs use the system monospace font, so this is commented.

#+begin_src emacs-lisp
(add-hook! 'after-setting-font-hook (setq font-use-system-font nil))
#+end_src


