.config/doom/config.el
;; :CREATED:  [2023-10-23 Mon 15:29]
;; :END:



;; [[file:config.org::*home grown][home grown:1]]
(defun vi/get-buffers-by-predicate (pred)
  "Return a list of buffers that satisfy the given predicate."
  (seq-filter pred (buffer-list)))

(defun is-prime (n)
  "Check if N is a prime number."
  (if (< n 2)
      nil
    (not (cl-some (lambda (x) (= 0 (% n x))) (number-sequence 2 (floor (sqrt n)))))))

(defun closest-factors-based-on-frame (n w h)
  "Find the closest factors of N based on frame dimensions W x H."
  (message "n=%s w=%s h=%s" n w h)
  (if (< n 4)
      (list 1 n)
    (let ((aspect-ratio (/ (float w) h))
           (best-diff 9999999)
           (best-factors nil))
      (dotimes (i (floor (sqrt n)))
        (let* ((rows (1+ i))
                (cols (ceiling (/ (float n) rows)))
                (grid-aspect-ratio (/ (float cols) rows))
                (diff (abs (- aspect-ratio grid-aspect-ratio))))
          (when (and (< diff best-diff)
                  (> rows 1))  ; Avoid 1xn grids
            (setq best-diff diff)
            (setq best-factors (list rows cols)))))
      best-factors)))

(defun split-window-multiple-ways (x y)
  "Split the current frame into a grid of X columns and Y rows."
  (interactive "nColumns: \nnRows: ")
  ;; one window
  (delete-other-windows)
  (dotimes (i (1- x))
      (split-window-horizontally)
      (dotimes (j (1- y))
	(split-window-vertically))
      (other-window y))
  (dotimes (j (1- y))
    (split-window-vertically))
  (balance-windows))

(autoload 'windmove-find-other-window "windmove"
"Return the window object in direction DIR.

\(fn dir &optional arg window)")

(declare-function windmove-find-other-window "windmove" (dir &optional arg window))

(defun get-window-in-frame (x y &optional frame)
  "Find Xth horizontal and Yth vertical window from top-left of FRAME."
  (let ((orig-x x) (orig-y y)
        (w (frame-first-window frame)))
    (while (and (windowp w) (> x 0))
      (setq w (windmove-find-other-window 'right 1 w)
            x (1- x)))
    (while (and (windowp w) (> y 0))
      (setq w (windmove-find-other-window 'down 1 w)
            y (1- y)))
    (unless (windowp w)
      (error "No window at (%d, %d)" orig-x orig-y))
    w))

(defun set-window-buffer-in-frame (x y buffer &optional frame)
  "Set Xth horizontal and Yth vertical window to BUFFER from top-left of FRAME."
  (set-window-buffer (get-window-in-frame x y frame) buffer))

(defun vi/layout-buffers-in-grid (buffer-list)
  "Layout buffers in a grid."
  (let* ((total-buffers (length buffer-list))
         (is-total-buffers-prime (is-prime total-buffers))
         (w (frame-width))
         (h (frame-height))
         (factors (closest-factors-based-on-frame (if is-total-buffers-prime
                                                      (1+ total-buffers)
                                                    total-buffers) w h))
         (rows (car factors))
         (cols (cadr factors))
         (counter 0))

    (if is-total-buffers-prime
        (setq buffer-list (append buffer-list (list (generate-new-buffer " *dummy*")))))

    (message "%s %s %s %s" total-buffers rows cols factors)

    ;; Use your function to split the window into a grid
    (split-window-multiple-ways cols rows)

    (balance-windows)

    ;; Populate windows with buffers
    (dotimes (y rows)
      (dotimes (x cols)
        (when (< counter total-buffers)
          (set-window-buffer-in-frame x y (nth counter buffer-list))
          (setq counter (1+ counter)))))

    ;; Cleanup
    (when is-total-buffers-prime
      (kill-buffer " *dummy*"))))


(defun vi/tile-buffers-for-mode (mode)
  "Tile all buffers with the given major mode."
  (let ((buffers (vi/get-buffers-by-predicate (lambda (buf)
                                                (with-current-buffer buf
                                                  (eq major-mode mode))))))
    (delete-other-windows)
    (vi/layout-buffers-in-grid buffers)))


(defun vi/tile-vterm-buffers ()
  "Tile all vterm buffers."
  (interactive)
  (vi/tile-buffers-for-mode 'vterm-mode))


(defun vi/get-project-buffers ()
  "Get all non-* buffers in the current project."
  (let ((project-root (projectile-project-root)))
    (if project-root
        (vi/get-buffers-by-predicate
         (lambda (buf)
           (and (not (string-prefix-p "*" (buffer-name buf)))
                (string-prefix-p project-root (or (buffer-file-name buf) "")))))
      (progn
        (message "Project root is nil")
        '()))))


(defun vi/tile-project-buffers ()
  "Tile all non-* buffers in the current project."
  (interactive)
  (let ((project-buffers (vi/get-project-buffers)))
    (if project-buffers
      (vi/layout-buffers-in-grid project-buffers)
      (message "No project buffers found."))))

;; TODO: make package https://chat.openai.com/share/7dfa1e04-31f2-459d-bb47-a914a85e9889

(defun vi/fix-window-size ()
  "Change process window size."
  (interactive)
  (message "fixing window size")
  (when (derived-mode-p 'comint-mode)
    (let ((process (get-buffer-process (current-buffer))))
      (unless (eq nil process)
        (set-process-window-size process (window-height) (window-width))))))

(defun vi/toggle-window-dedicated ()
  "Toggle whether the current active window is dedicated or not"
  (interactive)
  (message
   (if (let (window (get-buffer-window (current-buffer)))
         (set-window-dedicated-p window
           (not (window-dedicated-p window))))
       "Window '%s' is dedicated"
     "Window '%s' is normal")
   (current-buffer)))
;; home grown:1 ends here
