.config/doom/config.org
*** COMMENT Base config

Test on ~view-hello-file~. As of <2022-03-24 Thu> emoji doesn't work

#+begin_src emacs-lisp
(add-hook! after-setting-font
  (defun vi/set-fontsets ()
    ;; Prevent emacs from using the default font for symbols and punctuation; this
    ;; will cause fontsets to be used.
    (setq use-default-font-for-symbols nil)

    ;; Next we want to set Google's Noto Sans fonts (like Noto Sans Cherokee, Noto
    ;; Sans Armenian) to be the backup, since they represent a lot of different
    ;; scripts; but there doesn't seem to be a way to specify a font-family prefix
    ;; like "Noto Sans*". So we use the foundry name :GOOG, and cross our fingers.
    ;; See https://gist.github.com/alanthird/7152752d384325a83677f4a90e1e1a05 for
    ;; a more explicit setting
    ;;
    ;; default for fontset-startup, we append so that it's at the end
    (set-fontset-font "fontset-startup" nil (font-spec :foundry "GOOG") nil 'append)

    ;; default for fontset-default (which is the fallback for fontset-startup)
    (set-fontset-font t nil (font-spec :foundry "GOOG"))
    )
  )
#+end_src

*** COMMENT Per block Config

Edit <2022-03-24 Thu>: See
https://github.com/casouri/vundo/issues/12#issuecomment-1078557737 for why I
turned this off -- there's a smaller fix in [[*vundo][vundo]]

We are deliberately using this separate from the :ui module, since all we want
is the unicode block info in ~unicode-fonts-blocks~. We are not calling
~(unicode-fonts-setup)~

#+begin_src emacs-lisp :tangle packages.el
(package! unicode-fonts)
#+end_src

#+begin_src emacs-lisp

;; We use unicode-fonts for the definition of Unicode block ranges
(use-package! unicode-fonts
  :config

  ;; Set Symbola for a bunch of blocks used in vundo so they are all the same
  ;; font (https://github.com/casouri/vundo/issues/12#issuecomment-1075991819)
  (dolist (unicode-block '(
                           "Box Drawing"
                           "Geometric Shapes"
                           "Geometric Shapes Extended"))
    (let* (
           (char-range (cdr (assoc unicode-block unicode-fonts-blocks)))
           (start (car char-range))
           (end (cadr char-range)))
      (set-fontset-font "fontset-startup" (cons start end) (font-spec :family "Symbola"))))
)
#+end_src


** Adjust for display size change

#+begin_src emacs-lisp :tangle packages.el
(package! dispwatch :recipe (:host github :repo "mnp/dispwatch"))
#+end_src


#+begin_src emacs-lisp
(defun vi/set-font-size (sz)
  (font-put doom-font :size sz)
  ;; (setq! doom-font (font-spec :size sz))
  (doom/reload-font)
  (message "Setting font size to: %s" sz)
  sz
  )

;; see (dispwatch--get-display)
;; Can be run manually like (vi/adjust-font-size-for-display '(3440 . 1440))
;; See https://github.com/doomemacs/doomemacs/issues/6131#issuecomment-1051576882
(defun vi/adjust-font-size-for-display (disp)
  (message "rejiggering for %s" disp)
  (cond ((equal disp '(3440 . 1440))   ; LG monitor
          (vi/set-font-size 16.0))
    ((equal disp '(3000 . 2000))    ; laptop @ 100%, 200%
      (vi/set-font-size 13.0))
    ((equal disp '(4800 . 3200))    ; laptop @ 125%
      (vi/set-font-size 14.0))
    ((equal disp '(4002 . 2668))    ; laptop @ 150%
      (vi/set-font-size 14.0))
    ((equal disp '(3426 . 2284))    ; laptop @ 175%
      (vi/set-font-size 13.0))
    ((equal disp '(1710 . 1107))         ;macbook air 15"
      (vi/set-font-size 15.0))
    ((equal disp '(1920 . 1080))    ; asus monitor
      (vi/set-font-size 12.0))
    (t (message "Unknown display size %sx%s" (car disp) (cdr disp)))))

(defun vi/trigger-dispwatch ()
  (interactive)
  (vi/adjust-font-size-for-display
    ;; extract dotted pair from display info
    (apply #'cons (-take-last 2 (nth 1 dispwatch-current-display))))
  )
(add-hook! 'doom-first-buffer-hook #'vi/trigger-dispwatch)

(use-package! dispwatch
  :after-call doom-first-buffer-hook
  :config
  (dispwatch-mode 1)
  (add-hook! 'dispwatch-display-change-hooks #'vi/adjust-font-size-for-display)
  )
#+end_src

* Kill/Yank/Mark regions


#+begin_src emacs-lisp :tangle packages.el
;; (package! hungry-delete)
#+end_src

** COMMENT visible mark
sr.ht is down

#+begin_src emacs-lisp :tangle packages.el
(package! visible-mark)
#+end_src


#+begin_src emacs-lisp
(use-package! visible-mark
  :custom
  (visible-mark-max 1)
  :config
  (global-visible-mark-mode t)
  )
#+end_src
** expand region



#+begin_src emacs-lisp :tangle packages.el
(package! expand-region)
#+end_src

#+begin_src emacs-lisp
;; (use-package! hungry-delete
;;   :after-call doom-first-input-hook
;;   :config
;;   (global-hungry-delete-mode))

(use-package! expand-region
  :commands (er/mark-inside-pairs er/mark-inside-quotes er/mark-outside-pairs er/mark-outside-quotes)
  )
#+end_src

** easy-kill base

#+begin_src emacs-lisp
(use-package! easy-kill
  :custom

  ;; Used for first marking
  (easy-mark-try-things '(line symbol forward-line-edge sexp)) ;see easy-kill-alist
  (easy-kill-try-things '(line symbol forward-line-edge sexp)) ;see easy-kill-alist
  :bind (
          ([remap kill-ring-save] . easy-kill) ; M-w
          ;; easy-mark supposedly sets the region immediately but it breaks
          ;; sometimes. Also doesn't use easy-kill-selection face
          ([remap set-mark-command] . easy-mark) ;C-SPC

          ;; ("M-SPC" . easy-mark)
          )

  :config
  (custom-set-faces! '(easy-kill-selection :inherit modus-themes-mark-sel))

  ;; These take arguments
  (setq easy-kill-cycle-ignored '(string-to-char-forward string-up-to-char-forward))

  ;; easy-kill/mark will cycle through things in this order (except for easy-kill-cycle-ignored)
  (setq easy-kill-alist
    '(
       (?l line "\n")
       (?w word " ")
       (?s symbol " ")               ;added from extras
       ;; (?W WORD " ")
       (?< inside-pairs "");added from extras
       (?> outside-pairs "");added from extras
       (?\' inside-quotes "");added from extras
       (?\" outside-quotes "");added from extras
       (?$ forward-line-edge "")
       (?^ backward-line-edge "")
       (?d defun "\n\n")
       (?b buffer "")
       (?x sexp "\n")
       (?L list "\n")
       (?f string-to-char-forward "")
       (?F string-up-to-char-forward "")
       (?D defun-name " ")
       (?B buffer-file-name)))
  )

#+end_src


#+begin_src emacs-lisp :tangle packages.el
(package! easy-kill :recipe (:host github :repo "leoliu/easy-kill"))
#+end_src

** easy-kill-extras


#+begin_src emacs-lisp :tangle packages.el
(package! easy-kill-extras)
(package! multiple-cursors)
#+end_src

#+begin_src emacs-lisp
;; Here we integrate some  expand-region marking as easy-kill candidates
(after! easy-kill
  (use-package! easy-kill-extras
    :demand t                           ; don't wait for autoload via :bind
    :init
    (setq easy-kill-ace-jump-enable-p nil)
    :config
    (require 'extra-things)
    ;; (require 'easy-kill-mc)
    ;; Integrate `expand-region' functionality with easy-kill
    :bind (:map easy-kill-base-map
            ("o" . easy-kill-er-expand)
            ("i" . easy-kill-er-unexpand))

    ;; (define-key easy-kill-base-map (kbd "o") 'easy-kill-er-expand)
    ;; (define-key easy-kill-base-map (kbd "i") 'easy-kill-er-unexpand)
    )

  (defsubst vi/did-mark (mark-fn)
    ;; Did mark-fn succeed in setting the mark?
    ;; Remove any existing mark
    (deactivate-mark)
    ;; Catch scan-error and deactivate-mark if we do
    (save-excursion
      (condition-case nil
          (progn (funcall mark-fn) (region-active-p))
        (scan-error (deactivate-mark)))))

  (defmacro vi/er-easy-kill (thing)
    ;; create a function easy-kill-on-<thing> which tests er/mark-<thing> to see
    ;; if it set the region, and if so, adjusts the easy kill candidate.
    `(defun ,(intern (concat "easy-kill-on-" thing)) (_n)
         (when (vi/did-mark #',(intern (concat "er/mark-" thing)))
           (easy-kill-adjust-candidate ',(intern thing) (mark) (point))
           )
    ))

  (vi/er-easy-kill "symbol")
  (vi/er-easy-kill "inside-pairs")
  (vi/er-easy-kill "outside-pairs")
  (vi/er-easy-kill "inside-quotes")
  (vi/er-easy-kill "outside-quotes")

  )
#+end_src

** no yanking whitespace

*** COMMENT stackoverflow solution
https://stackoverflow.com/a/69307156/14044156
#+begin_src emacs-lisp
(defun night/h-kill-skip-whitespace (orig-fn string &optional rest)
  (message string)
  (message rest)
  (let* (
         (string-raw (substring-no-properties string))
         (space-p (not (string-match-p "[^ \t\n\r]" string-raw))))
    (cond
     ((not space-p)
      (apply orig-fn string rest))
     (t
      (message "skipped whitespace kill")
     ))))


(advice-add 'kill-new :around #'night/h-kill-skip-whitespace)
#+end_src

*** clean-kill-ring
https://github.com/NicholasBHubbard/clean-kill-ring.el

#+begin_src emacs-lisp :tangle packages.el
(package! clean-kill-ring :recipe (:host github :repo "NicholasBHubbard/clean-kill-ring.el"))
#+end_src

#+begin_src emacs-lisp
(use-package! clean-kill-ring
  :after-call doom-first-input-hook
  :config
  (clean-kill-ring-mode)
  )
#+end_src
