.config/doom/config.el

;; [[file:config.org::*Adjust for display size change][Adjust for display size change:2]]
(defun vi/set-font-size (sz)
  (font-put doom-font :size sz)
  ;; (setq! doom-font (font-spec :size sz))
  (doom/reload-font)
  (message "Setting font size to: %s" sz)
  sz
  )

;; see (dispwatch--get-display)
;; Can be run manually like (vi/adjust-font-size-for-display '(3440 . 1440))
;; See https://github.com/doomemacs/doomemacs/issues/6131#issuecomment-1051576882
(defun vi/adjust-font-size-for-display (disp)
  (message "rejiggering for %s" disp)
  (cond ((equal disp '(3440 . 1440))   ; LG monitor
          (vi/set-font-size 16.0))
    ((equal disp '(3000 . 2000))    ; laptop @ 100%, 200%
      (vi/set-font-size 13.0))
    ((equal disp '(4800 . 3200))    ; laptop @ 125%
      (vi/set-font-size 14.0))
    ((equal disp '(4002 . 2668))    ; laptop @ 150%
      (vi/set-font-size 14.0))
    ((equal disp '(3426 . 2284))    ; laptop @ 175%
      (vi/set-font-size 13.0))
    ((equal disp '(1710 . 1107))         ;macbook air 15"
      (vi/set-font-size 15.0))
    ((equal disp '(1920 . 1080))    ; asus monitor
      (vi/set-font-size 12.0))
    (t (message "Unknown display size %sx%s" (car disp) (cdr disp)))))

(defun vi/trigger-dispwatch ()
  (interactive)
  (vi/adjust-font-size-for-display
    ;; extract dotted pair from display info
    (apply #'cons (-take-last 2 (nth 1 dispwatch-current-display))))
  )
(add-hook! 'doom-first-buffer-hook #'vi/trigger-dispwatch)

(use-package! dispwatch
  :after-call doom-first-buffer-hook
  :config
  (dispwatch-mode 1)
  (add-hook! 'dispwatch-display-change-hooks #'vi/adjust-font-size-for-display)
  )
;; Adjust for display size change:2 ends here

;; [[file:config.org::*expand region][expand region:2]]
;; (use-package! hungry-delete
;;   :after-call doom-first-input-hook
;;   :config
;;   (global-hungry-delete-mode))

(use-package! expand-region
  :commands (er/mark-inside-pairs er/mark-inside-quotes er/mark-outside-pairs er/mark-outside-quotes)
  )
;; expand region:2 ends here

;; easy-kill base


;; [[file:config.org::*easy-kill base][easy-kill base:1]]
(use-package! easy-kill
  :custom

  ;; Used for first marking
  (easy-mark-try-things '(line symbol forward-line-edge sexp)) ;see easy-kill-alist
  (easy-kill-try-things '(line symbol forward-line-edge sexp)) ;see easy-kill-alist
  :bind (
          ([remap kill-ring-save] . easy-kill) ; M-w
          ;; easy-mark supposedly sets the region immediately but it breaks
          ;; sometimes. Also doesn't use easy-kill-selection face
          ([remap set-mark-command] . easy-mark) ;C-SPC

          ;; ("M-SPC" . easy-mark)
          )

  :config
  (custom-set-faces! '(easy-kill-selection :inherit modus-themes-mark-sel))

  ;; These take arguments
  (setq easy-kill-cycle-ignored '(string-to-char-forward string-up-to-char-forward))

  ;; easy-kill/mark will cycle through things in this order (except for easy-kill-cycle-ignored)
  (setq easy-kill-alist
    '(
       (?l line "\n")
       (?w word " ")
       (?s symbol " ")               ;added from extras
       ;; (?W WORD " ")
       (?< inside-pairs "");added from extras
       (?> outside-pairs "");added from extras
       (?\' inside-quotes "");added from extras
       (?\" outside-quotes "");added from extras
       (?$ forward-line-edge "")
       (?^ backward-line-edge "")
       (?d defun "\n\n")
       (?b buffer "")
       (?x sexp "\n")
       (?L list "\n")
       (?f string-to-char-forward "")
       (?F string-up-to-char-forward "")
       (?D defun-name " ")
       (?B buffer-file-name)))
  )
;; easy-kill base:1 ends here

;; [[file:config.org::*easy-kill-extras][easy-kill-extras:2]]
;; Here we integrate some  expand-region marking as easy-kill candidates
(after! easy-kill
  (use-package! easy-kill-extras
    :demand t                           ; don't wait for autoload via :bind
    :init
    (setq easy-kill-ace-jump-enable-p nil)
    :config
    (require 'extra-things)
    ;; (require 'easy-kill-mc)
    ;; Integrate `expand-region' functionality with easy-kill
    :bind (:map easy-kill-base-map
            ("o" . easy-kill-er-expand)
            ("i" . easy-kill-er-unexpand))

    ;; (define-key easy-kill-base-map (kbd "o") 'easy-kill-er-expand)
    ;; (define-key easy-kill-base-map (kbd "i") 'easy-kill-er-unexpand)
    )

  (defsubst vi/did-mark (mark-fn)
    ;; Did mark-fn succeed in setting the mark?
    ;; Remove any existing mark
    (deactivate-mark)
    ;; Catch scan-error and deactivate-mark if we do
    (save-excursion
      (condition-case nil
          (progn (funcall mark-fn) (region-active-p))
        (scan-error (deactivate-mark)))))

  (defmacro vi/er-easy-kill (thing)
    ;; create a function easy-kill-on-<thing> which tests er/mark-<thing> to see
    ;; if it set the region, and if so, adjusts the easy kill candidate.
    `(defun ,(intern (concat "easy-kill-on-" thing)) (_n)
         (when (vi/did-mark #',(intern (concat "er/mark-" thing)))
           (easy-kill-adjust-candidate ',(intern thing) (mark) (point))
           )
    ))

  (vi/er-easy-kill "symbol")
  (vi/er-easy-kill "inside-pairs")
  (vi/er-easy-kill "outside-pairs")
  (vi/er-easy-kill "inside-quotes")
  (vi/er-easy-kill "outside-quotes")

  )
;; easy-kill-extras:2 ends here

;; [[file:config.org::*clean-kill-ring][clean-kill-ring:2]]
(use-package! clean-kill-ring
  :after-call doom-first-input-hook
  :config
  (clean-kill-ring-mode)
  )
;; clean-kill-ring:2 ends here
