.config/doom/packages.el

;; Adjust for display size change


;; [[file:config.org::*Adjust for display size change][Adjust for display size change:1]]
(package! dispwatch :recipe (:host github :repo "mnp/dispwatch"))
;; Adjust for display size change:1 ends here

;; Kill/Yank/Mark regions



;; [[file:config.org::*Kill/Yank/Mark regions][Kill/Yank/Mark regions:1]]
;; (package! hungry-delete)
;; Kill/Yank/Mark regions:1 ends here

;; expand region




;; [[file:config.org::*expand region][expand region:1]]
(package! expand-region)
;; expand region:1 ends here

;; [[file:config.org::*easy-kill base][easy-kill base:2]]
(package! easy-kill :recipe (:host github :repo "leoliu/easy-kill"))
;; easy-kill base:2 ends here

;; easy-kill-extras



;; [[file:config.org::*easy-kill-extras][easy-kill-extras:1]]
(package! easy-kill-extras)
(package! multiple-cursors)
;; easy-kill-extras:1 ends here

;; clean-kill-ring
;; https://github.com/NicholasBHubbard/clean-kill-ring.el


;; [[file:config.org::*clean-kill-ring][clean-kill-ring:1]]
(package! clean-kill-ring :recipe (:host github :repo "NicholasBHubbard/clean-kill-ring.el"))
;; clean-kill-ring:1 ends here

;; move-text
