.config/doom/config.org
** move-text


#+begin_src emacs-lisp :tangle packages.el
(package! move-text)
#+end_src


#+begin_src emacs-lisp
(use-package! move-text
  :config
  (move-text-default-bindings)          ;M-<up>, M-<down>

  (remove-hook 'org-metadown-hook #'org-babel-pop-to-session-maybe)
  (remove-hook 'org-metaup-hook #'org-babel-load-in-session-maybe)

  ;; messes with moving headings
  ;; (add-hook! 'org-metadown-hook (progn (apply #'move-text-down (move-text-get-region-and-prefix)) t))
  ;; (add-hook! 'org-metaup-hook (progn (apply #'move-text-up (move-text-get-region-and-prefix)) t))
  )
#+end_src

* undo

** doom undo-fu
#+begin_src emacs-lisp
(setq! undo-limit 67108864) ; 64mb.
(setq! undo-strong-limit 100663296) ; 96mb.
(setq! undo-outer-limit 1006632960) ; 960mb.

(after! undo-fu
  (setq! undo-fu-allow-undo-in-region t)
  (map! "C--" #'undo "M--" #'redo "C-/" #'undo)
  (map! :map undo-fu-mode-map "C-/" nil)
  (map! :map undo-fu-mode-map "C-x u" nil)
  ;; (vhl/ext/undo-fu/on)
  )
#+end_src

** vundo
#+begin_src emacs-lisp
(use-package! vundo
  :custom
  (vundo-roll-back-on-quit nil)
  (vundo-glyph-alist vundo-unicode-symbols)
  ;; (vundo-glyph-alist vundo-ascii-symbols)
  :config
  ;; different fonts at different sizes mess up the alignment in vundo
  ;; Iosevka 13 seems to be ok
  ;; (set-face-attribute 'vundo-default nil :family "DejaVu Sans Mono")

  ;; https://github.com/casouri/vundo/issues/56
  (defun vi/vundo-diff ()
    (interactive)
    (let* ((orig vundo--orig-buffer)
            (source (vundo--current-node vundo--prev-mod-list))
            (dest (vundo-m-parent source)))
      (if (or (not dest) (eq source dest))
        (message "vundo diff not available.")
	(let ((buf (make-temp-name (concat (buffer-name orig) "-vundo-diff"))))
          (vundo--move-to-node source dest orig vundo--prev-mod-list)
          (with-current-buffer (get-buffer-create buf)
	    (insert-buffer orig))
          (vundo--refresh-buffer orig (current-buffer) 'incremental)
          (vundo--move-to-node dest source orig vundo--prev-mod-list)
          (vundo--refresh-buffer orig (current-buffer) 'incremental)
          (diff-buffers buf orig)
          (kill-buffer buf)))))

  :bind (
          ("C-x u" . vundo)
          :map vundo-mode-map (("d" . #'vi/vundo-diff))
          )
  )

(add-hook! 'vundo-mode-hook
  #'hide-mode-line-mode
  (visual-line-mode -1)
  (setq window-size-fixed t)
  ;; (buffer-face-set '(:family "DejaVu Sans Mono"))
  )
#+end_src

#+begin_src emacs-lisp :tangle packages.el
(package! vundo)
#+end_src
** Go to Last change

#+begin_src emacs-lisp :tangle packages.el
(package! goto-chg :recipe (:host github :repo "emacs-evil/goto-chg"))
#+end_src


#+begin_src emacs-lisp
(use-package! goto-chg
  :bind (
          ("C-." . goto-last-change)
          ("C-," . goto-last-change-reverse)
          :map org-mode-map ("C-," . nil)
  ))
;; (after! org
;;   ;; goto-last-change-reverse
;;   (map! :map org-mode-map "C-," nil)
;;   )
#+end_src
** point


#+begin_src emacs-lisp :tangle packages.el
(package! point-undo :recipe (:host github :repo "emacsmirror/point-undo"))
#+end_src

#+begin_src emacs-lisp
(use-package! point-undo
  :bind(
         ("s-." . point-undo)
         ("s-," . point-redo)
         ))
#+end_src

** COMMENT Undo-fu local

ein disables undo if C-/ is bound to anything but basic undo
https://github.com/millejoh/emacs-ipython-notebook/issues/841#issuecomment-1129176534

doom-emacs defines a global undo-fu-mode (minor-mode) which is activated on
doom-first-buffer. This means that it is turned on in the ein notebook buffers,
but it's not enough to turn it off via ein:notebook-mode-hook -- that's too
late, ein has already disabled undo.

so we define a non-global vi/undo-fu-mode and turn it on selectively.

#+begin_src emacs-lisp
(map! "C--" #'undo "M--" #'redo "C-/" #'undo)
(map! :map undo-fu-mode-map "C-/" nil)

;; copied from doom's undo/config.el
(use-package! undo-fu
  :custom
  (setq! undo-limit 80000000)
  :unless (featurep! +tree)
  :config
  (define-minor-mode vi/undo-fu-mode
    "Enables `undo-fu' for the current session."
    :keymap (let ((map (make-sparse-keymap)))
              ;; (define-key map [remap undo] #'undo-fu-only-undo)
              ;; (define-key map [remap redo] #'undo-fu-only-redo)
              ;; (define-key map (kbd "C-_")     #'undo-fu-only-undo)
              ;; (define-key map (kbd "M-_")     #'undo-fu-only-redo)
              ;; (define-key map (kbd "C-M-_")   #'undo-fu-only-redo-all)
              (define-key map (kbd "C-x r u") #'undo-fu-session-save)
              (define-key map (kbd "C-x r U") #'undo-fu-session-recover)

              ;; Diff from undo-fu-mode
              (define-key map (kbd "C--")     #'undo-fu-only-undo)
              (define-key map (kbd "M--")     #'undo-fu-only-redo)
              (define-key map (kbd "C-M--")   #'undo-fu-only-redo-all)

              map)
    :predicate t
    :init-value nil
    :global nil)                       ;;only difference from doom-emacs' undo-fu-mode is that this isn't global
  )

;; We don't want this because it turns on in ein and ein disables undo if it is
;; bound to anything but the simple emacs undo, it is global
(remove-hook! 'doom-first-buffer-hook #'undo-fu-mode)
(add-hook! (prog-mode org-mode text-mode) #'vi/undo-fu-mode)
(add-hook! vi/undo-fu-mode #'global-undo-fu-session-mode)
#+end_src


** COMMENT undo-hl
seems to make things slow?

#+begin_src emacs-lisp :tangle packages.el
(package! undo-hl :recipe (:host github :repo "casouri/undo-hl"))
#+end_src


#+begin_src emacs-lisp
(use-package! undo-hl
  :after-call doom-first-buffer-hook
  :hook (prog-mode . undo-hl-mode)
  )
#+end_src

* Snippets

#+begin_src emacs-lisp :tangle packages.el
(package! yankpad :recipe (:host github :repo "Kungsgeten/yankpad"))
(package! yasnippet)
#+end_src

#+begin_src emacs-lisp
(after! yasnippet
  (setq yas-wrap-around-region t)
  (yas-global-mode 1))

(use-package! yankpad
  :commands (yankpad-insert);;  company-yankpad)
  :custom
  (yankpad-file "~/.config/doom/yankpad.org")
  :config
  (add-to-list 'hippie-expand-try-functions-list #'yankpad-expand)
  )
#+end_src

* Fill

** unfill paragraphs
#+begin_src emacs-lisp :tangle packages.el
(package! unfill)
#+end_src

#+begin_src emacs-lisp
(use-package! unfill
  :bind ("M-a" . unfill-paragraph))
#+end_src

** COMMENT Fill function arguments

We don't use this in practice...

#+begin_src emacs-lisp :tangle packages.el
(package! fill-function-arguments)
#+end_src

#+begin_src emacs-lisp
(use-package! fill-function-arguments
  :after-call doom-first-input-hook
  ;; :hook
  ;; (prog-mode . (lambda () (local-set-key (kbd "M-q") #'fill-function-arguments-dwim)))
  ;; (emacs-lisp-mode . (lambda ()
  ;;                      (setq-local fill-function-arguments-first-argument-same-line t)
  ;;                      (setq-local fill-function-arguments-second-argument-same-line t)
  ;;                      (setq-local fill-function-arguments-last-argument-same-line t)
  ;;                      (setq-local fill-function-arguments-argument-separator " ")))
  )
#+end_src

* Comments

** Boxing
#+begin_src emacs-lisp :tangle packages.el
(package! rebox2)
#+end_src

#+begin_src emacs-lisp
(use-package! rebox2
  :commands (rebox-dwim)
  :config
  (setq rebox-style-loop '(13 15 23 25 16 17 26 27 11 21))
  :bind
  (
   ;; ("M-:" . rebox-dwim)
   :map rebox-mode-map ("M-q" . nil)
   )
  ;; (define-key rebox-mode-map (kbd "M-q") nil)
  )
#+end_src

** Editing comments

*** COMMENT poporg
#+begin_src emacs-lisp
(package! poporg)

(defun python-mode-poporg-hook ()
  (setq-local poporg-edit-hook '(sql-mode))
  )

(use-package! poporg
  :custom
  ;; don't match * in common prefix - this will break C-style comments
  ;; poporg but it is necessary to retain org headings
  (poporg-comment-skip-regexp "[[:space:]]*")
  :hook (python-mode . python-mode-poporg-hook)
  :bind ("M-\\" . poporg-dwim)
  )
#+end_src

*** separedit

#+begin_src emacs-lisp :tangle packages.el
(package! separedit)
#+end_src


#+begin_src emacs-lisp
(use-package! separedit
  :custom
  (separedit-remove-trailing-spaces-in-comment t)
  (separedit-default-mode 'org-mode)
  :bind ("M-\\" . separedit)
  )

(after! edit-indirect
  ;; https://github.com/Fanael/edit-indirect/issues/6
  (require 's)
  (require 'dash)

  (defvar edit-indirect--left-margin 0)

  (defun vbe:compute-left-margin (code)
    "Compute left margin of a string of code."
    (-min
      (-map #'(lambda (line) (length (car (s-match "^\\s-*" line))))
        (-remove 's-blank? (s-lines code)))))

  (defun vbe:after-indirect-edit-remove-left-margin ()
    "Remove left-margin and save it into a local variable."
    (let ((lm (vbe:compute-left-margin (buffer-substring (point-min) (point-max)))))
      (indent-rigidly (point-min) (point-max) (* -1 lm))
      (setq-local edit-indirect--left-margin lm)))

  (defun vbe:after-indirect-edit-restore-left-margin ()
    "Restore left-margin before commiting."
    (indent-rigidly (point-min) (point-max) edit-indirect--left-margin))

  (add-hook 'edit-indirect-after-creation-hook #'vbe:after-indirect-edit-remove-left-margin)
  (add-hook 'edit-indirect-before-commit-hook #'vbe:after-indirect-edit-restore-left-margin))


#+end_src

* Indentation

** Guides

