.config/doom/config.el

;; [[file:config.org::*move-text][move-text:2]]
(use-package! move-text
  :config
  (move-text-default-bindings)          ;M-<up>, M-<down>

  (remove-hook 'org-metadown-hook #'org-babel-pop-to-session-maybe)
  (remove-hook 'org-metaup-hook #'org-babel-load-in-session-maybe)

  ;; messes with moving headings
  ;; (add-hook! 'org-metadown-hook (progn (apply #'move-text-down (move-text-get-region-and-prefix)) t))
  ;; (add-hook! 'org-metaup-hook (progn (apply #'move-text-up (move-text-get-region-and-prefix)) t))
  )
;; move-text:2 ends here

;; doom undo-fu

;; [[file:config.org::*doom undo-fu][doom undo-fu:1]]
(setq! undo-limit 67108864) ; 64mb.
(setq! undo-strong-limit 100663296) ; 96mb.
(setq! undo-outer-limit 1006632960) ; 960mb.

(after! undo-fu
  (setq! undo-fu-allow-undo-in-region t)
  (map! "C--" #'undo "M--" #'redo "C-/" #'undo)
  (map! :map undo-fu-mode-map "C-/" nil)
  (map! :map undo-fu-mode-map "C-x u" nil)
  ;; (vhl/ext/undo-fu/on)
  )
;; doom undo-fu:1 ends here

;; vundo

;; [[file:config.org::*vundo][vundo:1]]
(use-package! vundo
  :custom
  (vundo-roll-back-on-quit nil)
  (vundo-glyph-alist vundo-unicode-symbols)
  ;; (vundo-glyph-alist vundo-ascii-symbols)
  :config
  ;; different fonts at different sizes mess up the alignment in vundo
  ;; Iosevka 13 seems to be ok
  ;; (set-face-attribute 'vundo-default nil :family "DejaVu Sans Mono")

  ;; https://github.com/casouri/vundo/issues/56
  (defun vi/vundo-diff ()
    (interactive)
    (let* ((orig vundo--orig-buffer)
            (source (vundo--current-node vundo--prev-mod-list))
            (dest (vundo-m-parent source)))
      (if (or (not dest) (eq source dest))
        (message "vundo diff not available.")
	(let ((buf (make-temp-name (concat (buffer-name orig) "-vundo-diff"))))
          (vundo--move-to-node source dest orig vundo--prev-mod-list)
          (with-current-buffer (get-buffer-create buf)
	    (insert-buffer orig))
          (vundo--refresh-buffer orig (current-buffer) 'incremental)
          (vundo--move-to-node dest source orig vundo--prev-mod-list)
          (vundo--refresh-buffer orig (current-buffer) 'incremental)
          (diff-buffers buf orig)
          (kill-buffer buf)))))

  :bind (
          ("C-x u" . vundo)
          :map vundo-mode-map (("d" . #'vi/vundo-diff))
          )
  )

(add-hook! 'vundo-mode-hook
  #'hide-mode-line-mode
  (visual-line-mode -1)
  (setq window-size-fixed t)
  ;; (buffer-face-set '(:family "DejaVu Sans Mono"))
  )
;; vundo:1 ends here

;; [[file:config.org::*Go to Last change][Go to Last change:2]]
(use-package! goto-chg
  :bind (
          ("C-." . goto-last-change)
          ("C-," . goto-last-change-reverse)
          :map org-mode-map ("C-," . nil)
  ))
;; (after! org
;;   ;; goto-last-change-reverse
;;   (map! :map org-mode-map "C-," nil)
;;   )
;; Go to Last change:2 ends here

;; [[file:config.org::*point][point:2]]
(use-package! point-undo
  :bind(
         ("s-." . point-undo)
         ("s-," . point-redo)
         ))
;; point:2 ends here

;; [[file:config.org::*Snippets][Snippets:2]]
(after! yasnippet
  (setq yas-wrap-around-region t)
  (yas-global-mode 1))

(use-package! yankpad
  :commands (yankpad-insert);;  company-yankpad)
  :custom
  (yankpad-file "~/.config/doom/yankpad.org")
  :config
  (add-to-list 'hippie-expand-try-functions-list #'yankpad-expand)
  )
;; Snippets:2 ends here

;; [[file:config.org::*unfill paragraphs][unfill paragraphs:2]]
(use-package! unfill
  :bind ("M-a" . unfill-paragraph))
;; unfill paragraphs:2 ends here

;; [[file:config.org::*Boxing][Boxing:2]]
(use-package! rebox2
  :commands (rebox-dwim)
  :config
  (setq rebox-style-loop '(13 15 23 25 16 17 26 27 11 21))
  :bind
  (
   ;; ("M-:" . rebox-dwim)
   :map rebox-mode-map ("M-q" . nil)
   )
  ;; (define-key rebox-mode-map (kbd "M-q") nil)
  )
;; Boxing:2 ends here

;; [[file:config.org::*separedit][separedit:2]]
(use-package! separedit
  :custom
  (separedit-remove-trailing-spaces-in-comment t)
  (separedit-default-mode 'org-mode)
  :bind ("M-\\" . separedit)
  )

(after! edit-indirect
  ;; https://github.com/Fanael/edit-indirect/issues/6
  (require 's)
  (require 'dash)

  (defvar edit-indirect--left-margin 0)

  (defun vbe:compute-left-margin (code)
    "Compute left margin of a string of code."
    (-min
      (-map #'(lambda (line) (length (car (s-match "^\\s-*" line))))
        (-remove 's-blank? (s-lines code)))))

  (defun vbe:after-indirect-edit-remove-left-margin ()
    "Remove left-margin and save it into a local variable."
    (let ((lm (vbe:compute-left-margin (buffer-substring (point-min) (point-max)))))
      (indent-rigidly (point-min) (point-max) (* -1 lm))
      (setq-local edit-indirect--left-margin lm)))

  (defun vbe:after-indirect-edit-restore-left-margin ()
    "Restore left-margin before commiting."
    (indent-rigidly (point-min) (point-max) edit-indirect--left-margin))

  (add-hook 'edit-indirect-after-creation-hook #'vbe:after-indirect-edit-remove-left-margin)
  (add-hook 'edit-indirect-before-commit-hook #'vbe:after-indirect-edit-restore-left-margin))
;; separedit:2 ends here
