.config/doom/packages.el



;; [[file:config.org::*move-text][move-text:1]]
(package! move-text)
;; move-text:1 ends here

;; [[file:config.org::*vundo][vundo:2]]
(package! vundo)
;; vundo:2 ends here

;; Go to Last change


;; [[file:config.org::*Go to Last change][Go to Last change:1]]
(package! goto-chg :recipe (:host github :repo "emacs-evil/goto-chg"))
;; Go to Last change:1 ends here

;; point



;; [[file:config.org::*point][point:1]]
(package! point-undo :recipe (:host github :repo "emacsmirror/point-undo"))
;; point:1 ends here

;; Snippets


;; [[file:config.org::*Snippets][Snippets:1]]
(package! yankpad :recipe (:host github :repo "Kungsgeten/yankpad"))
(package! yasnippet)
;; Snippets:1 ends here

;; unfill paragraphs

;; [[file:config.org::*unfill paragraphs][unfill paragraphs:1]]
(package! unfill)
;; unfill paragraphs:1 ends here

;; Boxing

;; [[file:config.org::*Boxing][Boxing:1]]
(package! rebox2)
;; Boxing:1 ends here

;; separedit


;; [[file:config.org::*separedit][separedit:1]]
(package! separedit)
;; separedit:1 ends here

;; indent bars
