.config/doom/config.org
*** COMMENT Highlight indent guides
Doom emacs's version :ui indent-guides sets up hooks for org-mode which interact badly with org-indent-modern

#+begin_src emacs-lisp :tangle packages.el
(package! highlight-indent-guides)
#+end_src

#+begin_src emacs-lisp
(use-package! highlight-indent-guides
  :after-call doom-first-buffer-hook
  :custom
  (highlight-indent-guides-auto-enabled nil)
  (highlight-indent-guides-delay 1)
  (highlight-indent-guides-method 'character)
  :config
  :hook (prog-mode . highlight-indent-guides-mode)
  )

(add-hook! highlight-indent-guides-mode
  (custom-set-faces!
    '(highlight-indent-guides-character-face :foreground "#2b3045") ;bg-inactive
    ))

#+end_src

*** indent bars

#+begin_src emacs-lisp :tangle packages.el
(package! indent-bars :recipe (:host github :repo "jdtsmith/indent-bars"))
#+end_src


#+begin_src emacs-lisp
;; (remove-hook! 'text-mode-hook #'highlight-indent-guides-mode)
;; (remove-hook! 'prog-mode-hook #'highlight-indent-guides-mode)
(use-package! indent-bars
  :custom
  ;; stipples not supported on mac os build
  (indent-bars-prefer-character t)
  :hook ((prog-mode text-mode conf-mode) . indent-bars-mode))
#+end_src

** Shift regions

#+begin_src emacs-lisp
;; Shift the selected region right if distance is postive, left if
;; negative

(defun vi/shift-region (distance)
  (let ((mark (mark)))
    (save-excursion
      (indent-rigidly (region-beginning) (region-end) distance)
      (push-mark mark t t)
      ;; Tell the command loop not to deactivate the mark
      ;; for transient mark mode
      (setq deactivate-mark nil))))

(defun vi/shift-right ()
  (interactive)
  (vi/shift-region 1))

(defun vi/shift-left ()
  (interactive)
  (vi/shift-region -1))

(map! :g "M->" #'vi/shift-right)
(map! :g "M-<" #'vi/shift-left)
#+end_src

* Movement


#+begin_src emacs-lisp :tangle packages.el
(package! mwim)
#+end_src


#+begin_src emacs-lisp
(use-package! mwim
  :bind
  ("C-a" . mwim-beginning)
  ("C-e" . mwim-end)
  )
#+end_src

* Search/Filtering

** isearch
#+begin_src emacs-lisp
(after! isearch
  ;; Show match/total in isearch prompt
  (setq isearch-lazy-count t
        isearch-lazy-highlight t))
#+end_src

** smartscan
#+begin_src emacs-lisp :tangle packages.el
(package! smartscan)
#+end_src


#+begin_src emacs-lisp
(use-package! smartscan
  :after-call doom-first-buffer-hook
  :config
  (global-smartscan-mode 1)

  ;; M-p, M-n interfere in git-rebase mode
  (add-hook! git-rebase-mode (smartscan-mode -1))
  )
#+end_src
** regex-based searching, using python/pcre

#+begin_src emacs-lisp :tangle packages.el
(package! visual-regexp)
(package! visual-regexp-steroids)
#+end_src

** Jumping


#+begin_src emacs-lisp :tangle packages.el
(package! smart-jump)
(package! rg)                           ;For smart-jump-find-references-with-rg
#+end_src


#+begin_src emacs-lisp
;; better-jumper is built into doom
(use-package! smart-jump
  :after-call prog-mode-hook            ; don't defer till bind?
  :custom
  (smart-jump-find-references-fallback-function #'smart-jump-find-references-with-rg)
  (smart-jump-bind-keys nil)
  :config

  ;; this sets up hooks with the :modes, so it won't work without revert-buffer
  ;; since we use :bind to load this package (see :after-call above)
  ;; (smart-jump-register :modes 'prog-mode
  ;;                      :jump-fn #'+lookup/definition
  ;;                      :pop-fn 'xref-pop-marker-stack
  ;;                      :refs-fn #'+lookup/references
  ;;                      :heuristic 'error
  ;;                      :refs-heuristic 'error
  ;;                      :should-jump t
  ;;                      :before-jump-fn #'better-jumper-set-jump
  ;;                      :order 2
  ;;                      :async t)

  (smart-jump-register :modes 'lsp-mode
                       :jump-fn 'lsp-find-definition
                       :pop-fn 'xref-pop-marker-stack
                       :refs-fn 'lsp-find-references
                       :heuristic 'point
                       :refs-heuristic 'point
                       :before-jump-fn #'better-jumper-set-jump
                       :should-jump t
                       :order 1
                       :async t)

  (smart-jump-setup-default-registers)
  :bind (("M-." . smart-jump-go)
          ;; seems to work with smart-jump without calling better-jumper-set-jump?
          ;; also advicing smart-jump with better-jumper-set-jump seems to break
          ("M-," . better-jumper-jump-backward)
          ("M-?" . smart-jump-references)
          )
  :commands (smart-jump-go smart-jump-back smart-jump-references)
  )

(after! dumb-jump
  (setq xref-backend-functions (remq 'etags--xref-backend xref-backend-functions))
  (add-to-list 'xref-backend-functions #'dumb-jump-xref-activate t))

(setq xref-show-xrefs-function #'consult-xref)
(setq xref-show-definitions-function #'consult-xref)

#+end_src

** tags
:PROPERTIES:
:CREATED:  [2023-11-17 Fri 17:09]
:END:


#+begin_src emacs-lisp :tangle packages.el
(package! citre)
#+end_src


#+begin_src emacs-lisp
;; https://git.sr.ht/~northyear/dotemacs/tree/e9b75ccce4e840525c4ec664777694e21c69bc6e/item/site-lisp/consult-citre.el
;; stored in .config/doom/lisp
(load! "lisp/consult-citre.el")
#+end_src

** embark


#+begin_src emacs-lisp
(after! embark
  ;; since we disabled which-key
  (advice-remove 'embark-completing-read-prompter '+vertico--embark-which-key-prompt-a)
  ;; try out embark-mixed-indicator which is more verbose than embark-which-key-indicator
  (setq! embark-indicators '(embark--vertico-indicator embark-minimal-indicator embark-highlight-indicator embark-isearch-highlight-indicator))
  )
#+end_src

*** targets for buffer/file

https://github.com/oantolin/embark/issues/231#issuecomment-854390476

#+begin_src emacs-lisp
(after! embark
  (defun embark-target-this-buffer-file ()
    (cons 'this-buffer-file (or (buffer-file-name) (buffer-name))))

  (add-to-list 'embark-target-finders #'embark-target-this-buffer-file 'append)

  (add-to-list 'embark-keymap-alist '(this-buffer-file . this-buffer-file-map))

  (defvar-keymap this-buffer-file-map
    :doc"Commands to act on current file or buffer."
    :parent embark-general-map
    "l" #'load-file
    "b" #'byte-compile-file
    ;; ("S" sudo-find-file)
    ;; ("U" 0x0-upload)
    ;; ("r" rename-file-and-buffer)
    ;; ("d" diff-buffer-with-file)
    "=" #'ediff-buffers
    "C-=" #'ediff-files
    "!" #'shell-command
    "&" #'async-shell-command
    "x" #'consult-file-externally
    ;; ("C-a" mml-attach-file)
    "c" #'copy-file
    "k" #'kill-buffer
    "z" #'bury-buffer
    "|" #'embark-shell-command-on-buffer
    "g" #'revert-buffer
    )
  )
#+end_src
** consult customization

# TODO: filter out dired-sidebar

#+begin_src emacs-lisp
(after! consult
  ;; (add-hook! 'consult-after-jump-hook #'recenter-top-bottom)
  (add-hook! 'consult-after-jump-hook #'recenter)
  (add-hook! 'consult-after-jump-hook #'pulse-momentary-highlight-one-line)

  (setq! consult-fontify-max-size 1024)   ;https://github.com/minad/consult/issues/329

  (defalias 'consult-line-thing-at-point 'consult-line)
  (consult-customize consult-line-thing-at-point :initial (thing-at-point 'symbol))

  (map! "C-s" #'consult-line "C-r" #'vertico-repeat)               ;deliberately not setting initial


  (setq consult-line-start-from-top nil)
  (setq consult-line-point-placement 'match-beginning)

  )
#+end_src

