.config/doom/config.el

;; [[file:config.org::*indent bars][indent bars:2]]
;; (remove-hook! 'text-mode-hook #'highlight-indent-guides-mode)
;; (remove-hook! 'prog-mode-hook #'highlight-indent-guides-mode)
(use-package! indent-bars
  :custom
  ;; stipples not supported on mac os build
  (indent-bars-prefer-character t)
  :hook ((prog-mode text-mode conf-mode) . indent-bars-mode))
;; indent bars:2 ends here

;; Shift regions


;; [[file:config.org::*Shift regions][Shift regions:1]]
;; Shift the selected region right if distance is postive, left if
;; negative

(defun vi/shift-region (distance)
  (let ((mark (mark)))
    (save-excursion
      (indent-rigidly (region-beginning) (region-end) distance)
      (push-mark mark t t)
      ;; Tell the command loop not to deactivate the mark
      ;; for transient mark mode
      (setq deactivate-mark nil))))

(defun vi/shift-right ()
  (interactive)
  (vi/shift-region 1))

(defun vi/shift-left ()
  (interactive)
  (vi/shift-region -1))

(map! :g "M->" #'vi/shift-right)
(map! :g "M-<" #'vi/shift-left)
;; Shift regions:1 ends here

;; [[file:config.org::*Movement][Movement:2]]
(use-package! mwim
  :bind
  ("C-a" . mwim-beginning)
  ("C-e" . mwim-end)
  )
;; Movement:2 ends here

;; isearch

;; [[file:config.org::*isearch][isearch:1]]
(after! isearch
  ;; Show match/total in isearch prompt
  (setq isearch-lazy-count t
        isearch-lazy-highlight t))
;; isearch:1 ends here

;; [[file:config.org::*smartscan][smartscan:2]]
(use-package! smartscan
  :after-call doom-first-buffer-hook
  :config
  (global-smartscan-mode 1)

  ;; M-p, M-n interfere in git-rebase mode
  (add-hook! git-rebase-mode (smartscan-mode -1))
  )
;; smartscan:2 ends here

;; [[file:config.org::*Jumping][Jumping:2]]
;; better-jumper is built into doom
(use-package! smart-jump
  :after-call prog-mode-hook            ; don't defer till bind?
  :custom
  (smart-jump-find-references-fallback-function #'smart-jump-find-references-with-rg)
  (smart-jump-bind-keys nil)
  :config

  ;; this sets up hooks with the :modes, so it won't work without revert-buffer
  ;; since we use :bind to load this package (see :after-call above)
  (smart-jump-register :modes 'prog-mode
                       :jump-fn #'+lookup/definition
                       :pop-fn 'xref-pop-marker-stack
                       :refs-fn #'+lookup/references
                       :heuristic 'error
                       :refs-heuristic 'error
                       :should-jump t
                       :order 2
                       :async t)

  (smart-jump-register :modes 'lsp-mode
                       :jump-fn 'lsp-find-definition
                       :pop-fn 'xref-pop-marker-stack
                       :refs-fn 'lsp-find-references
                       :heuristic 'point
                       :refs-heuristic 'point
                       :should-jump t
                       :order 1
                       :async t)

  (smart-jump-setup-default-registers)
  :bind (("M-." . smart-jump-go)
          ;; seems to work with smart-jump without calling better-jumper-set-jump?
          ;; also advicing smart-jump with better-jumper-set-jump seems to break
          ("M-," . better-jumper-jump-backward)
          ("M-?" . smart-jump-references))
  :commands (smart-jump-go smart-jump-back smart-jump-references)
  )

(after! dumb-jump
  (setq xref-backend-functions (remq 'etags--xref-backend xref-backend-functions))
  (add-to-list 'xref-backend-functions #'dumb-jump-xref-activate t))

(pretty-hydra-define jump-hydra (:exit t)
  ("Jump"
    (("c" +lookup/documentation "Docstring")
    ("f" +lookup/definition "Definition")
    ("u" +lookup/references "Usages")
    ("i" +lookup/implementations "Impls")
    ("t" +lookup/type-definition "Type")
    ("F" +lookup/file "file"))
   ))
;; Jumping:2 ends here

;; [[file:config.org::*tags][tags:2]]
;; https://git.sr.ht/~northyear/dotemacs/tree/e9b75ccce4e840525c4ec664777694e21c69bc6e/item/site-lisp/consult-citre.el
;; stored in .config/doom/lisp
(load! "lisp/consult-citre.el")
;; tags:2 ends here

;; embark



;; [[file:config.org::*embark][embark:1]]
(after! embark
  ;; since we disabled which-key
  (advice-remove 'embark-completing-read-prompter '+vertico--embark-which-key-prompt-a)
  ;; try out embark-mixed-indicator which is more verbose than embark-which-key-indicator
  (setq! embark-indicators '(embark--vertico-indicator embark-minimal-indicator embark-highlight-indicator embark-isearch-highlight-indicator))
  )
;; embark:1 ends here

;; targets for buffer/file

;; https://github.com/oantolin/embark/issues/231#issuecomment-854390476


;; [[file:config.org::*targets for buffer/file][targets for buffer/file:1]]
(after! embark
  (defun embark-target-this-buffer-file ()
    (cons 'this-buffer-file (or (buffer-file-name) (buffer-name))))

  (add-to-list 'embark-target-finders #'embark-target-this-buffer-file 'append)

  (add-to-list 'embark-keymap-alist '(this-buffer-file . this-buffer-file-map))

  (defvar-keymap this-buffer-file-map
    :doc"Commands to act on current file or buffer."
    :parent embark-general-map
    "l" #'load-file
    "b" #'byte-compile-file
    ;; ("S" sudo-find-file)
    ;; ("U" 0x0-upload)
    ;; ("r" rename-file-and-buffer)
    ;; ("d" diff-buffer-with-file)
    "=" #'ediff-buffers
    "C-=" #'ediff-files
    "!" #'shell-command
    "&" #'async-shell-command
    "x" #'consult-file-externally
    ;; ("C-a" mml-attach-file)
    "c" #'copy-file
    "k" #'kill-buffer
    "z" #'bury-buffer
    "|" #'embark-shell-command-on-buffer
    "g" #'revert-buffer
    )
  )
;; targets for buffer/file:1 ends here

;; consult customization

;; # TODO: filter out dired-sidebar


;; [[file:config.org::*consult customization][consult customization:1]]
(after! consult
  ;; (add-hook! 'consult-after-jump-hook #'recenter-top-bottom)
  (add-hook! 'consult-after-jump-hook #'recenter)
  (add-hook! 'consult-after-jump-hook #'pulse-momentary-highlight-one-line)

  (setq! consult-fontify-max-size 1024)   ;https://github.com/minad/consult/issues/329

  (defalias 'consult-line-thing-at-point 'consult-line)
  (consult-customize consult-line-thing-at-point :initial (thing-at-point 'symbol))

  (map! "C-s" #'consult-line "C-r" #'vertico-repeat)               ;deliberately not setting initial


  (setq consult-line-start-from-top nil)
  (setq consult-line-point-placement 'match-beginning)

  )
;; consult customization:1 ends here

;; consult-dir
