.config/doom/packages.el


;; [[file:config.org::*indent bars][indent bars:1]]
(package! indent-bars :recipe (:host github :repo "jdtsmith/indent-bars"))
;; indent bars:1 ends here

;; Movement



;; [[file:config.org::*Movement][Movement:1]]
(package! mwim)
;; Movement:1 ends here

;; smartscan

;; [[file:config.org::*smartscan][smartscan:1]]
(package! smartscan)
;; smartscan:1 ends here

;; regex-based searching, using python/pcre


;; [[file:config.org::*regex-based searching, using python/pcre][regex-based searching, using python/pcre:1]]
(package! visual-regexp)
(package! visual-regexp-steroids)
;; regex-based searching, using python/pcre:1 ends here

;; Jumping



;; [[file:config.org::*Jumping][Jumping:1]]
(package! smart-jump)
(package! rg)                           ;For smart-jump-find-references-with-rg
;; Jumping:1 ends here

;; tags
;; :PROPERTIES:
;; :CREATED:  [2023-11-17 Fri 17:09]
;; :END:



;; [[file:config.org::*tags][tags:1]]
(package! citre)
;; tags:1 ends here

;; consult-projectile
