.config/doom/config.el

;; [[file:config.org::*consult-dir][consult-dir:1]]
(after! consult-dir
  (setq consult-dir-project-list-function #'consult-dir-projectile-dirs)

  ;; this is normally find-file, but it's perhaps more useful to find any file
  ;; (setq consult-dir-default-command #'+vertico/consult-fd)
  (setq consult-dir-default-command #'consult-dir-dired)

  ;; https://github.com/karthink/consult-dir/issues/20#issuecomment-1193087091
  (map! :map minibuffer-local-map "C-c b" #'embark-become)
  (map! :map embark-become-file+buffer-map
        "d" #'dired
        "S" #'+vertico/consult-fd
        "D" #'consult-dir)
  )
;; consult-dir:1 ends here

;; projectile




;; [[file:config.org::*projectile][projectile:1]]
(after! (consult projectile)
   (setq consult-project-function (lambda (_) (projectile-project-root)))
   )
;; projectile:1 ends here

;; [[file:config.org::*consult-projectile][consult-projectile:2]]
(use-package! consult-projectile)

(after! consult-projectile
  (setq consult-buffer-sources
    '(consult--source-modified-buffer
       consult--source-project-buffer
       consult--source-buffer
       consult--source-recent-file
       consult-projectile--source-projectile-buffer
       consult-projectile--source-projectile-file
       consult-projectile--source-projectile-project
       consult--source-hidden-buffer
       +vertico--consult-org-source)))
;; consult-projectile:2 ends here

;; Orderless

;; https://github.com/oantolin/orderless#interactively-changing-the-configuration
;; https://github.com/minad/vertico#completion-styles-and-tab-completion

;; https://old.reddit.com/r/emacs/comments/o9pue1/changing_consultline_matching_with_orderless/

;; [[file:config.org::*Orderless][Orderless:1]]
(after! orderless
  ;; https://github.com/minad/consult/issues/237
  (defun consult-basic-all-completions (string table pred _point)
    ;; Ignore the disambiguation prefix
    (let ((completion-regexp-list (list (concat "\\`[\x100000-\x10FFFD]*" (regexp-quote string)))))
      (all-completions "" table pred)))

  (defun consult-basic-try-completion (string table pred _point)
    ;; Ignore the disambiguation prefix
    (let ((completion-regexp-list (list (concat "\\`[\x100000-\x10FFFD]*" (regexp-quote string)))))
      (try-completion "" table pred)))

  (add-to-list 'completion-styles-alist
    '(consult-basic
       consult-basic-try-completion consult-basic-all-completions
       "Consult-compatible basic completion."))


  ;; (orderless-define-completion-style orderless+initialism
  ;;   (orderless-matching-styles '(orderless-initialism orderless-literal orderless-regexp)))
  (setq completion-styles '(orderless)
    completion-category-defaults nil
    completion-category-overrides
    '((file (styles partial-completion))  ;; orderless+initialism))
       ;; (consult-location (styles consult-basic)) ;consult-line
       ;; (buffer (styles orderless+initialism))
       ;; (consult-multi (styles orderless+initialism))
       ;; (command (styles orderless+initialism))
       ;; (variable (styles orderless+initialism))
       ;; (symbol (styles orderless+initialism))
       )
    orderless-matching-styles '(orderless-literal orderless-regexp))
  )

(after! vertico
  (defun vi/match-components-literally ()
    "Components match literally for the rest of the session."
    (interactive)
    (setq-local orderless-matching-styles '(orderless-literal)
      orderless-style-dispatchers nil))

  ;; (define-key minibuffer-local-completion-map (kbd "C-l") #'vi/match-components-literally)
    (map! :map vertico-map
      "C-l" #'vi/match-components-literally)
      ;;"M-j" #'vertico-quick-jump)

  )
;; Orderless:1 ends here

;; [[file:config.org::*Narrowing][Narrowing:2]]
(use-package! recursive-narrow
  :commands (hydra-narrow/body recursive-narrow-or-widen-dwim recursive-widen)
  :config
  (defhydra hydra-narrow (:exit t :columns 2)
    "Narrow"
    ("n" recursive-narrow-or-widen-dwim "narrow")
    ("w" recursive-widen "widen")
    )
  )
;; Narrowing:2 ends here

;; [[file:config.org::*outline faces][outline faces:2]]
(use-package! outline
  :custom
  (outline-minor-mode-cycle t)
  (outline-minor-mode-use-buttons 'in-margins)
  :after-call doom-first-buffer-hook
  ;; :hook (
  ;;         (prog-mode . outline-minor-mode)
  ;;        )
  :bind (:map outline-minor-mode-map
         ([C-tab] . outline-cycle)
         ("C-<iso-lefttab>" . outline-hide-other) ;C-S-<tab>
         ([s-tab] . outline-cycle-buffer)); win-tab
  )

(after! outline
  ;; Customize the distracting folding markers.
  (set-display-table-slot
   standard-display-table
   'selective-display
   (let ((face-offset (* (face-id 'shadow) (lsh 1 22))))
     (vconcat (mapcar (lambda (c) (+ face-offset c)) " ➤"))))
  )
;; outline faces:2 ends here

;; yaml


;; [[file:config.org::*yaml][yaml:1]]
;; https://gist.github.com/leoc/f8c0868051003c4ea6eff638bc614575

(defun leoc/yaml-outline-level ()
  (s-count-matches "\\([ ]\\{2\\}\\)" (match-string 0)))

(defun leoc/yaml-outline-regexp ()
  (rx
    (seq
      bol
      (group (zero-or-more "  ")
        (or (group
              (seq (or (seq "\"" (*? (not (in "\"" "\n"))) "\"")
                     (seq "'" (*? (not (in "'" "\n"))) "'")
                     (*? (not (in ":" "\n"))))
                ":"
                (?? (seq
                      (*? " ")
                      (or (seq "&" (one-or-more nonl))
                        (seq ">-")
                        (seq "|"))
                      eol))))
          (group (seq
                   "- "
                   (+ (not (in ":" "\n")))
                   ":"
                   (+ nonl)
                   eol)))))))



(setq-hook! 'yaml-mode-hook outline-level 'leoc/yaml-outline-level)
(setq-hook! 'yaml-mode-hook outline-regexp (leoc/yaml-outline-regexp))
(map! :map yaml-mode-map
  "|" nil
  ":" nil
  ">" nil
  "-" nil
  "." nil
  [backspace] nil
  )
(add-hook! 'yaml-mode-hook #'outline-minor-mode #'outline-minor-faces-mode #'lsp)
;; yaml:1 ends here

;; Python

;; https://old.reddit.com/r/emacs/comments/e2u5n9/code_folding_with_outlineminormode/

;; [[file:config.org::*Python][Python:1]]
(setq-hook! 'python-mode-hook outline-regexp (python-rx (* space) (or defun decorator)))
;; Python:1 ends here
