.config/doom/packages.el

;; +This is not very useful in practice:+ doom has built in support for project
;; switching that works better with workspaces; but we can use just the find-file
;; function, which is better than +doom-project-find-file


;; [[file:config.org::*consult-projectile][consult-projectile:1]]
(package! consult-projectile :recipe (:host gitlab :repo "OlMon/consult-projectile"))
;; consult-projectile:1 ends here

;; Narrowing



;; [[file:config.org::*Narrowing][Narrowing:1]]
(package! recursive-narrow)
;; Narrowing:1 ends here

;; outline faces

;; - clutters in prog-mode, but probably useful in ein:notebook-mode


;; [[file:config.org::*outline faces][outline faces:1]]
(package! outline-minor-faces :recipe (:host github :repo "tarsius/outline-minor-faces"))
;; outline faces:1 ends here

;; Corfu/Cape
