.config/doom/config.org
** COMMENT ts-fold

TODO: keybindings, but best if we have cycling like outline-cycle https://github.com/jcs-elpa/ts-fold/issues/29

See implementation of `outline-cycle` or `outline-cycle-buffer` to diy this

WARN: ts-fold might be causing some font rendering glitches, at least with Iosevka and ts-fold-indicators-mode
WARN: ts-fold-close-all is surprisingly slow
WARN: ts-fold-indicators-mode is very slow

#+begin_src emacs-lisp :tangle packages.el
(package! ts-fold :recipe (:host github :repo "jcs-elpa/ts-fold"))
#+end_src


#+begin_src emacs-lisp
(add-hook! 'tree-sitter-mode-hook #'fringe-mode #'ts-fold-mode) ;; #'ts-fold-indicators-mode)
#+end_src
** COMMENT fold-this

TODOs:

- fold-this persistent mode only operates on buffers backed by files (https://github.com/magnars/fold-this.el/blob/master/fold-this.el#L298)
  - Only saves locations for the folded overlay
- Only saves on killing buffer/emacs (https://github.com/magnars/fold-this.el/blob/master/fold-this.el#L377)
- Written to operate on all buffers at once (https://github.com/magnars/fold-this.el/blob/master/fold-this.el#L294)
- perhaps it's worth changing to update the alist for the current buffer when folds are modified?
- maybe it can be expanded to handle folding for ein notebooks, but the alist format would have to be cell identifiers.

#+begin_src emacs-lisp :tangle packages.el
(package! fold-this)
#+end_src

#+begin_src emacs-lisp
(add-hook! '(prog-mode-hook ein:notebook-mode-hook) (fold-this-mode fold-this-persistent-mode))
#+end_src
** COMMENT outshine

has unwieldy keybindings. unclear we need this over outline-minor-mode (in the context of ein:notebook)

#+begin_src emacs-lisp :tangle packages.el
(package! outshine)
#+end_src
** COMMENT outli


#+begin_src emacs-lisp :tangle packages.el
(package! outli :recipe (:host github :repo "jdtsmith/outli"))
#+end_src



* Completion

** COMMENT Tabnine

#+begin_src emacs-lisp :tangle packages.el
(package! company-tabnine)
#+end_src

#+begin_src emacs-lisp
(use-package! company-tabnine
  :custom
  (company-tabnine-no-continue t)
  :commands (company-tabnine))
  ;; :config
  ;; ;; https://github.com/TommyX12/company-tabnine#known-issues
  ;; ;; workaround for company-transformers
  ;; (setq company-tabnine--disable-next-transform nil)
  ;; (defun my-company--transform-candidates (func &rest args)
  ;;   (if (not company-tabnine--disable-next-transform)
  ;;       (apply func args)
  ;;     (setq company-tabnine--disable-next-transform nil)
  ;;     (car args)))

  ;; (defun my-company-tabnine (func &rest args)
  ;;   (when (eq (car args) 'candidates)
  ;;     (setq company-tabnine--disable-next-transform t))
  ;;   (apply func args))

  ;; (advice-add #'company--transform-candidates :around #'my-company--transform-candidates)
  ;; (advice-add #'company-tabnine :around #'my-company-tabnine))
#+end_src

** Corfu/Cape

#+begin_src emacs-lisp :tangle packages.el
(package! corfu :recipe (:host github :repo "minad/corfu" :files (:defaults "extensions/*.el")))
(package! cape)
(package! company)                      ; for company-yankpad
(package! popon :recipe (:host codeberg :repo "akib/emacs-popon"))
;; (package! corfu-terminal :recipe (:type git :repo "https://codeberg.org/akib/emacs-corfu-terminal.git"))
#+end_src

#+begin_src emacs-lisp
(use-package! corfu
  :after-call doom-first-buffer-hook
  :custom
  (corfu-auto t)
  (corfu-auto-delay 0.2)
  (corfu-auto-prefix 2)
  (completion-styles '(basic))
  :config
  (custom-set-faces! '(corfu-current :background "ivory4"))
  ;; (global-corfu-mode)
  (corfu-history-mode 1)
  :hook (
          (prog-mode . corfu-mode)
          (org-mode . corfu-mode)
          (conf-mode . corfu-mode)
          (text-mode . corfu-mode)
          )
  )

;; (after! corfu
;;   (setq! corfu-terminal-disable-on-gui nil)
;;   (corfu-terminal-mode)
                                        ;  )

(use-package! cape
  :after corfu
  :config
  (require 'company)
  (defalias 'vi/cape-yankpad (cape-capf-buster (cape-company-to-capf #'company-yankpad)))

                        ;; (apply-partially #'company--multi-backend-adapter
                        ;;   '( ;;company-tabnine
                        ;;      company-yankpad)))))

  ;; (defalias 'vi/cape-tabnine (cape-company-to-capf #'company-tabnine))
  (defalias 'vi/cape-interactive-yankpad (cape-capf-interactive #'vi/cape-yankpad))

  (setq-hook! '(conf-mode-hook text-mode-hook json-mode-hook org-mode-hook ein:notebook-mode-hook)
    completion-at-point-functions
    (list #'vi/cape-yankpad)) ;; #'cape-dabbrev))

  (defun vi/corfu-lsp-setup ()
    ;; Combine LSP via corfu so we can use it in combination with
    ;; company-tabnine and yankpad

    (interactive)
    ;; https://github.com/minad/corfu/wiki

    ;;;; these are set in LSP use-package
    ;; (setq-local lsp-enable-completion-at-point t)
    ;; (setq-local lsp-completion-provider :none)       ;we use corfu (but we do have LSP set up through that)!

    (defun my/orderless-dispatch-flex-first (_pattern index _total)
      (and (eq index 0) 'orderless-flex))

    (defun my/lsp-mode-setup-completion ()
      (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
        '(orderless)))

    ;; Optionally configure the first word as flex filtered.
    ;; (add-hook 'orderless-style-dispatchers #'my/orderless-dispatch-flex-first nil 'local)

    ;; Optionally configure the cape-capf-buster.
    (setq-local completion-at-point-functions (list
                                                (cape-capf-super
                                                  (cape-capf-buster #'lsp-completion-at-point)
                                                  #'vi/cape-yankpad
                                                  ;; #'cape-dabbrev
                                                  )
                                                )))
  (add-hook! 'lsp-completion-mode-hook #'vi/corfu-lsp-setup)
  )
#+end_src


** copilot

*** original package

#+begin_src emacs-lisp :tangle packages.el
(package! copilot
  :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))
#+end_src

*** COMMENT updated fork

https://robert.kra.hn/posts/2023-02-22-copilot-emacs-setup/#copilot-emacs-packages

#+begin_src emacs-lisp :tangle packages.el
(package! copilot
  :recipe (:host github :repo "rksm/copilot.el" :files ("*.el" "dist")))
#+end_src

