.config/doom/config.el

;; [[file:config.org::*Corfu/Cape][Corfu/Cape:2]]
(use-package! corfu
  :after-call doom-first-buffer-hook
  :custom
  (corfu-auto t)
  (corfu-auto-delay 0.2)
  (corfu-auto-prefix 2)
  (completion-styles '(basic))
  :config
  (custom-set-faces! '(corfu-current :background "ivory4"))
  ;; (global-corfu-mode)
  (corfu-history-mode 1)
  :hook (
          (prog-mode . corfu-mode)
          (org-mode . corfu-mode)
          (conf-mode . corfu-mode)
          (text-mode . corfu-mode)
          )
  )

;; (after! corfu
;;   (setq! corfu-terminal-disable-on-gui nil)
;;   (corfu-terminal-mode)
                                        ;  )

(use-package! cape
  :after corfu
  :config
  (require 'company)
  (defalias 'vi/cape-yankpad (cape-capf-buster (cape-company-to-capf #'company-yankpad)))

                        ;; (apply-partially #'company--multi-backend-adapter
                        ;;   '( ;;company-tabnine
                        ;;      company-yankpad)))))

  ;; (defalias 'vi/cape-tabnine (cape-company-to-capf #'company-tabnine))
  (defalias 'vi/cape-interactive-yankpad (cape-capf-interactive #'vi/cape-yankpad))

  (setq-hook! '(conf-mode-hook text-mode-hook json-mode-hook org-mode-hook ein:notebook-mode-hook)
    completion-at-point-functions
    (list #'vi/cape-yankpad)) ;; #'cape-dabbrev))

  (defun vi/corfu-lsp-setup ()
    ;; Combine LSP via corfu so we can use it in combination with
    ;; company-tabnine and yankpad

    (interactive)
    ;; https://github.com/minad/corfu/wiki

    ;;;; these are set in LSP use-package
    ;; (setq-local lsp-enable-completion-at-point t)
    ;; (setq-local lsp-completion-provider :none)       ;we use corfu (but we do have LSP set up through that)!

    (defun my/orderless-dispatch-flex-first (_pattern index _total)
      (and (eq index 0) 'orderless-flex))

    (defun my/lsp-mode-setup-completion ()
      (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
        '(orderless)))

    ;; Optionally configure the first word as flex filtered.
    ;; (add-hook 'orderless-style-dispatchers #'my/orderless-dispatch-flex-first nil 'local)

    ;; Optionally configure the cape-capf-buster.
    (setq-local completion-at-point-functions (list
                                                (cape-capf-super
                                                  (cape-capf-buster #'lsp-completion-at-point)
                                                  #'vi/cape-yankpad
                                                  ;; #'cape-dabbrev
                                                  )
                                                )))
  (add-hook! 'lsp-completion-mode-hook #'vi/corfu-lsp-setup)
  )
;; Corfu/Cape:2 ends here

;; config
