.config/doom/packages.el


;; [[file:config.org::*Corfu/Cape][Corfu/Cape:1]]
(package! corfu :recipe (:host github :repo "minad/corfu" :files (:defaults "extensions/*.el")))
(package! cape)
(package! company)                      ; for company-yankpad
(package! popon :recipe (:host codeberg :repo "akib/emacs-popon"))
;; (package! corfu-terminal :recipe (:type git :repo "https://codeberg.org/akib/emacs-corfu-terminal.git"))
;; Corfu/Cape:1 ends here

;; original package


;; [[file:config.org::*original package][original package:1]]
(package! copilot
  :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))
;; original package:1 ends here

;; gptel
;; :PROPERTIES:
