.config/doom/config.org
*** config

#+begin_src emacs-lisp
(use-package! copilot
  :after corfu
  :custom
  (copilot-idle-delay 0.3)
  :config

  ;; https://github.com/rksm/copilot-emacsd/blob/master/init.el
  (defun rk/copilot-complete-or-accept ()
    "Command that either triggers a completion or accepts one if one
is available. Useful if you tend to hammer your keys like I do."
    (interactive)
    (if (copilot--overlay-visible)
      (progn
        (copilot-accept-completion)
        (open-line 1)
        (next-line))
      (copilot-complete)))

  (defun rk/copilot-tab ()
    "Tab command that will complet with copilot if a completion is
available. Otherwise will try tab-indent."
    (interactive)
    ;; indent-for-tab-command compares last-command to this-command in python-indent-line-function to decide whether to dedent.
    ;; without this, it stops dedenting
    (set 'this-command 'indent-for-tab-command)
    (or (copilot-accept-completion)
      ;; (company-yasnippet-or-completion)
      (indent-for-tab-command)))


  (defun rk/copilot-complete-if-active (next-func n)
    (let ((completed (when copilot-mode (copilot-accept-completion))))
      (unless completed (funcall next-func n))))


  (defun rk/copilot-quit ()
    "Run `copilot-clear-overlay' or `keyboard-quit'. If copilot is
cleared, make sure the overlay doesn't come back too soon."
    (interactive)
    (condition-case err
      (when (copilot--overlay-visible)
        (lexical-let ((pre-copilot-disable-predicates copilot-disable-predicates))
          (setq copilot-disable-predicates (list (lambda () t)))
          (copilot-clear-overlay)
          (run-with-idle-timer
            0.3
            nil
            (lambda ()
              (setq copilot-disable-predicates pre-copilot-disable-predicates)))))
      (error handler)))

  ;; (advice-add 'keyboard-quit :before #'rk/copilot-quit)
  (add-hook! 'doom-escape-hook
    (defun vi/rk/copilot-quit()
      ;; return nil so other hooks can run
      (progn (rk/copilot-quit) nil)))

  ;; complete by pressing right or tab but only when copilot completions are
  ;; shown. This means we leave the normal functionality intact.
  ;;(advice-add 'right-char :around #'rk/copilot-complete-if-active)
  ;; (advice-add 'indent-for-tab-command :around #'rk/copilot-complete-if-active)

  :hook ((prog-mode . copilot-mode) (conf-mode . copilot-mode) (yaml-mode . copilot-mode))
  :bind (
         :map copilot-completion-map
          ;; ("C-g" . 'copilot-clear-overlay)
         ;;("<tab>" . 'copilot-accept-completion)
          ("<right>" . 'copilot-accept-completion)
         ("C-<up>" . 'copilot-previous-completion)
         ("C-<down>" . 'copilot-next-completion)
         ("C-<right>" . 'copilot-accept-completion-by-word)
         ("C-M-<right>" . 'copilot-accept-completion-by-line))
  ;; :bind (;; ("C-TAB" . 'copilot-accept-completion-by-word)
  ;;         ;; ("C-<tab>" . 'copilot-accept-completion-by-word)
  ;;         :map copilot-mode-map
  ;;         ;;;("C-/" . 'rk/copilot-complete-or-accept)
  ;;         ;; :map copilot-completion-map
  ;;         ;; ("C-<tab>" . 'copilot-accept-completion)
  ;;         )
  )

(add-hook! 'copilot-mode-hook (map! :map copilot-mode-map "C-<return>" #'rk/copilot-complete-or-accept))
(add-hook! 'copilot-mode-hook (map! :map prog-mode-map "<tab>" #'rk/copilot-tab))

;; try to turn off keybindings (up/down) that company-mode interferes with
;; (add-hook! prog-mode :append (progn (message "disabling company mode") (company-mode -1) (message "disabled")))
#+end_src

** COMMENT chatgpt

pipx install git+https://github.com/mmabrouk/chatgpt-wrapper
pipx inject chatGPT playwright --include-apps
playwright install
chatgpt install

it also requires a globally accessible python package `epc`.. not sure how to
achieve that easily (https://github.com/joshcho/ChatGPT.el/issues/4)


#+begin_src emacs-lisp :tangle packages.el
(package! chatgpt
  :recipe (:host github :repo "joshcho/ChatGPT.el" :files ("dist" "*.el")))
#+end_src


#+begin_src emacs-lisp
(use-package! chatgpt
  :defer t
  :config
  (unless (boundp 'python-interpreter)
    (defvaralias 'python-interpreter 'python-shell-interpreter))
  (setq chatgpt-repo-path (expand-file-name "straight/repos/ChatGPT.el/" doom-local-dir))
  (set-popup-rule! (regexp-quote "*ChatGPT*")
    :side 'bottom :size .5 :ttl nil :quit t :modeline nil))
#+end_src

** COMMENT chatgpt shell

#+begin_src emacs-lisp :tangle packages.el
(package! chatgpt-shell)
#+end_src


#+begin_src emacs-lisp
(use-package chatgpt-shell
  :custom
  (chatgpt-shell-openai-key
    (lambda ()
      ;; ~/.authinfo.gpg
      (auth-source-pick-first-password :host "api.openai.com")))
  :bind (
          :map shell-maker-map
          (("C-<return>" . comint-send-input) ("<return>" . newline))
          )
  )
#+end_src

** gptel
:PROPERTIES:
:CREATED:  [2024-01-22 Mon 12:01]
:END:


#+begin_src emacs-lisp :tangle packages.el
(package! gptel)
#+end_src


#+begin_src emacs-lisp
(use-package! gptel)

#+end_src

* Iedit

#+begin_src emacs-lisp :tangle packages.el
(package! iedit)
#+end_src

#+begin_src emacs-lisp
(use-package! iedit
  :bind
  ("C-;" . iedit-mode))
#+end_src

* wgrep

#+begin_src emacs-lisp :tangle packages.el
(package! wgrep)
#+end_src


#+begin_src emacs-lisp
(use-package! wgrep
  :commands (wgrep-change-to-wgrep-mode)
  :custom
  (wgrep-auto-save-buffer t)
  )
#+end_src

* COMMENT Which-key

#+begin_src emacs-lisp
;; Allow C-h to trigger which-key before it is done automatically
(after! which-key
  (setq which-key-show-early-on-C-h t)
  )
#+end_src

* Hydra

#+begin_src emacs-lisp :tangle packages.el
(package! pretty-hydra)
(package! major-mode-hydra)
#+end_src

#+begin_src emacs-lisp
(after! major-mode-hydra
  (setq major-mode-hydra-invisible-quit-key "q")

  (defun vi/get-major-mode ()
    (cond
     ((and (boundp 'ein:notebook-mode) ein:notebook-mode) 'ein:notebook-mode)
     (major-mode)
     ))

  (defun vi/major-mode-hydra ()
    (interactive)
    (major-mode-hydra-dispatch (vi/get-major-mode)))
  )

(defun vi/revert-buffer ()
  (interactive)
  (find-alternate-file (buffer-file-name)))
#+end_src

** Global hydra
#+begin_src emacs-lisp
(pretty-hydra-define global-hydra (:exit t :quit-key ("q" "C-g"))
  ("Searching"
    (;; ("f" +vertico/consult-fd "fd")
      ("s" +default/search-project "rg in project")
      ("t" consult-citre "tags search")
      ("l" consult-line "Line isearch")
      )
    "Buffers/files"
    (("b" consult-buffer "Buffers")
      ;; ("P" consult-projectile-find-file "Project files")
      ;; ("M-P" projectile-save-project-buffers "Save Project Buffers")
      ("T" dirvish-side)
      ("R" vi/revert-buffer "Revert")
      ("M-k" vi/force-kill-buffer "Force kill")
      )
    "Intra-buffer"
    (
      ("o" consult-outline "outlIne")
      ("i" consult-imenu "Imenu")
      ;; ("." push-mark-command "Push Mark")
      ;; ("m" consult-mark "consult-mark")
      ;; ("M" consult-global-mark "global-mark")
      ;;("f" fold-active-region "fold region")
      )
    "vterms"
    (
      ("v" vi/tile-vterm-buffers "vterm-toggle")
      ("V" (vi/vterm-local t) "vterm")
      ;; ("D" detached-list-sessions "Detached list sessions")
      )
    "Modes"
    (;; ("a" hydra-annotate/body "Annotate")
      ("SPC" vi/major-mode-hydra "Major")
      ("c" flycheck-hydra/body "flycheck")
      ("n" hydra-narrow/body "narrow")
      ;; ("e" ein-global-hydra/body "EIN")
      ;; ("p" org-pomodoro "Pomodoro")
      ("M-m" minions-minor-modes-menu "Minor modes")
      )
    "Actions"
    (
      ("M-y" yankpad-insert "yankpad")
      ("g" magit-status-here "magit")
      ("M-\\" edit-indirect-region "edit indirect region")
      ("d" dirvish-dwim "dired" )
      ;; ("r" consult-notes-org-roam-find-node "find node")
      ("r" consult-org-roam-file-find "find node")
      ("M-l" org-store-link "store link")
      ;; ("A" org-agenda-list "Agenda")
      ("a" vi/align-comments "Align comments")
      ("W" vi/dedup-windows "Dedupe windows")
      ("w" hydra-burly/body "Windows")
      ("P" prodigy "Prodigy")
      )
    )
  )

(key-chord-define-global "hh" #'global-hydra/body)
(key-chord-define-global "jj" #'vi/major-mode-hydra)
#+end_src

* Org

