.config/doom/config.el


;; [[file:config.org::*config][config:1]]
(use-package! copilot
  :after corfu
  :custom
  (copilot-idle-delay 0.3)
  :config

  ;; https://github.com/rksm/copilot-emacsd/blob/master/init.el
  (defun rk/copilot-complete-or-accept ()
    "Command that either triggers a completion or accepts one if one
is available. Useful if you tend to hammer your keys like I do."
    (interactive)
    (if (copilot--overlay-visible)
      (progn
        (copilot-accept-completion)
        (open-line 1)
        (next-line))
      (copilot-complete)))

  (defun rk/copilot-tab ()
    "Tab command that will complet with copilot if a completion is
available. Otherwise will try tab-indent."
    (interactive)
    ;; indent-for-tab-command compares last-command to this-command in python-indent-line-function to decide whether to dedent.
    ;; without this, it stops dedenting
    (set 'this-command 'indent-for-tab-command)
    (or (copilot-accept-completion)
      ;; (company-yasnippet-or-completion)
      (indent-for-tab-command)))


  (defun rk/copilot-complete-if-active (next-func n)
    (let ((completed (when copilot-mode (copilot-accept-completion))))
      (unless completed (funcall next-func n))))


  (defun rk/copilot-quit ()
    "Run `copilot-clear-overlay' or `keyboard-quit'. If copilot is
cleared, make sure the overlay doesn't come back too soon."
    (interactive)
    (condition-case err
      (when (copilot--overlay-visible)
        (lexical-let ((pre-copilot-disable-predicates copilot-disable-predicates))
          (setq copilot-disable-predicates (list (lambda () t)))
          (copilot-clear-overlay)
          (run-with-idle-timer
            0.3
            nil
            (lambda ()
              (setq copilot-disable-predicates pre-copilot-disable-predicates)))))
      (error handler)))

  ;; (advice-add 'keyboard-quit :before #'rk/copilot-quit)
  (add-hook! 'doom-escape-hook
    (defun vi/rk/copilot-quit()
      ;; return nil so other hooks can run
      (progn (rk/copilot-quit) nil)))

  ;; complete by pressing right or tab but only when copilot completions are
  ;; shown. This means we leave the normal functionality intact.
  ;;(advice-add 'right-char :around #'rk/copilot-complete-if-active)
  ;; (advice-add 'indent-for-tab-command :around #'rk/copilot-complete-if-active)

  :hook ((prog-mode . copilot-mode) (conf-mode . copilot-mode) (yaml-mode . copilot-mode))
  :bind (
         :map copilot-completion-map
          ;; ("C-g" . 'copilot-clear-overlay)
         ;;("<tab>" . 'copilot-accept-completion)
          ("<right>" . 'copilot-accept-completion)
         ("C-<up>" . 'copilot-previous-completion)
         ("C-<down>" . 'copilot-next-completion)
         ("C-<right>" . 'copilot-accept-completion-by-word)
         ("C-M-<right>" . 'copilot-accept-completion-by-line))
  ;; :bind (;; ("C-TAB" . 'copilot-accept-completion-by-word)
  ;;         ;; ("C-<tab>" . 'copilot-accept-completion-by-word)
  ;;         :map copilot-mode-map
  ;;         ;;;("C-/" . 'rk/copilot-complete-or-accept)
  ;;         ;; :map copilot-completion-map
  ;;         ;; ("C-<tab>" . 'copilot-accept-completion)
  ;;         )
  )

(add-hook! 'copilot-mode-hook (map! :map copilot-mode-map "C-<return>" #'rk/copilot-complete-or-accept))
(add-hook! 'copilot-mode-hook (map! :map prog-mode-map "<tab>" #'rk/copilot-tab))

;; try to turn off keybindings (up/down) that company-mode interferes with
;; (add-hook! prog-mode :append (progn (message "disabling company mode") (company-mode -1) (message "disabled")))
;; config:1 ends here

;; [[file:config.org::*gptel][gptel:2]]
(use-package! gptel)
;; gptel:2 ends here

;; [[file:config.org::*Iedit][Iedit:2]]
(use-package! iedit
  :bind
  ("C-;" . iedit-mode))
;; Iedit:2 ends here

;; [[file:config.org::*wgrep][wgrep:2]]
(use-package! wgrep
  :commands (wgrep-change-to-wgrep-mode)
  :custom
  (wgrep-auto-save-buffer t)
  )
;; wgrep:2 ends here

;; [[file:config.org::*Hydra][Hydra:2]]
(after! major-mode-hydra
  (setq major-mode-hydra-invisible-quit-key "q")

  (defun vi/get-major-mode ()
    (cond
     ((and (boundp 'ein:notebook-mode) ein:notebook-mode) 'ein:notebook-mode)
     (major-mode)
     ))

  (defun vi/major-mode-hydra ()
    (interactive)
    (major-mode-hydra-dispatch (vi/get-major-mode)))
  )

(defun vi/revert-buffer ()
  (interactive)
  (find-alternate-file (buffer-file-name)))
;; Hydra:2 ends here

;; Global hydra

;; [[file:config.org::*Global hydra][Global hydra:1]]
(pretty-hydra-define global-hydra (:exit t :quit-key ("q" "C-g"))
  ("Searching"
    (;; ("f" +vertico/consult-fd "fd")
      ("s" +default/search-project "rg in project")
      ("t" consult-citre "tags search")
      ("l" consult-line "Line isearch")
      ("j" jump-hydra/body "Jump")
      )
    "Buffers/files"
    (("b" consult-buffer "Buffers")
      ("P" consult-projectile-find-file "Project files")
      ("M-P" projectile-save-project-buffers "Save Project Buffers")
      ("T" dirvish-side)
      ("R" vi/revert-buffer "Revert")
      ("M-k" vi/force-kill-buffer "Force kill")
      )
    "Intra-buffer"
    (
      ("o" consult-outline "outlIne")
      ("i" consult-imenu "Imenu")
      ;; ("." push-mark-command "Push Mark")
      ;; ("m" consult-mark "consult-mark")
      ;; ("M" consult-global-mark "global-mark")
      ;;("f" fold-active-region "fold region")
      )
    "vterms"
    (
      ("v" vi/tile-vterm-buffers "vterm-toggle")
      ("V" (vi/vterm-local t) "vterm")
      ;; ("D" detached-list-sessions "Detached list sessions")
      )
    "Modes"
    (;; ("a" hydra-annotate/body "Annotate")
      ("SPC" vi/major-mode-hydra "Major")
      ("c" flycheck-hydra/body "flycheck")
      ("n" hydra-narrow/body "narrow")
      ("L" lsp-mode-hydra/body "LSP")
      ;; ("e" ein-global-hydra/body "EIN")
      ;; ("p" org-pomodoro "Pomodoro")
      ("M-m" minions-minor-modes-menu "Minor modes")
      )
    "Actions"
    (
      ("M-y" yankpad-insert "yankpad")
      ("g" magit-status-here "magit")
      ("M-\\" edit-indirect-region "edit indirect region")
      ("d" dirvish-dwim "dired" )
      ;; ("r" consult-notes-org-roam-find-node "find node")
      ("r" consult-org-roam-file-find "find node")
      ("M-l" org-store-link "store link")
      ;; ("A" org-agenda-list "Agenda")
      ("a" vi/align-comments "Align comments")
      ("W" vi/dedup-windows "Dedupe windows")
      ("w" hydra-burly/body "Windows")
      ("P" prodigy "Prodigy")
      )
    )
  )

(key-chord-define-global "hh" #'global-hydra/body)
(key-chord-define-global "jj" #'vi/major-mode-hydra)
;; Global hydra:1 ends here

;; org-mode config

;; [[file:config.org::*org-mode config][org-mode config:1]]
(after! org
