.config/doom/packages.el
;; :CREATED:  [2024-01-22 Mon 12:01]
;; :END:



;; [[file:config.org::*gptel][gptel:1]]
(package! gptel)
;; gptel:1 ends here

;; Iedit


;; [[file:config.org::*Iedit][Iedit:1]]
(package! iedit)
;; Iedit:1 ends here

;; wgrep


;; [[file:config.org::*wgrep][wgrep:1]]
(package! wgrep)
;; wgrep:1 ends here

;; Hydra


;; [[file:config.org::*Hydra][Hydra:1]]
(package! pretty-hydra)
(package! major-mode-hydra)
;; Hydra:1 ends here
