.config/doom/config.org
** org-mode package
#+begin_src emacs-lisp :tangle packages.el
;; Pinning for unfolding org-mode overlays while searching
;; https://github.com/doomemacs/doomemacs/issues/6478#issuecomment-1293505404
(package! org :pin "971eb6885ec996c923e955730df3bafbdc244e54")
;; (package! org :pin "6001313b8f8bc2c717b44070d6e7b19afc6125ec")
#+end_src

** org-mode config
#+begin_src emacs-lisp
(after! org
  ;; Add created timestamps to all headings (https://stackoverflow.com/questions/12262220/add-created-date-property-to-todos-in-org-mode/13285957#13285957)
  ;; (require 'org-expiry)
  ;; (org-expiry-insinuate)
  ;; (setq org-expiry-inactive-timestamps t)

  ;; hide org markup indicators
  (setq org-hide-emphasis-markers t
        ;; Insert Org headings at point, not after the current subtree (this is enabled by default by Doom).
        org-insert-heading-respect-content nil
        org-cycle-separator-lines 0
        org-attach-id-dir ".attach"
        org-blank-before-new-entry '((heading . never) (plain-list-item . never))
        org-startup-folded t
        org-startup-indented t
        org-startup-numerated nil
        org-startup-align-all-tables t
        ;; Leads to 'File mode specification error: (user-error Not at a table)' in some org files
        ;; replace with #+startup: shrink
        ;;        org-startup-shrink-all-tables t
        org-log-into-drawer t
        org-src-window-setup 'current-window
        org-src-preserve-indentation nil
        org-edit-src-content-indentation 0
        org-num-skip-commented t
        org-M-RET-may-split-line t
        ;; https://old.reddit.com/r/orgmode/comments/fagcaz/show_schedule_and_deadlines_for_standard_todo_list/
        org-agenda-files '("~/org/personal.org")
        org-refile-targets '(
                             ("~/org/personal.org" . (:maxlevel . 1))
                             ("~/org/ml.org" . (:maxlevel . 1))
                             ("~/org/work.org" . (:maxlevel . 1))
                             ("~/org/learning.org" . (:maxlevel . 1))
                             )
        org-agenda-entry-types '(:deadline :scheduled)
        org-agenda-skip-scheduled-if-done t
        org-todo-keywords '((sequence "TODO(t)" "WAIT(w!)" "REVISIT(r!)" "|" "DONE(d!)" "KILL(k!)" ))
        org-todo-keyword-faces '(("WAIT" . +org-todo-onhold)
                                 ("SOMEDAY" . +org-todo-project)
                                 ("KILL" . +org-todo-cancel))
        org-use-fast-todo-selection 'expert

        ;; https://github.com/radian-software/ctrlf/issues/118
        org-fold-core-style 'overlays)

  (major-mode-hydra-define org-mode (:quit-key ("q" "C-g") :title "test")
    ("Subtree"
     (("k" org-cut-subtree "cut")
      ("y" org-paste-subtree "paste")
      ("<up>" org-promote-subtree "promote" :exit nil)
      ("<down>" org-demote-subtree "demote" :exit nil)
      )
     "Src"
     (("/" org-babel-demarcate-block "split src block")
      ("T" org-babel-tangle "tangle")
       ("\\" org-edit-src-code "edit")
      )
     "Roam/Links"
     (
      ("N" org-id-get-create "Make into node")
      ("s" consult-notes-search-in-all-notes "search notes")
      ;; ("l" org-store-link "store link")
      ("i" org-insert-link "insert link")
      ("t" org-roam-tag-add "tag")
      ("X" org-roam-extract-subtree "Extract to node")
      ("w" org-roam-refile "refile")
      )
     "Misc"
     (
      ;; https://stackoverflow.com/a/6156444
      ;; '(4) is prefix (C-u)
      ;; '(16) is double-prefix C-u C-u
      ("x" (org-toggle-checkbox '(4)) "List [x]")
      ("*" org-toggle-heading "Toggle heading")
      ("-" org-toggle-item "Toggle item")
      ("Y" org-download-clipboard "pbpaste")
      )
     )
    )
  )
#+end_src


*** COMMENT Electric pairs

To remove:
(sp-local-pair 'org-mode "~" nil :actions :rem)

https://smartparens.readthedocs.io/en/latest/pair-management.html

#+begin_src emacs-lisp
(after! smartparens

 (sp-local-pair 'org-mode "~" "~")
 ;; (sp-local-pair 'org-mode "=" "=")
 ;; (sp-local-pair 'org-mode "$" "$")
 )
#+end_src

*** show delimiters

#+begin_src emacs-lisp :tangle packages.el
(package! org-appear :recipe (:host github :repo "awth13/org-appear"))
#+end_src


#+begin_src emacs-lisp
(use-package! org-appear
 :after org
 :custom (
          (org-appear-autoemphasis t)
          (org-appear-autolinks t)
          (org-appear-autosubmarkers t)
          (org-appear-autoentities t)
          )
 :hook (org-mode . org-appear-mode)
 )
#+end_src

*** tangle on save

***** COMMENT Use auto-tangle

+Fails with /sudo tangle files https://github.com/yilkalargaw/org-auto-tangle/issues/9+

Fails with `:comments both` and certain modes:
https://github.com/yilkalargaw/org-auto-tangle/issues/11, but so does "Custom
async tangle" below.

The "After save hook" version is synchronous and has no problems.

+<2022-07-08 Fri> Pinned to c208036 to see if 'max-lisp-eval-depth' errors were caused by https://github.com/yilkalargaw/org-auto-tangle/commit/5b6071c5649ed648c97cd2deebf74fe633f7f0d0+

Also see https://tecosaur.github.io/emacs-config/config.html#asynchronous-config-tangling

We'd like to set a timeout and fall through to synchronous tangle?

#+begin_src emacs-lisp :tangle packages.el
(package! org-auto-tangle :recipe (:host github :repo "yilkalargaw/org-auto-tangle"))
#+end_src

#+begin_src emacs-lisp
(use-package! org-auto-tangle
 :after org
 :config
 (setq org-auto-tangle-default t)      ;this doesn't work with :custom
 :hook (org-mode . org-auto-tangle-mode))
#+end_src

***** COMMENT After save hook
#+begin_src emacs-lisp
(add-hook! org-mode :append
 (add-hook! after-save :append :local #'org-babel-tangle))
#+end_src

****** COMMENT Fall through from auto-tangle to org-babel-tangle

See https://github.com/yilkalargaw/org-auto-tangle/issues/9#issuecomment-1048465648 && https://github.com/yilkalargaw/org-auto-tangle/issues/11

For such situations, we may want #+auto_tangle: nil to cause the
org-babel-tangle after save hook to get set. Here's some example code to get
started:

#+begin_src emacs-lisp
(let ((will_auto_tangle (let (
                           (auto_tangle_extracted_assoc
                            ;; uniquify auto_tangle; org-collect-keywords capitalizes; returns ("AUTO_TANGLE" . "nil") or ("AUTO_TANGLE" . "t")
                            (assoc "AUTO_TANGLE" (org-collect-keywords '("auto_tangle") '("auto_tangle"))))
                           )
                           (if
                               (eq auto_tangle_extracted_assoc nil)    ;not found
                               org-auto-tangle-default           ;default
                             (cdr auto_tangle_extracted_assoc)         ;else whatever was found
                             )
                           )
                           ))
                                       ;can be nil or "nil" or "t" or t, convert "nil" to nil
                           (if (equal will_auto_tangle "nil") nil will_auto_tangle)
 )
#+end_src
*** Images


#+begin_src emacs-lisp :tangle packages.el
(package! org-download)
#+end_src

#+begin_src emacs-lisp
(after! org
 (setq org-download-method 'directory
       org-download-image-dir "org-images"
       org-download-heading-lvl nil
       org-download-timestamp "%Y%m%d-%H%M%S_"
       org-startup-with-inline-images t
       org-image-actual-width 300))
#+end_src
*** Reformatting an Org buffer

(originally:
https://zzamboni.org/post/my-doom-emacs-configuration-with-commentary/ A
function that reformats the current buffer by regenerating the text from its
internal parsed representation. Quite amazing.)

#+begin_src emacs-lisp
(after! org
 (defun vi/org-reformat-buffer ()
   (interactive)
   (when (y-or-n-p "Really format current buffer? ")
     (let ((document (org-element-interpret-data (org-element-parse-buffer))))
       (erase-buffer)
       (insert document)
       (goto-char (point-min))))))
#+end_src

*** Useful functions

