.config/doom/config.el
  ;; Add created timestamps to all headings (https://stackoverflow.com/questions/12262220/add-created-date-property-to-todos-in-org-mode/13285957#13285957)
  ;; (require 'org-expiry)
  ;; (org-expiry-insinuate)
  ;; (setq org-expiry-inactive-timestamps t)

  ;; hide org markup indicators
  (setq org-hide-emphasis-markers t
        ;; Insert Org headings at point, not after the current subtree (this is enabled by default by Doom).
        org-insert-heading-respect-content nil
        org-cycle-separator-lines 0
        org-attach-id-dir ".attach"
        org-blank-before-new-entry '((heading . never) (plain-list-item . never))
        org-startup-folded t
        org-startup-indented t
        org-startup-numerated nil
        org-startup-align-all-tables t
        ;; Leads to 'File mode specification error: (user-error Not at a table)' in some org files
        ;; replace with #+startup: shrink
        ;;        org-startup-shrink-all-tables t
        org-log-into-drawer t
        org-src-window-setup 'current-window
        org-src-preserve-indentation nil
        org-edit-src-content-indentation 0
        org-num-skip-commented t
        org-M-RET-may-split-line t
        ;; https://old.reddit.com/r/orgmode/comments/fagcaz/show_schedule_and_deadlines_for_standard_todo_list/
        org-agenda-files '("~/org/personal.org")
        org-refile-targets '(
                             ("~/org/personal.org" . (:maxlevel . 1))
                             ("~/org/ml.org" . (:maxlevel . 1))
                             ("~/org/work.org" . (:maxlevel . 1))
                             ("~/org/learning.org" . (:maxlevel . 1))
                             )
        org-agenda-entry-types '(:deadline :scheduled)
        org-agenda-skip-scheduled-if-done t
        org-todo-keywords '((sequence "TODO(t)" "WAIT(w!)" "REVISIT(r!)" "|" "DONE(d!)" "KILL(k!)" ))
        org-todo-keyword-faces '(("WAIT" . +org-todo-onhold)
                                 ("SOMEDAY" . +org-todo-project)
                                 ("KILL" . +org-todo-cancel))
        org-use-fast-todo-selection 'expert

        ;; https://github.com/radian-software/ctrlf/issues/118
        org-fold-core-style 'overlays)

  (major-mode-hydra-define org-mode (:quit-key ("q" "C-g") :title "test")
    ("Subtree"
     (("k" org-cut-subtree "cut")
      ("y" org-paste-subtree "paste")
      ("<up>" org-promote-subtree "promote" :exit nil)
      ("<down>" org-demote-subtree "demote" :exit nil)
      )
     "Src"
     (("/" org-babel-demarcate-block "split src block")
      ("T" org-babel-tangle "tangle")
       ("\\" org-edit-src-code "edit")
      )
     "Roam/Links"
     (
      ("N" org-id-get-create "Make into node")
      ("s" consult-notes-search-in-all-notes "search notes")
      ;; ("l" org-store-link "store link")
      ("i" org-insert-link "insert link")
      ("t" org-roam-tag-add "tag")
      ("X" org-roam-extract-subtree "Extract to node")
      ("w" org-roam-refile "refile")
      )
     "Misc"
     (
      ;; https://stackoverflow.com/a/6156444
      ;; '(4) is prefix (C-u)
      ;; '(16) is double-prefix C-u C-u
      ("x" (org-toggle-checkbox '(4)) "List [x]")
      ("*" org-toggle-heading "Toggle heading")
      ("-" org-toggle-item "Toggle item")
      ("Y" org-download-clipboard "pbpaste")
      )
     )
    )
  )
;; org-mode config:1 ends here

;; [[file:config.org::*show delimiters][show delimiters:2]]
(use-package! org-appear
 :after org
 :custom (
          (org-appear-autoemphasis t)
          (org-appear-autolinks t)
          (org-appear-autosubmarkers t)
          (org-appear-autoentities t)
          )
 :hook (org-mode . org-appear-mode)
 )
;; show delimiters:2 ends here

;; [[file:config.org::*Use auto-tangle][Use auto-tangle:2]]
(use-package! org-auto-tangle
 :after org
 :config
 (setq org-auto-tangle-default t)      ;this doesn't work with :custom
 :hook (org-mode . org-auto-tangle-mode))
;; Use auto-tangle:2 ends here

;; [[file:config.org::*Images][Images:2]]
(after! org
 (setq org-download-method 'directory
       org-download-image-dir "org-images"
       org-download-heading-lvl nil
       org-download-timestamp "%Y%m%d-%H%M%S_"
       org-startup-with-inline-images t
       org-image-actual-width 300))
;; Images:2 ends here

;; Reformatting an Org buffer

;; (originally:
;; https://zzamboni.org/post/my-doom-emacs-configuration-with-commentary/ A
;; function that reformats the current buffer by regenerating the text from its
;; internal parsed representation. Quite amazing.)


;; [[file:config.org::*Reformatting an Org buffer][Reformatting an Org buffer:1]]
(after! org
 (defun vi/org-reformat-buffer ()
   (interactive)
   (when (y-or-n-p "Really format current buffer? ")
     (let ((document (org-element-interpret-data (org-element-parse-buffer))))
       (erase-buffer)
       (insert document)
       (goto-char (point-min))))))
;; Reformatting an Org buffer:1 ends here

;; misc

;; [[file:config.org::*misc][misc:1]]
(after! org
