.config/doom/packages.el

;; org-mode package

;; [[file:config.org::*org-mode package][org-mode package:1]]
;; Pinning for unfolding org-mode overlays while searching
;; https://github.com/doomemacs/doomemacs/issues/6478#issuecomment-1293505404
(package! org :pin "971eb6885ec996c923e955730df3bafbdc244e54")
;; (package! org :pin "6001313b8f8bc2c717b44070d6e7b19afc6125ec")
;; org-mode package:1 ends here

;; show delimiters


;; [[file:config.org::*show delimiters][show delimiters:1]]
(package! org-appear :recipe (:host github :repo "awth13/org-appear"))
;; show delimiters:1 ends here

;; Use auto-tangle

;; +Fails with /sudo tangle files https://github.com/yilkalargaw/org-auto-tangle/issues/9+

;; Fails with `:comments both` and certain modes:
;; https://github.com/yilkalargaw/org-auto-tangle/issues/11, but so does "Custom
;; async tangle" below.

;; The "After save hook" version is synchronous and has no problems.

;; +<2022-07-08 Fri> Pinned to c208036 to see if 'max-lisp-eval-depth' errors were caused by https://github.com/yilkalargaw/org-auto-tangle/commit/5b6071c5649ed648c97cd2deebf74fe633f7f0d0+

;; Also see https://tecosaur.github.io/emacs-config/config.html#asynchronous-config-tangling

;; We'd like to set a timeout and fall through to synchronous tangle?


;; [[file:config.org::*Use auto-tangle][Use auto-tangle:1]]
(package! org-auto-tangle :recipe (:host github :repo "yilkalargaw/org-auto-tangle"))
;; Use auto-tangle:1 ends here

;; Images



;; [[file:config.org::*Images][Images:1]]
(package! org-download)
;; Images:1 ends here
