.config/doom/config.org
***** misc
#+begin_src emacs-lisp
(after! org
 ;; http://emacs.stackexchange.com/a/10712/115
 (defun modi/org-delete-link ()
   "Replace an Org link of the format [[LINK][DESCRIPTION]] with DESCRIPTION.
If the link is of the format [[LINK]], delete the whole Org link.

In both the cases, save the LINK to the kill-ring.

Execute this command while the point is on or after the hyper-linked Org link."
   (interactive)
   (when (derived-mode-p 'org-mode)
     (let ((search-invisible t) start end)
       (save-excursion
         (when (re-search-backward "\\[\\[" nil :noerror)
           (when (re-search-forward "\\[\\[\\(.*?\\)\\(\\]\\[.*?\\)*\\]\\]"
                                    nil :noerror)
             (setq start (match-beginning 0))
             (setq end   (match-end 0))
             (kill-new (match-string-no-properties 1)) ;Save link to kill-ring
             (replace-regexp "\\[\\[.*?\\(\\]\\[\\(.*?\\)\\)*\\]\\]" "\\2"
                             nil start end)))))))

 (defun modi/lower-case-org-keywords ()
   "Lower case Org keywords and block identifiers.

Example: \"#+TITLE\" -> \"#+title\"
        \"#+BEGIN_EXAMPLE\" -> \"#+begin_example\"

Inspiration:
https://code.orgmode.org/bzg/org-mode/commit/13424336a6f30c50952d291e7a82906c1210daf0."
   (interactive)
   (save-excursion
     (goto-char (point-min))
     (let ((case-fold-search nil)
           (count 0))
       ;; Match examples: "#+FOO bar", "#+FOO:", "=#+FOO=", "~#+FOO~",
       ;;                 "‘#+FOO’", "“#+FOO”", ",#+FOO bar",
       ;;                 "#+FOO_bar<eol>", "#+FOO<eol>".
       (while (re-search-forward "\\(?1:#\\+[A-Z_]+\\(?:_[[:alpha:]]+\\)*\\)\\(?:[ :=~’”]\\|$\\)" nil :noerror)
         (setq count (1+ count))
         (replace-match (downcase (match-string-no-properties 1)) :fixedcase nil nil 1))
       (message "Lower-cased %d matches" count))))
)
#+end_src

***** Archive all done tasks
#+begin_src emacs-lisp
(after! org
 ;; https://stackoverflow.com/questions/6997387/how-to-archive-all-the-done-tasks-using-a-single-command
 (defun vi/org-archive-done-tasks ()
   (interactive)
   (org-map-entries
    (lambda ()
      (org-archive-subtree)
      (setq org-map-continue-from (org-element-property :begin (org-element-at-point))))
    "/DONE" 'tree))
)
#+end_src

***** COMMENT org-return-dwim
https://github.com/alphapapa/unpackaged.el#org-return-dwim

+Bound to "M-RET" in org-mode-map+ some weird error with org-at-heading-p

#+begin_src emacs-lisp
(after! org
 (defun unpackaged/org-element-descendant-of (type element)
   "Return non-nil if ELEMENT is a descendant of TYPE.
TYPE should be an element type, like `item' or `paragraph'.
ELEMENT should be a list like that returned by `org-element-context'."
   ;; MAYBE: Use `org-element-lineage'.
   (when-let* ((parent (org-element-property :parent element)))
     (or (eq type (car parent))
         (unpackaged/org-element-descendant-of type parent))))

 ;;;###autoload
 (defun unpackaged/org-return-dwim (&optional default)
   "A helpful replacement for `org-return'.  With prefix, call `org-return'.

On headings, move point to position after entry content.  In
lists, insert a new item or end the list, with checkbox if
appropriate.  In tables, insert a new row or end the table."
   ;; Inspired by John Kitchin: http://kitchingroup.cheme.cmu.edu/blog/2017/04/09/A-better-return-in-org-mode/
   (interactive "P")
   (if default
       (org-return)
     (cond
      ;; Act depending on context around point.

      ;; NOTE: I prefer RET to not follow links, but by uncommenting this block, links will be
      ;; followed.

      ;; ((eq 'link (car (org-element-context)))
      ;;  ;; Link: Open it.
      ;;  (org-open-at-point-global)
)
      ((org-at-heading-p)
       ;; Heading: Move to position after entry content.
       ;; NOTE: This is probably the most interesting feature of this function.
       (let ((heading-start (org-entry-beginning-position)))
         (goto-char (org-entry-end-position))
         (cond ((and (org-at-heading-p)
                     (= heading-start (org-entry-beginning-position)))
                ;; Entry ends on its heading; add newline after
                (end-of-line)
                (insert "\n\n"))
               (t
                ;; Entry ends after its heading; back up
                (forward-line -1)
                (end-of-line)
                (when (org-at-heading-p)
                  ;; At the same heading
                  (forward-line)
                  (insert "\n")
                  (forward-line -1))
                ;; FIXME: looking-back is supposed to be called with more arguments.
                (while (not (looking-back (rx (repeat 3 (seq (optional blank) "\n")))))
                  (insert "\n"))
                (forward-line -1)))))

      ((org-at-item-checkbox-p)
       ;; Checkbox: Insert new item with checkbox.
       (org-insert-todo-heading nil))

      ((org-in-item-p)
       ;; Plain list.  Yes, this gets a little complicated...
       (let ((context (org-element-context)))
         (if (or (eq 'plain-list (car context))  ; First item in list
                 (and (eq 'item (car context))
                      (not (eq (org-element-property :contents-begin context)
                               (org-element-property :contents-end context))))
                 (unpackaged/org-element-descendant-of 'item context))  ; Element in list item, e.g. a link
             ;; Non-empty item: Add new item.
             (org-insert-item)
           ;; Empty item: Close the list.
           ;; TODO: Do this with org functions rather than operating on the text. Can't seem to find the right function.
           (delete-region (line-beginning-position) (line-end-position))
           (insert "\n"))))

      ((when (fboundp 'org-inlinetask-in-task-p)
         (org-inlinetask-in-task-p))
       ;; Inline task: Don't insert a new heading.
       (org-return))

      ((org-at-table-p)
       (cond ((save-excursion
                (beginning-of-line)
                ;; See `org-table-next-field'.
                (cl-loop with end = (line-end-position)
                         for cell = (org-element-table-cell-parser)
                         always (equal (org-element-property :contents-begin cell)
                                       (org-element-property :contents-end cell))
                         while (re-search-forward "|" end t)))
              ;; Empty row: end the table.
              (delete-region (line-beginning-position) (line-end-position))
              (org-return))
             (t
              ;; Non-empty row: call `org-return'.
              (org-return))))
      (t
       ;; All other cases: call `org-return'.
       (org-return)))))
#+end_src


*** Import from various formats into org

#+begin_src emacs-lisp :tangle packages.el
(package! org-pandoc-import :recipe (:host github :repo "tecosaur/org-pandoc-import" :files ("*.el" "filters" "preprocessors")))
#+end_src

Needs ~brew install pandoc~

#+begin_src emacs-lisp
(use-package! org-pandoc-import :after org)
#+end_src

*** literate calc

#+begin_src emacs-lisp :tangle packages.el
(package! literate-calc-mode)
#+end_src

Let's use this with file-locals instead

#+begin_src emacs-lisp
;; (add-hook! org-mode #'literate-calc-minor-mode)

(after! calc
 ;; converts
 (defalias 'calcFunc-uconv 'math-convert-units)

 ;; usimplify() simplifies units, alias to U
 (defalias 'calcFunc-U 'calcFunc-usimplify)
)
#+end_src


***** COMMENT poly-literate-calc



#+begin_src emacs-lisp :tangle packages.el
(package! poly-literate-calc
 :recipe (:local-repo "lisp/poly-literate-calc" :build (:not compile)));; :host github :repo "indigoviolet/poly-literate-calc"))
#+end_src


#+begin_src emacs-lisp
(use-package! poly-literate-calc)
#+end_src


*** COMMENT super-agenda


#+begin_src emacs-lisp :tangle packages.el
(package! org-super-agenda)
#+end_src


#+begin_src emacs-lisp
(after! org
 (org-super-agenda-mode)
 )
#+end_src
*** sh-mode src blocks

sh-mode uses $SHELL by default: https://list.orgmode.org/87eeg0tz6t.fsf@gmail.com/T/

#+begin_src emacs-lisp
(after! org
 (defun org-babel-bash-mode ()
   (sh-mode)
   (sh-set-shell "bash"))

 (add-to-list 'org-src-lang-modes '("bash" . org-babel-bash))
 )
#+end_src

*** org babel chaining

https://xenodium.com/emacs-chaining-org-babel-blocks/

#+begin_src emacs-lisp
(defun adviced:org-babel-execute-src-block (&optional orig-fun arg info params)
 (let ((body (nth 1 info))
       (include (assoc :include (nth 2 info)))
       (named-blocks (org-element-map (org-element-parse-buffer)
                         'src-block (lambda (item)
                                      (when (org-element-property :name item)
                                        (cons (org-element-property :name item)
                                              item))))))
   (while include
     (unless (cdr include)
       (user-error ":include without value" (cdr include)))
     (unless (assoc (cdr include) named-blocks)
       (user-error "source block \"%s\" not found" (cdr include)))
     (setq body (concat (org-element-property :value (cdr (assoc (cdr include) named-blocks)))
                        body))
     (setf (nth 1 info) body)
     (setq include (assoc :include
                          (org-babel-parse-header-arguments
                           (org-element-property :parameters (cdr (assoc (cdr include) named-blocks)))))))
   (funcall orig-fun arg info params)))

(advice-add 'org-babel-execute-src-block :around 'adviced:org-babel-execute-src-block)
#+end_src

#+results[b30c1b41ccddc21305a1d13530fcaa6911029689]:

*** table of contents

#+begin_src emacs-lisp :tangle packages.el
(package! org-make-toc)
#+end_src

***** COMMENT minor mode

disabled because it is noisy on startup, and used rarely (<2022-03-21 Mon>)
#+begin_src emacs-lisp
(after! org
 (add-hook! org-mode #'org-make-toc-mode))
#+end_src

