.config/doom/config.el
 ;; http://emacs.stackexchange.com/a/10712/115
 (defun modi/org-delete-link ()
   "Replace an Org link of the format [[LINK][DESCRIPTION]] with DESCRIPTION.
If the link is of the format [[LINK]], delete the whole Org link.

In both the cases, save the LINK to the kill-ring.

Execute this command while the point is on or after the hyper-linked Org link."
   (interactive)
   (when (derived-mode-p 'org-mode)
     (let ((search-invisible t) start end)
       (save-excursion
         (when (re-search-backward "\\[\\[" nil :noerror)
           (when (re-search-forward "\\[\\[\\(.*?\\)\\(\\]\\[.*?\\)*\\]\\]"
                                    nil :noerror)
             (setq start (match-beginning 0))
             (setq end   (match-end 0))
             (kill-new (match-string-no-properties 1)) ;Save link to kill-ring
             (replace-regexp "\\[\\[.*?\\(\\]\\[\\(.*?\\)\\)*\\]\\]" "\\2"
                             nil start end)))))))

 (defun modi/lower-case-org-keywords ()
   "Lower case Org keywords and block identifiers.

Example: \"#+TITLE\" -> \"#+title\"
        \"#+BEGIN_EXAMPLE\" -> \"#+begin_example\"

Inspiration:
https://code.orgmode.org/bzg/org-mode/commit/13424336a6f30c50952d291e7a82906c1210daf0."
   (interactive)
   (save-excursion
     (goto-char (point-min))
     (let ((case-fold-search nil)
           (count 0))
       ;; Match examples: "#+FOO bar", "#+FOO:", "=#+FOO=", "~#+FOO~",
       ;;                 "‘#+FOO’", "“#+FOO”", ",#+FOO bar",
       ;;                 "#+FOO_bar<eol>", "#+FOO<eol>".
       (while (re-search-forward "\\(?1:#\\+[A-Z_]+\\(?:_[[:alpha:]]+\\)*\\)\\(?:[ :=~’”]\\|$\\)" nil :noerror)
         (setq count (1+ count))
         (replace-match (downcase (match-string-no-properties 1)) :fixedcase nil nil 1))
       (message "Lower-cased %d matches" count))))
)
;; misc:1 ends here

;; Archive all done tasks

;; [[file:config.org::*Archive all done tasks][Archive all done tasks:1]]
(after! org
 ;; https://stackoverflow.com/questions/6997387/how-to-archive-all-the-done-tasks-using-a-single-command
 (defun vi/org-archive-done-tasks ()
   (interactive)
   (org-map-entries
    (lambda ()
      (org-archive-subtree)
      (setq org-map-continue-from (org-element-property :begin (org-element-at-point))))
    "/DONE" 'tree))
)
;; Archive all done tasks:1 ends here



;; Needs ~brew install pandoc~


;; [[file:config.org::*Import from various formats into org][Import from various formats into org:2]]
(use-package! org-pandoc-import :after org)
;; Import from various formats into org:2 ends here



;; Let's use this with file-locals instead


;; [[file:config.org::*literate calc][literate calc:2]]
;; (add-hook! org-mode #'literate-calc-minor-mode)

(after! calc
 ;; converts
 (defalias 'calcFunc-uconv 'math-convert-units)

 ;; usimplify() simplifies units, alias to U
 (defalias 'calcFunc-U 'calcFunc-usimplify)
)
;; literate calc:2 ends here

;; sh-mode src blocks

;; sh-mode uses $SHELL by default: https://list.orgmode.org/87eeg0tz6t.fsf@gmail.com/T/


;; [[file:config.org::*sh-mode src blocks][sh-mode src blocks:1]]
(after! org
 (defun org-babel-bash-mode ()
   (sh-mode)
   (sh-set-shell "bash"))

 (add-to-list 'org-src-lang-modes '("bash" . org-babel-bash))
 )
;; sh-mode src blocks:1 ends here

;; org babel chaining

;; https://xenodium.com/emacs-chaining-org-babel-blocks/


;; [[file:config.org::*org babel chaining][org babel chaining:1]]
(defun adviced:org-babel-execute-src-block (&optional orig-fun arg info params)
 (let ((body (nth 1 info))
       (include (assoc :include (nth 2 info)))
       (named-blocks (org-element-map (org-element-parse-buffer)
                         'src-block (lambda (item)
                                      (when (org-element-property :name item)
                                        (cons (org-element-property :name item)
                                              item))))))
   (while include
     (unless (cdr include)
       (user-error ":include without value" (cdr include)))
     (unless (assoc (cdr include) named-blocks)
       (user-error "source block \"%s\" not found" (cdr include)))
     (setq body (concat (org-element-property :value (cdr (assoc (cdr include) named-blocks)))
                        body))
     (setf (nth 1 info) body)
     (setq include (assoc :include
                          (org-babel-parse-header-arguments
                           (org-element-property :parameters (cdr (assoc (cdr include) named-blocks)))))))
   (funcall orig-fun arg info params)))

(advice-add 'org-babel-execute-src-block :around 'adviced:org-babel-execute-src-block)
;; org babel chaining:1 ends here

;; calendar


;; [[file:config.org::*calendar][calendar:1]]
(after! org
