.config/doom/packages.el

;; Import from various formats into org


;; [[file:config.org::*Import from various formats into org][Import from various formats into org:1]]
(package! org-pandoc-import :recipe (:host github :repo "tecosaur/org-pandoc-import" :files ("*.el" "filters" "preprocessors")))
;; Import from various formats into org:1 ends here

;; literate calc


;; [[file:config.org::*literate calc][literate calc:1]]
(package! literate-calc-mode)
;; literate calc:1 ends here

;; table of contents


;; [[file:config.org::*table of contents][table of contents:1]]
(package! org-make-toc)
;; table of contents:1 ends here

;; consult-org-roam
;; :PROPERTIES:
