.config/doom/config.org
*** calendar

#+begin_src emacs-lisp
(after! org
  (defmacro vi/org-in-calendar (command)
    (let ((name (intern (format "vi/org-in-calendar-%s" command))))
      `(progn
         (defun ,name ()
           (interactive)
           (org-eval-in-calendar ,command))
         #',name)))

  (map! :map org-read-date-minibuffer-local-map
        "<right>" (vi/org-in-calendar '(calendar-forward-day 1))
        "<left>" (vi/org-in-calendar '(calendar-backward-day 1))
        ">" (vi/org-in-calendar '(calendar-forward-month 1))
        "<" (vi/org-in-calendar '(calendar-backward-month 1))
        "." (vi/org-in-calendar '(calendar-goto-today)))
)
#+end_src
*** Org Roam


- <2022-09-09 Fri> If we set org-roam-directory to ~org-directory~, syncing is
  much faster; but we can't convert things outside of that directory into Nodes

  by doing org-id-get-create. Let's see if this is a problem

- <2022-09-11 Sun> Yes it is a problem: startup is very slow and lots of direnv
  shit, dir-locals gets executed. We might have to use org-roam-refile

#+begin_src emacs-lisp
(use-package! org-roam
  :custom
 ;; (org-roam-directory (getenv "HOME"))
 (org-roam-directory org-directory)
 (org-roam-db-node-include-function (lambda () (not (member "ATTACH" (org-get-tags)))))
 :config
 (org-roam-db-autosync-mode)
 (require 'org-protocol)
 )

(setq! org-roam-directory org-directory)
#+end_src

**** consult-org-roam
:PROPERTIES:
:CREATED:  [2023-08-09 Wed 13:21]
:END:

#+begin_src emacs-lisp :tangle packages.el
(package! consult-org-roam :recipe (:host github :repo "jgru/consult-org-roam"))
#+end_src


#+begin_src emacs-lisp
(use-package! consult-org-roam
   :after org-roam
   :init
   ;; Activate the minor mode
   (consult-org-roam-mode 1)
   :custom
   ;; Use `ripgrep' for searching with `consult-org-roam-search'
   (consult-org-roam-grep-func #'consult-ripgrep)
   ;; Configure a custom narrow key for `consult-buffer'
   (consult-org-roam-buffer-narrow-key ?r)
   ;; Display org-roam buffers right after non-org-roam buffers
   ;; in consult-buffer (and not down at the bottom)
   (consult-org-roam-buffer-after-buffers t)
   :config
  (setq org-roam-node-display-template
    (concat "${title:80} " (propertize "${tags:20}" 'face 'org-tag))
    org-roam-node-annotation-function
    (lambda (node) (marginalia--time (org-roam-node-file-mtime node))))

   ;; Eventually suppress previewing for certain functions
   (consult-customize
    consult-org-roam-forward-links
    :preview-key (kbd "M-.")))
   ;; :bind
   ;; ;; Define some convenient keybindings as an addition
   ;; ("C-c n e" . consult-org-roam-file-find)
   ;; ("C-c n b" . consult-org-roam-backlinks)
   ;; ("C-c n l" . consult-org-roam-forward-links)
   ;; ("C-c n r" . consult-org-roam-search))

#+end_src


**** COMMENT consult-notes



Alternative: https://github.com/jgru/consult-org-roam

#+begin_src emacs-lisp :tangle packages.el
(package! consult-notes :recipe (:host github :repo "mclear-tools/consult-notes"))
#+end_src


#+begin_src emacs-lisp
(use-package! consult-notes
  :commands (consult-notes consult-notes-search-in-all-notes consult-notes-org-roam-find-node consult-notes-org-roam-find-node-relation)
  :config
  (consult-notes-org-roam-mode)
  )
#+end_src

*** COMMENT org-modern-indent

very slow

#+begin_src emacs-lisp :tangle packages.el
(package! org-modern-indent :recipe (:host github :repo "jdtsmith/org-modern-indent"))
#+end_src


#+begin_src emacs-lisp
(add-hook! 'org-mode-hook #'org-modern-indent-mode)
#+end_src
*** COMMENT org-modern

checkboxes are tiny, and they can be fixed by adjusting faces but this just doesn't do much for me

#+begin_src emacs-lisp :tangle packages.el
(package! org-modern)
#+end_src


#+begin_src emacs-lisp
(use-package! org-modern
  :after org
  :custom
  (org-modern-hide-stars nil)           ;adds extra indentation
  :hook (org-mode . global-org-modern-mode))
#+end_src

*** fill paragraph


#+begin_src emacs-lisp
(defun org-back-to-item ()
  (re-search-backward "^ *[-+*]\\|^ *[1-9]+[)\.] " nil nil 1))

(defun org-fill-paragraph-handle-lists (&optional num-paragraphs)
  (interactive "p")
  (save-excursion
    (let ((bound (if mark-active
                     (- (region-end) 2)
                   (progn
                     (org-back-to-item)
                     (while (>= num-paragraphs 0)
                       (call-interactively 'org-mark-element)
                       (setq num-paragraphs (1- num-paragraphs)))
                     (- (region-end) 2)))))
      (while (search-forward "\n" bound t)
        (replace-match " ")))
    (org-fill-paragraph)))

(map! :mode org-mode "C-M-q" #'org-fill-paragraph-handle-lists)
#+end_src

*** colored-text

#+begin_src emacs-lisp :tangle packages.el
(package! org-colored-text :recipe (:host github :repo "indigoviolet/org-colored-text"))
#+end_src

#+begin_src emacs-lisp
(use-package! org-colored-text :after org) ;; :load-path "/home/venky/dev/org-colored-text/")
#+end_src

[[color:green][this text is green]]

*** Export

**** No htmlentities in quotes
#+begin_src emacs-lisp
(after! org
  (setq org-export-with-smart-quotes nil)
  )
#+end_src
**** Github flavored Markdown


#+begin_src emacs-lisp :tangle packages.el
(package! ox-gfm)
#+end_src



* COMMENT emacs-jupyter
** fontification

https://github.com/nnicandro/emacs-jupyter/issues/366#issuecomment-985758277

#+begin_src emacs-lisp
(after! org
  (defun display-ansi-colors ()
    (ansi-color-apply-on-region (point-min) (point-max)))

  (add-hook! org-babel-after-execute #'display-ansi-colors)
  )
#+end_src

** COMMENT envrc interaction

https://github.com/nnicandro/emacs-jupyter/issues/387

doesn't work


#+begin_src emacs-lisp
(after! org
  (add-hook! org-mode
    (defun fix-with-temp-buffer ()
      (inheritenv-add-advice #'with-temp-buffer)
      )
    ))
#+end_src
