.config/doom/config.el
  (defmacro vi/org-in-calendar (command)
    (let ((name (intern (format "vi/org-in-calendar-%s" command))))
      `(progn
         (defun ,name ()
           (interactive)
           (org-eval-in-calendar ,command))
         #',name)))

  (map! :map org-read-date-minibuffer-local-map
        "<right>" (vi/org-in-calendar '(calendar-forward-day 1))
        "<left>" (vi/org-in-calendar '(calendar-backward-day 1))
        ">" (vi/org-in-calendar '(calendar-forward-month 1))
        "<" (vi/org-in-calendar '(calendar-backward-month 1))
        "." (vi/org-in-calendar '(calendar-goto-today)))
)
;; calendar:1 ends here

;; Org Roam


;; - <2022-09-09 Fri> If we set org-roam-directory to ~org-directory~, syncing is
;;   much faster; but we can't convert things outside of that directory into Nodes

;;   by doing org-id-get-create. Let's see if this is a problem

;; - <2022-09-11 Sun> Yes it is a problem: startup is very slow and lots of direnv
;;   shit, dir-locals gets executed. We might have to use org-roam-refile


;; [[file:config.org::*Org Roam][Org Roam:1]]
(use-package! org-roam
  :custom
 ;; (org-roam-directory (getenv "HOME"))
 (org-roam-directory org-directory)
 (org-roam-db-node-include-function (lambda () (not (member "ATTACH" (org-get-tags)))))
 :config
 (org-roam-db-autosync-mode)
 (require 'org-protocol)
 )
;; Org Roam:1 ends here

;; [[file:config.org::*consult-org-roam][consult-org-roam:2]]
(use-package! consult-org-roam
   :after org-roam
   :init
   ;; Activate the minor mode
   (consult-org-roam-mode 1)
   :custom
   ;; Use `ripgrep' for searching with `consult-org-roam-search'
   (consult-org-roam-grep-func #'consult-ripgrep)
   ;; Configure a custom narrow key for `consult-buffer'
   (consult-org-roam-buffer-narrow-key ?r)
   ;; Display org-roam buffers right after non-org-roam buffers
   ;; in consult-buffer (and not down at the bottom)
   (consult-org-roam-buffer-after-buffers t)
   :config
  (setq org-roam-node-display-template
    (concat "${title:80} " (propertize "${tags:20}" 'face 'org-tag))
    org-roam-node-annotation-function
    (lambda (node) (marginalia--time (org-roam-node-file-mtime node))))

   ;; Eventually suppress previewing for certain functions
   (consult-customize
    consult-org-roam-forward-links
    :preview-key (kbd "M-.")))
   ;; :bind
   ;; ;; Define some convenient keybindings as an addition
   ;; ("C-c n e" . consult-org-roam-file-find)
   ;; ("C-c n b" . consult-org-roam-backlinks)
   ;; ("C-c n l" . consult-org-roam-forward-links)
   ;; ("C-c n r" . consult-org-roam-search))
;; consult-org-roam:2 ends here

;; fill paragraph



;; [[file:config.org::*fill paragraph][fill paragraph:1]]
(defun org-back-to-item ()
  (re-search-backward "^ *[-+*]\\|^ *[1-9]+[)\.] " nil nil 1))

(defun org-fill-paragraph-handle-lists (&optional num-paragraphs)
  (interactive "p")
  (save-excursion
    (let ((bound (if mark-active
                     (- (region-end) 2)
                   (progn
                     (org-back-to-item)
                     (while (>= num-paragraphs 0)
                       (call-interactively 'org-mark-element)
                       (setq num-paragraphs (1- num-paragraphs)))
                     (- (region-end) 2)))))
      (while (search-forward "\n" bound t)
        (replace-match " ")))
    (org-fill-paragraph)))

(map! :mode org-mode "C-M-q" #'org-fill-paragraph-handle-lists)
;; fill paragraph:1 ends here

;; [[file:config.org::*colored-text][colored-text:2]]
(use-package! org-colored-text :after org) ;; :load-path "/home/venky/dev/org-colored-text/")
;; colored-text:2 ends here

;; No htmlentities in quotes

;; [[file:config.org::*No htmlentities in quotes][No htmlentities in quotes:1]]
(after! org
  (setq org-export-with-smart-quotes nil)
  )
;; No htmlentities in quotes:1 ends here
