.config/doom/packages.el
;; :CREATED:  [2023-08-09 Wed 13:21]
;; :END:


;; [[file:config.org::*consult-org-roam][consult-org-roam:1]]
(package! consult-org-roam :recipe (:host github :repo "jgru/consult-org-roam"))
;; consult-org-roam:1 ends here

;; colored-text


;; [[file:config.org::*colored-text][colored-text:1]]
(package! org-colored-text :recipe (:host github :repo "indigoviolet/org-colored-text"))
;; colored-text:1 ends here

;; Github flavored Markdown



;; [[file:config.org::*Github flavored Markdown][Github flavored Markdown:1]]
(package! ox-gfm)
;; Github flavored Markdown:1 ends here

;; vterm


;; [[file:config.org::*vterm][vterm:1]]
(unpin! vterm)
;; vterm:1 ends here
