.config/doom/config.org
* COMMENT ein

#+begin_src emacs-lisp :tangle packages.el
;; (package! ein :pin "6063cee")           ;dec 25 2021 - previous working version
(package! ein :pin "87f4448")           ;apr 26 2023
#+end_src

#+begin_src emacs-lisp

(use-package! ein
  :commands (ein:notebooklist-open ein:notebooklist-login)
  :init
  (setq ein:polymode t)
  (setq ein:notebooklist-render-order '(render-opened-notebooks render-directory render-header))
  (setq ein:truncate-long-cell-output 1000)
  (setq ein:cell-max-num-outputs 1000)
  (setq ein:worksheet-enable-undo t)
  (setq ein:markdown-header-scaling nil)    ;this leads to variable pitch faces for
                                        ;markdown headers, which doesn't work so
                                        ;well with fontlocking (and outline-minor-faces-mode)
  (setq ein:output-area-inlined-images t)
  (setq ein:url-or-port '("http://localhost:8888"))
  (setq ein:jupyter-server-command "~/.local/bin/jupyter")
  ;; https://stackoverflow.com/a/67804732/14044156
  (setq ein:jupyter-server-use-subcommand "server")
  (setq ein:jupyter-server-args '("--no-browser" "--port=8889"))
  ;; https://github.com/millejoh/emacs-ipython-notebook/issues/423#issuecomment-458254069
  (setq ein:query-timeout nil)
  :config

  (custom-set-faces!
    '(ein:cell-output-area :background "MidnightBlue" :extend t)
    '(ein:cell-output-area-error :background "OrangeRed4" :extend t)
    '(ein:codecell-input-area-face :background "#23272e" :extend t)
    '(ein:codecell-input-prompt-face :foreground "black" :background "cyan" :extend t)
    ;; '(ein:markdowncell-input-prompt-face :foreground "LightPink" :background "black" :extend t)
    '(ein:markdowncell-input-prompt-face :foreground nil :background nil :extend t)
    '(ein:markdowncell-input-area-face :background nil :extend t)
    '(ein:markdown-header-face-1 :inherit nil)
    '(ein:markdown-header-face-2 :inherit nil)
    '(ein:markdown-header-face-3 :inherit nil)
    '(ein:markdown-header-face-4 :inherit nil)
    '(ein:markdown-header-face-5 :inherit nil)
    '(ein:markdown-header-face-6 :inherit nil)
    ;; '(ein:markdown-header-face :foreground "snow" :weight bold)
    ;; '(ein:markdown-header-face :foreground nil :weight normal)
    )

  (defun vi/ein-toggle-inlined-images ()
    (interactive)
    (setq ein:output-area-inlined-images (if ein:output-area-inlined-images nil t))
    )

  (defun vi/restart-and-execute-all-above ()
    (interactive)
    ;; This is required for lexical-let
    (eval-when-compile (require 'cl))
    (aif (ein:get-notebook)
      (lexical-let ((ws (ein:worksheet--get-ws-or-error)))
        (ein:kernel-delete-session
          (lambda (kernel)
            (ein:events-trigger (ein:$kernel-events kernel) 'status_restarting.Kernel)
            (ein:kernel-retrieve-session kernel 0
              (lambda (kernel)
                (ein:events-trigger (ein:$kernel-events kernel) 'status_restarted.Kernel)
                (ein:worksheet-execute-all-cells-above ws))))
          :kernel (ein:$notebook-kernel it)))
      (message "Not in notebook buffer!"))
    )

  (defun vi/ein:select-cell-text (cell)
    (interactive (list (ein:worksheet-get-current-cell)))
    (let* ((beg (ein:cell-input-pos-min cell))
            (end (ein:cell-input-pos-max cell)))
      (set-mark (goto-char beg))
      (goto-char end))
    )

  (defun vi/revert-notebook ()
    (interactive)
    (aif (ein:get-notebook)
      (let ((nurl (ein:$notebook-url-or-port it))
             (npath (ein:$notebook-notebook-path it)))
        ;; fix disabled undo
        (setq! ein:worksheet-enable-undo t)
        (ein:notebook-close it)
        ;; Reopen, but put it in the same window we were in
        (ein:notebook-open nurl npath nil
          (lambda (nb _)
            (switch-to-buffer (ein:notebook-buffer nb))))
        )))
  )
#+end_src

#+begin_src emacs-lisp
;; ein-hydra
(pretty-hydra-define ein-global-hydra (:exit t :quit-key ("q" "C-g"))
  ("Connect"
    (("b" ein:notebooklist-open "Notebook list")
      ("l" ein:notebooklist-login "Login")
      ("s" ein:jupyter-server-start "Start")
      ("t" ein:jupyter-server-stop "Stop")
      ("C" ein:byte-compile-ein "Byte-compile")
      ))
  )

(major-mode-hydra-define (ein:notebook-mode ein:shared-output-mode) (:quit-key ("q" "C-g") :exit t :foreign-keys run)
  (
    "Reconnect"
    (("r" ein:notebook-reconnect-session-command "Reconnect")
      ("R" ein:notebook-restart-session-command "Restart")
      ("z" ein:notebook-kernel-interrupt-command "interrupt")
      ("v" vi/revert-notebook "Revert")
      ("K" ein:notebook-switch-kernel "Switch Kernel"))
    "Exec"
    (
      ("x" ein:worksheet-execute-all-cells-above "Execute all above")
      ("X" vi/restart-and-execute-all-above "Restart & x")
      )
    "Nav"
    (
      ("p" ein:worksheet-goto-prev-input-km "Prev Cell" :exit nil)
      ("n" ein:worksheet-goto-next-input-km "Next Cell" :exit nil)
      ("SPC" vi/ein:select-cell-text "Select cell")
      ("/" ein:notebook-scratchsheet-open-km "Scratch")
      )
    "Output"
    (
      ("o" ein:worksheet-toggle-output "Toggle output")
      ("O" ein:shared-output-show-code-cell-at-point "Show in shared output")
      ("M-o" (ein:worksheet-set-output-visibility-all (ein:worksheet--get-ws-or-error) t) "Hide all output")
      ("M-O" ein:worksheet-set-output-visibility-all "Show all output")
      )
    "Fix"
    (("i" vi/ein-toggle-inlined-images "Toggle inlined images")
      ;; ("M-f" vi/ein-fix "Fix")
      ("N" ein:notebook-rename-command "Rename")
      )
    "Python"
    (
      ("f" python-black-partial-dwim "Format")
      )
    ))
#+end_src

#+begin_src emacs-lisp
;; (setq scroll-preserve-screen-position t
;;       scroll-conservatively 0
;;       maximum-scroll-margin 0.5
;;       scroll-margin 99999)

;; (defun vi/ein-fix ()
;;   (interactive)
;;   ;; (set-face-extend 'ein:cell-input-area t)
;;   (setq ein:worksheet-enable-undo t)
;;   (buffer-enable-undo)
;;   ;; (turn-on-undo-tree-mode)
;;   )



(setq-hook! 'ein:notebook-mode-hook
  outline-minor-mode-use-buttons t
  outline-regexp "##+"
  )           ;capture markdown headings, excluding level 1 for comments

(add-hook! 'ein:notebook-mode-hook
  #'rainbow-delimiters-mode-disable

  ;; These fail on first load in this hook, but seem to work in poly-ein-mode-hook?

  ;; (outline-minor-faces-mode t)
  ;; (outline-minor-mode t)
  )

(add-hook! 'poly-ein-mode-hook
  ;;(outline-minor-faces-mode t)
  (outline-minor-mode t))               ;we disable outline-minor-mode in prog-mode, but turn it on in ein

;; Unsets M-n in ein polymode (which is normally bound to polymode-map) so that
;; we can use our smartscan-mode bindings
(map! :mode poly-ein-mode
  :map polymode-mode-map
  "M-n" nil)

(map! :map ein:notebook-mode-map
  "C-n" #'ein:worksheet-goto-next-input-km
  "C-p" #'ein:worksheet-goto-prev-input-km
  )


;; (advice-add 'json-parse-buffer :around
;;             (lambda (orig &rest rest)
;;               (while (re-search-forward "\\u0000" nil t)
;;                 (replace-match ""))
;;               (apply orig rest)))
#+end_src



* vterm

#+begin_src emacs-lisp :tangle packages.el
(unpin! vterm)
#+end_src


#+begin_src emacs-lisp

(setq vterm-module-cmake-args "-DUSE_SYSTEM_LIBVTERM=no")
(use-package! vterm
  :custom
  (vterm-max-scrollback 100000)
  (vterm-buffer-name-string "vterm %s")
  (vterm-enable-manipulate-selection-data-by-osc52 t)
  :bind
  (
    :map vterm-mode-map
    ("M-j" . nil)
    ("M-k" . nil)
    ("M-9" . nil)
    ("M-0" . nil)
    ("M-:" . nil)
    ("S-<left>" . nil)
    ("S-<right>" . nil)
    ("S-<up>" . nil)
    ("S-<down>" . nil)
    ("C-9" . nil)
    ("C-0" . nil)
    ("C-\\" . vterm-send-next-key)
    )
  :config

  (doom-modeline-def-segment vterm-copy-mode
    "Returns 'Copy' when vterm-copy-mode is active"
    (when
      (and (eq major-mode 'vterm-mode) vterm-copy-mode)
      (concat (doom-modeline-spc) "[Copy]")))


  (doom-modeline-def-modeline 'vi/vterm
    '(bar buffer-info-simple vterm-copy-mode selection-info remote-host)
    '(minor-modes major-mode))

  (remove-hook 'vterm-mode-hook #'hide-mode-line-mode)

  ;; This actually doesn't work with popper because it restores it to the old format
  (add-hook! 'vterm-mode-hook (doom-modeline-set-modeline 'vi/vterm)
    ;; (centered-cursor-mode -1)
    ))

;; (defun vi/vterm-copy ()
;; ;; shows in the misc-info segment
;; (add-to-list 'global-mode-string '(:eval (vi/vterm-copy)))

(defun vi/vterm-reset ()
  (interactive)
  (vterm-send-string "tput cnorm"))

(map! :map vterm-mode-map "C-c C-r" #'vi/vterm-reset)

(defun vi/vterm-hooks ()
  ;; linkify urls
  ;; (goto-address-mode)
  ;; Don't highlight trailing whitespace
  (whitespace-mode -1)
  ;; https://www.gnu.org/software/emacs/manual/html_node/elisp/Query-Before-Exit.html
  (set-process-query-on-exit-flag (get-buffer-process (current-buffer)) nil)
  )
(add-hook! 'vterm-mode-hook #'vi/vterm-hooks)



#+end_src

** Toggle or create

*** Home grown

#+begin_src emacs-lisp
(setq! vterm-shell "tmux")


(defsubst vi/vterm-dir ()
  ;; TODO: if this is TRAMP, don't return default-directory
  (or (projectile-project-root) default-directory))

(defsubst vi/create-vterm-in-dir (dir)
  (let ((default-directory dir))
    (setq vterm-buf (vterm 't))
    (with-current-buffer vterm-buf
      (setq-local vi/vterm--created-with-dir default-directory))))

(defsubst vi/existing-vterms-created-with (dir)
  (seq-filter
   (lambda (elt)
     (and
      (eq (buffer-local-value 'major-mode elt) #'vterm-mode)
      (buffer-local-boundp 'vi/vterm--created-with-dir elt)
      (file-equal-p dir (buffer-local-value 'vi/vterm--created-with-dir elt))))
   (buffer-list)))

(defun vi/vterm-project-or-here (&optional force-create)
  (interactive)
  (if-let* ((dir (vi/vterm-dir))
            (check-existing (not force-create))
            (existing-vterm (seq-first (vi/existing-vterms-created-with dir))))
      (pop-to-buffer existing-vterm)
    (vi/create-vterm-in-dir dir)))

;; handle opening in tramp
(defun vi/vterm-local (&optional force-create)
  (interactive)
  (if (and (fboundp 'tramp-tramp-file-p) (tramp-tramp-file-p default-directory))
      (progn
        (message "Tramp dir: opening local vterm")
        (let ((default-directory (getenv "HOME")))
          (vterm)))
    (vi/vterm-project-or-here force-create)))

;; (defun vi/vterm-zsh (&optional force-create)
;;   (interactive)
;;   (let ((vterm-shell "zsh"))
;;     (vi/vterm-local force-create)))

#+end_src
*** COMMENT multi-vterm

- <2022-07-10 Sun> +Using +vterm/here, +vterm/toggle instead+ -- this doesn't
  quite work as expected to toggle for a project -- depends on the buffer name
  (vterm-buffer-name-string) being default, and we like to track the directory (https://github.com/doomemacs/doomemacs/issues/6651)

- actually, multi-vterm-project has the same problem^ : https://github.com/suonlight/multi-vterm/issues/22

  See [[*Home grown][Home grown]] for a custom implementation

does this matter - https://github.com/suonlight/multi-vterm/issues/12 - projectile vs project

#+begin_src emacs-lisp :tangle packages.el
(package! multi-vterm :recipe (:host github :repo "suonlight/multi-vterm"))
;; (package! vterm-toggle :recipe (:host github :repo "jixiuf/vterm-toggle"))
#+end_src

#+begin_src emacs-lisp

(use-package! multi-vterm
  :custom
  (multi-vterm-buffer-name "%s")
  :commands (multi-vterm-next multi-vterm multi-vterm-project))
#+end_src

*** COMMENT vterm-toggle

#+begin_src emacs-lisp :tangle packages.el
(package! vterm-toggle :recipe (:host github :repo "jixiuf/vterm-toggle"))
#+end_src

