.config/doom/config.el

;; [[file:config.org::*vterm][vterm:2]]
(setq vterm-module-cmake-args "-DUSE_SYSTEM_LIBVTERM=no")
(use-package! vterm
  :custom
  (vterm-max-scrollback 100000)
  (vterm-buffer-name-string "vterm %s")
  (vterm-enable-manipulate-selection-data-by-osc52 t)
  :bind
  (
    :map vterm-mode-map
    ("M-j" . nil)
    ("M-k" . nil)
    ("M-9" . nil)
    ("M-0" . nil)
    ("M-:" . nil)
    ("S-<left>" . nil)
    ("S-<right>" . nil)
    ("S-<up>" . nil)
    ("S-<down>" . nil)
    ("C-9" . nil)
    ("C-0" . nil)
    ("C-\\" . vterm-send-next-key)
    )
  :config

  (doom-modeline-def-segment vterm-copy-mode
    "Returns 'Copy' when vterm-copy-mode is active"
    (when
      (and (eq major-mode 'vterm-mode) vterm-copy-mode)
      (concat (doom-modeline-spc) "[Copy]")))


  (doom-modeline-def-modeline 'vi/vterm
    '(bar buffer-info-simple vterm-copy-mode selection-info remote-host)
    '(minor-modes major-mode))

  (remove-hook 'vterm-mode-hook #'hide-mode-line-mode)

  ;; This actually doesn't work with popper because it restores it to the old format
  (add-hook! 'vterm-mode-hook (doom-modeline-set-modeline 'vi/vterm)
    ;; (centered-cursor-mode -1)
    ))

;; (defun vi/vterm-copy ()
;; ;; shows in the misc-info segment
;; (add-to-list 'global-mode-string '(:eval (vi/vterm-copy)))

(defun vi/vterm-reset ()
  (interactive)
  (vterm-send-string "tput cnorm"))

(map! :map vterm-mode-map "C-c C-r" #'vi/vterm-reset)

(defun vi/vterm-hooks ()
  ;; linkify urls
  ;; (goto-address-mode)
  ;; Don't highlight trailing whitespace
  (whitespace-mode -1)
  ;; https://www.gnu.org/software/emacs/manual/html_node/elisp/Query-Before-Exit.html
  (set-process-query-on-exit-flag (get-buffer-process (current-buffer)) nil)
  )
(add-hook! 'vterm-mode-hook #'vi/vterm-hooks)
;; vterm:2 ends here

;; Home grown


;; [[file:config.org::*Home grown][Home grown:1]]
(setq! vterm-shell "tmux")


(defsubst vi/vterm-dir ()
  ;; TODO: if this is TRAMP, don't return default-directory
  (or (projectile-project-root) default-directory))

(defsubst vi/create-vterm-in-dir (dir)
  (let ((default-directory dir))
    (setq vterm-buf (vterm 't))
    (with-current-buffer vterm-buf
      (setq-local vi/vterm--created-with-dir default-directory))))

(defsubst vi/existing-vterms-created-with (dir)
  (seq-filter
   (lambda (elt)
     (and
      (eq (buffer-local-value 'major-mode elt) #'vterm-mode)
      (buffer-local-boundp 'vi/vterm--created-with-dir elt)
      (file-equal-p dir (buffer-local-value 'vi/vterm--created-with-dir elt))))
   (buffer-list)))

(defun vi/vterm-project-or-here (&optional force-create)
  (interactive)
  (if-let* ((dir (vi/vterm-dir))
            (check-existing (not force-create))
            (existing-vterm (seq-first (vi/existing-vterms-created-with dir))))
      (pop-to-buffer existing-vterm)
    (vi/create-vterm-in-dir dir)))

;; handle opening in tramp
(defun vi/vterm-local (&optional force-create)
  (interactive)
  (if (and (fboundp 'tramp-tramp-file-p) (tramp-tramp-file-p default-directory))
      (progn
        (message "Tramp dir: opening local vterm")
        (let ((default-directory (getenv "HOME")))
          (vterm)))
    (vi/vterm-project-or-here force-create)))

;; (defun vi/vterm-zsh (&optional force-create)
;;   (interactive)
;;   (let ((vterm-shell "zsh"))
;;     (vi/vterm-local force-create)))
;; Home grown:1 ends here

;; Flycheck
