.config/doom/config.el


;; [[file:config.org::*Flycheck][Flycheck:1]]
(use-package! flycheck
  :after-call doom-first-file-hook
  :custom
  (flycheck-check-syntax-automatically '(mode-enabled save idle-change idle-buffer-switch))
  (flycheck-idle-change-delay 10)
  (flycheck-idle-buffer-switch-delay 5)
  (flycheck-highlighting-style '(conditional 10 level-face (delimiters "" "")))
  (flycheck-global-modes '(prog-mode))
  :config
  ;; Show indicators in the left margin
  (setq flycheck-indication-mode 'left-margin)

  ;; Adjust margins and fringe widths…
  (defun my/set-flycheck-margins ()
    (setq left-fringe-width 8 right-fringe-width 8
      left-margin-width 1 right-margin-width 0)
    (flycheck-refresh-fringes-and-margins))

  ;; …every time Flycheck is activated in a new buffer
  (add-hook! 'flycheck-mode-hook #'my/set-flycheck-margins)
  (global-flycheck-mode -1)
  :hook ((prog-mode . flycheck-mode))
  :pretty-hydra
  (
   (:exit t)
   (
    "Flycheck"
    (
    ("c" flycheck-buffer "check buffer")
    ("l" (consult-lsp-diagnostics t) "file errors")
    ;; ("p" flycheck-projectile-list-errors "project errors")
    ("L" consult-flycheck "consult")
    ("d" (flycheck-mode -1) "Disable Flycheck")
    ("e" (flycheck-mode) "Enable Flycheck")
    ("q" nil "quit")
     )
    )
   )
  )
;; Flycheck:1 ends here

;; Check directory




;; [[file:config.org::*Check directory][Check directory:1]]
(defun endless/flycheck-dir (dir)
  "Run flycheck for each file in current directory.
Results are reported in a compilation buffer."
  (interactive "DDirectory: ")
  (displaying-byte-compile-warnings
   (let ((p nil))
     (with-current-buffer (get-buffer-create
                           byte-compile-log-buffer)
       (setq default-directory dir)
       (unless (eq major-mode 'compilation-mode)
         (compilation-mode))
       (goto-char (point-max))
       (let ((inhibit-read-only t))
         (insert "\n\xc\n\n"))
       (setq p (point)))
     (dolist (file (directory-files "./" nil
                                    "\\`[^\\.].*\\'"))
       (endless/-flycheck-file file))
     (with-selected-window (display-buffer
                            byte-compile-log-buffer)
       (goto-char p)
       (recenter 1)))))

(defun endless/-report-error (fmt &rest args)
  "Print an error on `byte-compile-log-buffer'."
  (let ((inhibit-read-only t)
        (fill-prefix "    "))
    (with-current-buffer byte-compile-log-buffer
      (let ((l (point)))
        (insert "\n" (apply #'format fmt args))
        (fill-region (1+ l) (point))))))

(defun endless/-flycheck-file (file)
  "Check FILE and report to `byte-compile-log-buffer'."
  (let ((was-visited (find-buffer-visiting file)))
    (with-current-buffer (or was-visited
                             (progn (find-file file)
                                    (current-buffer)))
      (when (ignore-errors (flycheck-buffer))
        (while (flycheck-running-p)
          (accept-process-output nil 0.1))
        (pcase flycheck-last-status-change
          ((or `errored `suspicious)
           (endless/-report-error
            "%s: Something wrong here!"
            (file-name-nondirectory (buffer-file-name))))
          (`finished
           (dolist (e flycheck-current-errors)
             (endless/-report-error
              "%s:%s:%s:%s: %s"
              (file-name-nondirectory (buffer-file-name))
              (flycheck-error-line e)
              (flycheck-error-column e)
              (flycheck-error-level e)
              (flycheck-error-message e))))))
      (if was-visited
          (bury-buffer was-visited)
        (kill-buffer (current-buffer))))))
;; Check directory:1 ends here

;; magit/git


;; [[file:config.org::*magit/git][magit/git:1]]
(after! magit
