.config/doom/packages.el

;; sticky shell prompt



;; [[file:config.org::*sticky shell prompt][sticky shell prompt:1]]
(package! sticky-shell)
;; sticky shell prompt:1 ends here
