.config/doom/config.org
* magit/git

#+begin_src emacs-lisp
(after! magit
  ;; Set magit log date formats
  (setq magit-log-margin '(t "%Y-%m-%d %H:%M " magit-log-margin-width t 18))

  ;; set to 'all, this seems to make commits slow?
  (setq magit-diff-refine-hunk t)
  (setq magit-log-section-commit-count 50)
  (setq magit-status-sections-hook

    '(magit-insert-status-headers
       magit-insert-merge-log
       magit-insert-rebase-sequence
       magit-insert-am-sequence
       magit-insert-sequencer-sequence
       magit-insert-bisect-output
       magit-insert-bisect-rest
       magit-insert-bisect-log
       magit-insert-untracked-files
       magit-insert-unstaged-changes

       magit-insert-staged-changes
       magit-insert-stashes
       magit-insert-unpushed-to-pushremote
       magit-insert-unpulled-from-pushremote
       magit-insert-unpushed-to-upstream
       magit-insert-unpulled-from-upstream
       magit-insert-recent-commits

       ;; forge
       ;; See forge-status-buffer-default-topic-filters
       forge-insert-pullreqs
       forge-insert-issues

       ;; Add ignored files section to magit status
       ;; This makes yadm-status very slow: https://github.com/magit/magit/discussions/4750
       ;; magit-insert-ignored-files


       ))

  ;; https://magit.vc/manual/magit/Status-Header-Sections.html
  (setq magit-status-headers-hook
    '(magit-insert-error-header
       magit-insert-diff-filter-header
       magit-insert-head-branch-header
       magit-insert-upstream-branch-header
       magit-insert-push-branch-header
       magit-insert-tags-header))

  (setq magit-wip-namespace "refs/magit-wip/")

  ;### autoload
  (defun vi/magit-gt-absorb ()
    (interactive)
    (magit-shell-command-topdir "gt absorb"))

  ;### autoload
  (defun vi/magit-gt-submit ()
    (interactive)
    (magit-shell-command-topdir "gt submit"))

  (transient-define-prefix magit-run ()
    "Run git or another command, or launch a graphical utility."
    [["Run git subcommand"
       ("!" "in repository root"   magit-git-command-topdir)
       ("c" "in working directory" magit-git-command)]
      ["Run shell command"
        ("s" "in repository root"   magit-shell-command-topdir)
        ("S" "in working directory" magit-shell-command)]
      ["Launch"
        ("a" "gt absorb" vi/magit-gt-absorb)
        ("P" "gt submit" vi/magit-gt-submit)]])
    ;; ("k" "gitk"                 magit-run-gitk)
    ;; ("a" "gitk --all"           magit-run-gitk-all)
    ;; ("b" "gitk --branches"      magit-run-gitk-branches)
    ;; ("g" "git gui"              magit-run-git-gui)
    ;; ("m" "git mergetool --gui"  magit-git-mergetool)]])


  ;; Protect against accidental pushes to upstream
  ;; https://github.com/magit/magit/wiki/Tips-and-Tricks#ask-for-confirmation-before-pushing-to-originmaster
  (define-advice magit-push-current-to-upstream (:before (args) query-yes-or-no)
    "Prompt for confirmation before permitting a push to upstream."
    (when-let ((branch (magit-get-current-branch)))
      (unless (yes-or-no-p (format "Push %s branch upstream to %s? "
                             branch
                             (or (magit-get-upstream-branch branch)
                               (magit-get "branch" branch "remote"))))
        (user-error "Push to upstream aborted by user"))))
  (add-hook 'magit-process-prompt-functions 'magit-process-git-credential-manager-core)
  )

;; (transient-append-suffix 'magit-run '(0 0 0) ; 0 means add at the end
;;   '("U" "gt submit" vi/magit-gt-submit)
;;   )

;; (with-eval-after-load 'magit
;;   (defun vi/magit-gt-submit ()
;;   (magit-shell-comand "gt submit"))))



(map! :map magit-mode-map
  "s-<tab>" #'magit-section-cycle-diffs
  "M-<tab>" nil
  )

#+end_src

** COMMENT magit-delta

disabled <2023-03-08 Wed> because of https://github.com/dandavison/magit-delta/issues/9

#+begin_src emacs-lisp :tangle packages.el
(package! magit-delta)
#+end_src


#+begin_src emacs-lisp
(use-package! magit-delta
  :hook (magit-mode . magit-delta-mode))
#+end_src

** magit backups (wip)

#+begin_src emacs-lisp
(add-hook! 'doom-first-file-hook #'magit-wip-mode)
#+end_src

<2022-07-11 Mon> Unfortunately this doesn't seem to work in Yadm files because they don't get recognized as git repos by default ([[*Yadm][Yadm]])

also does not track untracked files

** COMMENT git-wip-mode
:PROPERTIES:
:CREATED:  [2023-09-15 Fri 17:13]
:END:


#+begin_src emacs-lisp :tangle packages.el
(package! git-wip-mode :recipe (:host github :repo "bartman/git-wip-mode" :files (defaults "git-wip-mode.el"))
#+end_src

** ediff


#+begin_src emacs-lisp
(defun vi/ediff-setup-windows-plain-merge (buf-A buf-B buf-C control-buffer)
  ;; skip dedicated and unsplittable frames
  (ediff-destroy-control-frame control-buffer)
  (let ((window-min-height 1)
         (with-Ancestor-p (with-current-buffer control-buffer
                            ediff-merge-with-ancestor-job))
         split-window-function
         merge-window-share merge-window-lines
         (buf-Ancestor (with-current-buffer control-buffer
                         ediff-ancestor-buffer))
         wind-A wind-B wind-C wind-Ancestor)
    (with-current-buffer control-buffer
      (setq merge-window-share ediff-merge-window-share
        ;; this lets us have local versions of ediff-split-window-function
        split-window-function ediff-split-window-function))
    (delete-other-windows)
    (set-window-dedicated-p (selected-window) nil)
    (split-window-vertically)
    (ediff-select-lowest-window)
    (ediff-setup-control-buffer control-buffer)

    ;; go to the upper window and split it betw A, B, and possibly C
    (other-window 1)
    (setq merge-window-lines
      (max 2 (round (* (window-height) merge-window-share))))
    (switch-to-buffer buf-A)
    (setq wind-A (selected-window))

    (split-window-vertically (max 2 (- (window-height) merge-window-lines)))
    (if (eq (selected-window) wind-A)
      (other-window 1))

    (setq wind-C (selected-window))
    (switch-to-buffer buf-C)

    (select-window wind-A)
    (funcall split-window-function)

    (if (eq (selected-window) wind-A)
      (other-window 1))
    (switch-to-buffer buf-B)
    (setq wind-B (selected-window))

    (when (and ediff-show-ancestor with-Ancestor-p)
      (select-window wind-B)
      (split-window-horizontally)
      (when (eq (selected-window) wind-B)
        (other-window 1))
      (switch-to-buffer buf-Ancestor)
      (setq wind-Ancestor (selected-window)))

    (balance-windows-area)

    (with-current-buffer control-buffer
      (setq ediff-window-A wind-A
        ediff-window-B wind-B
        ediff-window-C wind-C
        ediff-window-Ancestor wind-Ancestor))

    (ediff-select-lowest-window)
    (minimize-window)
    (ediff-setup-control-buffer control-buffer)
    ))
(defun ediff-copy-both-to-C ()
  (interactive)
  (ediff-copy-diff ediff-current-difference nil 'C nil
                   (concat
                    (ediff-get-region-contents ediff-current-difference 'A ediff-control-buffer)
                    (ediff-get-region-contents ediff-current-difference 'B ediff-control-buffer))))
(defun add-d-to-ediff-mode-map () (define-key ediff-mode-map "d" 'ediff-copy-both-to-C))
(add-hook 'ediff-keymap-setup-hook 'add-d-to-ediff-mode-map)
(add-hook! 'ediff-cleanup-hook 'ediff-delete-temp-files)
(add-hook! '(ediff-before-setup-hook ediff-before-setup-windows-hook) (setq ediff-window-setup-function #'vi/ediff-setup-windows-plain-merge))

#+end_src
** browse at remote
:PROPERTIES:
:CREATED:  [2023-11-10 Fri 00:20]
:END:

#+begin_src emacs-lisp :tangle packages.el
(package! browse-at-remote :recipe (:host github :repo "rmuslimov/browse-at-remote"))
#+end_src

** git-link

#+begin_src emacs-lisp :tangle packages.el
(package! git-link)
#+end_src


* Yadm
