.config/doom/packages.el

;; browse at remote
;; :PROPERTIES:
;; :CREATED:  [2023-11-10 Fri 00:20]
;; :END:


;; [[file:config.org::*browse at remote][browse at remote:1]]
(package! browse-at-remote :recipe (:host github :repo "rmuslimov/browse-at-remote"))
;; browse at remote:1 ends here

;; git-link


;; [[file:config.org::*git-link][git-link:1]]
(package! git-link)
;; git-link:1 ends here
