.config/doom/config.org
** COMMENT Handle bare repos (yadm/$HOME)

Yadm (yadm.io) keeps its git directory in .local/share/yadm/repo.git (found this
by running =yadm=). This teaches Magit to use the right git directory for $HOME

https://github.com/magit/magit/issues/460#issuecomment-837449105

<2022-07-11 Mon> I think this doesn't actually work for yadm since we keep files in subdirectories of $HOME


#+begin_src emacs-lisp
(defun home-magit-process-environment (env)
  "Add GIT_DIR and GIT_WORK_TREE to ENV when in a special directory.
https://github.com/magit/magit/issues/460 (@cpitclaudel)."
  (let ((default (file-name-as-directory (expand-file-name default-directory)))
        (home (expand-file-name "~/")))
    (when (string= default home)
      (let ((gitdir (expand-file-name "~/.local/share/yadm/repo.git/")))
        (push (format "GIT_WORK_TREE=%s" home) env)
        (push (format "GIT_DIR=%s" gitdir) env))))
  env)

(advice-add 'magit-process-environment
            :filter-return #'home-magit-process-environment)
#+end_src

** COMMENT Another broken approach: using direnv

Similar to [[*Handle bare repos (yadm/$HOME)][Handle bare repos (yadm/$HOME)]], we could try to set GIT_DIR and
GIT_WORK_TREE via $HOME/.envrc, but this is problematic because

1. magit will unset them on startup: https://github.com/magit/magit/wiki/Don't-set-$GIT_DIR-and-alike
2. a new git directory without .envrc will default to the yadm repo, which is scary (actually maybe not: git init in an existing repo is safe..)

** Using Tramp for magit/yadm

doesn't work for commits??

See https://www.reddit.com/r/emacs/comments/gjukb3/yadm_magit/gasc8n6/

#+begin_src emacs-lisp
;; We leave this in so that /yadm:: still works
(use-package! tramp
  :config
  (setq debug-ignored-errors
      (cons 'remote-file-error debug-ignored-errors))
  (add-to-list 'tramp-methods
               '("yadm"
                 (tramp-login-program "yadm")
                 (tramp-login-args (("enter")))
                 (tramp-login-env (("SHELL") ("/bin/sh")))
                 (tramp-remote-shell "/bin/sh")
                 (tramp-remote-shell-args ("-c")))))

;; (defun yadm-status ()
;;   (interactive)
;;   (magit-status "/yadm::"))
#+end_src

** Another method, setting git flags

Quit recursive edit using C-]

#+begin_src emacs-lisp
(defun yadm-status ()
  "Magit on dotfiles repo for the duration of a recursive edit."
  (interactive)
  (require 'magit)
  (let ((magit-git-global-arguments
          `(,(concat "--git-dir=" vi/home-dir "/.local/share/yadm/repo.git")
            ,(concat "--work-tree=" vi/home-dir)
          ;; `(,(substitute-env-vars "--git-dir=/home/venky/.local/share/yadm/repo.git")
          ;;    ,(substitute-env-vars "--work-tree=/home/venky")
             ,@magit-git-global-arguments)))
    (magit-status "~")
    (recursive-edit)))
#+end_src

* LSP


#+begin_src emacs-lisp
(use-package! lsp-mode
  :init
  (setq lsp-keymap-prefix "C-c l")

  :custom
  ;; We prefer to use TabNine::sem

  (lsp-enable-snippet nil)
  ;; https://emacs-lsp.github.io/lsp-mode/page/settings/
  (lsp-auto-configure t)
  (lsp-enable-imenu t)

  ;; controls doc buffers at bottom (this is not eldoc -- which in python-mode is truncated, so useless)
  ;; shows signature automatically inside arg params or <C-c l h s>
  ;; see lsp-ui-doc-mode for on cursor
  (lsp-signature-auto-activate '(:on-trigger-char :on-server-request))
  (lsp-signature-render-documentation nil)
  (lsp-headerline-breadcrumb-enable t)
  (lsp-headerline-breadcrumb-enable-diagnostics t)
  (lsp-keep-workspace-alive nil)
  (lsp-semantic-tokens-enable nil)      ;no semantic highlighting: rainbow-identifiers
  (lsp-symbol-highlighting-skip-current t)
  (lsp-enable-xref nil)
  (lsp-lens-enable t)
  (lsp-idle-delay 0.1)
  ;; (lsp-disabled-clients '((python-mode . '(pyls mspyls))))

    ;; This will disable the flycheck checkers. (we use them directly to have better control)
  ;; (lsp-diagnostics-provider :flycheck)
  (lsp-diagnostic-clean-after-change nil)
  (lsp-file-watch-threshold 10000)
  (lsp-enable-completion-at-point t)
  (lsp-completion-provider :none)       ;disable company-mode

  ;; sideline
  (lsp-ui-sideline-enable t)
  (lsp-ui-sideline-show-hover nil)
  (lsp-ui-sideline-show-symbol nil)
  (lsp-ui-sideline-show-diagnostics t)
  (lsp-ui-sideline-show-code-actions t)
  (lsp-ui-sideline-delay 0.1)
  ;; peek
  (lsp-ui-peek-enable t)
  ;; imenu
  ;; (lsp-ui-imenu-window-width 30)
  ;; (lsp-ui-imenu-auto-refresh t)


  :config
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.venv\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.mypy_cache\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.ruff_cache\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.pdm-build\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]wandb\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]__pycache__\\'")

  ;; Fix the hint diagnostic to display as faded out, not error  (https://github.com/emacs-lsp/lsp-mode/issues/3104)
  ;; Unrelated error: Invalid face reference: lsp-flycheck-info-unnecessary (https://github.(com/emacs-lsp/lsp-mode/issues/2255)
  (add-hook! 'lsp-diagnostics-updated-hook
             ;; For some reason, this face is only defined after the
             ;; lsp-diagnostics-updated-hook, so this will fail the first time
             ;; through
    (if (facep 'lsp-flycheck-info-unnecessary-face)
        (set-face-attribute 'lsp-flycheck-info-unnecessary-face nil :foreground "gray30" :underline nil))
    )
  
  )

(setq-hook! 'lsp-ui-doc-mode-hook
    ;; doc in childframe
  lsp-ui-doc-enable t
  lsp-ui-doc-include-signature t
  lsp-ui-doc-show-with-cursor t
  lsp-ui-doc-position 'bottom
  lsp-ui-doc-header nil
  lsp-ui-doc-max-height 50
  lsp-ui-doc-max-width 75
  lsp-ui-doc-delay 1)


#+end_src


** COMMENT treemacs/lsp

we prefer to use dired-sidebar

#+begin_src emacs-lisp :tangle packages.el
(package! lsp-treemacs)
#+end_src



#+begin_src emacs-lisp
(use-package! lsp-treemacs
  :after lsp
  :custom
  (lsp-treemacs-sync-mode 1)
  )
#+end_src
* COMMENT Tree sitter

#+begin_src emacs-lisp :tangle packages.el
(package! tree-sitter)
(package! tree-sitter-langs)
#+end_src


tree-sitter is slow as crap (tree-sitter--after-change) -- atleast in ein python cells

#+begin_src emacs-lisp
(add-hook! '(python-mode-hook) #'tree-sitter-mode)

;;; global wants to use it in org-mode and keeps complaining
;; (use-package! tree-sitter
;;   :config (global-tree-sitter-mode))
#+end_src

** COMMENT combobulate

This seems useful, but needs better bindings. We want to navigate to things
quickly (avy seems fine), and move them up/down (only through hydra, not good). Needs further investigation

#+begin_src emacs-lisp :tangle packages.el
(package! combobulate :recipe (:host github :repo "mickeynp/combobulate"))
#+end_src


#+begin_src emacs-lisp
(use-package! combobulate
  :hook ((python-mode . combobulate-mode)
         (js-mode . combobulate-mode)
         (typescript-mode . combobulate-mode)
         )
  )
#+end_src

* C++

** ccls vs clangd

doom-emacs default c++ lsp server is ccls. (See https://github.com/hlissner/doom-emacs/issues/2689)

Switching to clangd seems to require some or all of the following:

1. Disable ccls package

#+begin_src emacs-lisp
;; (disable-packages! ccls)
#+end_src

1. Do not reference ccls in vi/setup-c++-lsp
2. Ensure that clangd is installed
3. After loading lsp, in *scratch* buffer, execute ~(set-lsp-priority! 'clangd 1)~

   Doing this in config.org seems to result in "nil" lsp server name somewhere.
4. +lsp/switch-client to clangd

** Turn off lens

Lens shows refs for each variable in an overlay which is annoying. Also duplicated between lsp-lens and ccls-code-lens

#+begin_src emacs-lisp
(defun vi/setup-c++-lsp ()
  ;; For now we are using ccls, might want to try clangd someday. ccls is
  ;; default in doom-emacs, switching to clangd didn't work out of the box.
  (setq-local lsp-lens-enable nil)
  (remove-hook! lsp-lens-mode #'ccls-code-lens-mode)
  (ccls-code-lens-mode -1)
  )
#+end_src
* Python

#+begin_src emacs-lisp
(use-package! python
  :custom
  (python-fill-docstring-style 'symmetric)
  (lsp-pyright-diagnostic-mode "workspace")
  (lsp-pyright-typechecking-mode "standard")
  )
#+end_src

#+begin_src emacs-lisp
(defun vi/setup-python-flycheck ()

  ;; This needs to happen after lsp else:
  ;; Error (python-mode-hook): Error running hook "vi/setup-python-flycheck" because: (user-error lsp is not a syntax checker)

  (flycheck-select-checker 'lsp)
  ;; (flycheck-add-next-checker 'lsp '(t . python-ruff))

  ;; Not sure if we need flake8 - it pegs the CPU on some buffers
  ;; (flycheck-add-next-checker 'lsp 'python-flake8-vi)

  ;; Why do we still have mypy? The theory is that it gives some better messages complementary to pyright
  ;;(setq-local flycheck-python-mypy-executable (concat (projectile-project-root) "/.venv/bin/mypy"))
  ;; (flycheck-add-next-checker 'lsp 'python-mypy-vi)

  ;; Check if the file is broken
  ;; (flycheck-add-next-checker 'python-ruff '(t . python-pycompile))
  (flycheck-add-next-checker 'lsp '(t . python-pycompile))

  ;; we could disable mypy as well, since pyright does most of it, but pyright doesn't support attrs yet?
  (setq-local flycheck-disabled-checkers '(python-pylint python-mypy))
  )
#+end_src

