.config/doom/config.el

;; Using Tramp for magit/yadm

;; See https://www.reddit.com/r/emacs/comments/gjukb3/yadm_magit/gasc8n6/


;; [[file:config.org::*Using Tramp for magit/yadm][Using Tramp for magit/yadm:1]]
(use-package tramp
  :config
  (setq debug-ignored-errors
      (cons 'remote-file-error debug-ignored-errors))
  (add-to-list 'tramp-methods
               '("yadm"
                 (tramp-login-program "yadm")
                 (tramp-login-args (("enter")))
                 (tramp-login-env (("SHELL") ("/bin/sh")))
                 (tramp-remote-shell "/bin/sh")
                 (tramp-remote-shell-args ("-c")))))

(defun yadm-status ()
  (interactive)
  (magit-status "/yadm::"))
;; Using Tramp for magit/yadm:1 ends here

;; LSP



;; [[file:config.org::*LSP][LSP:1]]
(use-package! lsp-mode
  :init
  (setq lsp-keymap-prefix "C-c l")

  :custom
  ;; We prefer to use TabNine::sem

  (lsp-enable-snippet nil)
  ;; https://emacs-lsp.github.io/lsp-mode/page/settings/
  (lsp-auto-configure t)
  (lsp-enable-imenu t)

  ;; controls doc buffers at bottom (this is not eldoc -- which in python-mode is truncated, so useless)
  ;; shows signature automatically inside arg params or <C-c l h s>
  ;; see lsp-ui-doc-mode for on cursor
  (lsp-signature-auto-activate '(:on-trigger-char :on-server-request))
  (lsp-signature-render-documentation nil)
  (lsp-headerline-breadcrumb-enable t)
  (lsp-headerline-breadcrumb-enable-diagnostics t)
  (lsp-keep-workspace-alive nil)
  (lsp-semantic-tokens-enable nil)      ;no semantic highlighting: rainbow-identifiers
  (lsp-symbol-highlighting-skip-current t)
  (lsp-enable-xref nil)
  (lsp-lens-enable t)
  (lsp-idle-delay 0.1)
  ;; (lsp-disabled-clients '((python-mode . '(pyls mspyls))))

    ;; This will disable the flycheck checkers. (we use them directly to have better control)
  ;; (lsp-diagnostics-provider :flycheck)
  (lsp-diagnostic-clean-after-change nil)
  (lsp-file-watch-threshold 10000)
  (lsp-enable-completion-at-point t)
  (lsp-completion-provider :none)       ;disable company-mode

  ;; sideline
  (lsp-ui-sideline-enable t)
  (lsp-ui-sideline-show-hover nil)
  (lsp-ui-sideline-show-symbol nil)
  (lsp-ui-sideline-show-diagnostics t)
  (lsp-ui-sideline-show-code-actions t)
  (lsp-ui-sideline-delay 0.1)
  ;; peek
  (lsp-ui-peek-enable t)
  ;; imenu
  ;; (lsp-ui-imenu-window-width 30)
  ;; (lsp-ui-imenu-auto-refresh t)


  :config
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.venv\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.mypy_cache\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.ruff_cache\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]\\.pdm-build\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]wandb\\'")
  (add-to-list 'lsp-file-watch-ignored-directories "[/\\\\]__pycache__\\'")

  ;; Fix the hint diagnostic to display as faded out, not error  (https://github.com/emacs-lsp/lsp-mode/issues/3104)
  ;; Unrelated error: Invalid face reference: lsp-flycheck-info-unnecessary (https://github.(com/emacs-lsp/lsp-mode/issues/2255)
  (add-hook! 'lsp-diagnostics-updated-hook
             ;; For some reason, this face is only defined after the
             ;; lsp-diagnostics-updated-hook, so this will fail the first time
             ;; through
    (if (facep 'lsp-flycheck-info-unnecessary-face)
        (set-face-attribute 'lsp-flycheck-info-unnecessary-face nil :foreground "gray30" :underline nil))
    )

  :pretty-hydra
  ((
    "LSP"
    (("?" lsp-find-references "Find references")
     ("." lsp-find-definition "Find definition")
     ("," lsp-find-type-definition "Find type"))
     ;; ("e" lsp-treemacs-errors-list "Errors"))
    )
    )
  )

(setq-hook! 'lsp-ui-doc-mode-hook
    ;; doc in childframe
  lsp-ui-doc-enable t
  lsp-ui-doc-include-signature t
  lsp-ui-doc-show-with-cursor t
  lsp-ui-doc-position 'bottom
  lsp-ui-doc-header nil
  lsp-ui-doc-max-height 50
  lsp-ui-doc-max-width 75
  lsp-ui-doc-delay 1)
;; LSP:1 ends here

;; ccls vs clangd

;; doom-emacs default c++ lsp server is ccls. (See https://github.com/hlissner/doom-emacs/issues/2689)

;; Switching to clangd seems to require some or all of the following:

;; 1. Disable ccls package


;; [[file:config.org::*ccls vs clangd][ccls vs clangd:1]]
;; (disable-packages! ccls)
;; ccls vs clangd:1 ends here

;; Turn off lens

;; Lens shows refs for each variable in an overlay which is annoying. Also duplicated between lsp-lens and ccls-code-lens


;; [[file:config.org::*Turn off lens][Turn off lens:1]]
(defun vi/setup-c++-lsp ()
  ;; For now we are using ccls, might want to try clangd someday. ccls is
  ;; default in doom-emacs, switching to clangd didn't work out of the box.
  (setq-local lsp-lens-enable nil)
  (remove-hook! lsp-lens-mode #'ccls-code-lens-mode)
  (ccls-code-lens-mode -1)
  )
;; Turn off lens:1 ends here

;; Python


;; [[file:config.org::*Python][Python:1]]
(use-package! python
  :custom
  (python-fill-docstring-style 'symmetric)
  (lsp-pyright-diagnostic-mode "workspace")
  (lsp-pyright-typechecking-mode "standard")
  )
;; Python:1 ends here

;; [[file:config.org::*Python][Python:2]]
(defun vi/setup-python-flycheck ()

  ;; This needs to happen after lsp else:
  ;; Error (python-mode-hook): Error running hook "vi/setup-python-flycheck" because: (user-error lsp is not a syntax checker)

  (flycheck-select-checker 'lsp)
  ;; (flycheck-add-next-checker 'lsp '(t . python-ruff))

  ;; Not sure if we need flake8 - it pegs the CPU on some buffers
  ;; (flycheck-add-next-checker 'lsp 'python-flake8-vi)

  ;; Why do we still have mypy? The theory is that it gives some better messages complementary to pyright
  ;;(setq-local flycheck-python-mypy-executable (concat (projectile-project-root) "/.venv/bin/mypy"))
  ;; (flycheck-add-next-checker 'lsp 'python-mypy-vi)

  ;; Check if the file is broken
  ;; (flycheck-add-next-checker 'python-ruff '(t . python-pycompile))
  (flycheck-add-next-checker 'lsp '(t . python-pycompile))

  ;; we could disable mypy as well, since pyright does most of it, but pyright doesn't support attrs yet?
  (setq-local flycheck-disabled-checkers '(python-pylint python-mypy))
  )
;; Python:2 ends here

;; LSP setup
;; :PROPERTIES:
