.config/doom/config.org
** COMMENT Diagnostics filter hints
#+begin_src emacs-lisp
(defun vi/diag-matches-p (d sev tag)
  (and (equal sev (ht-get d "severity"))
       ;; handle nil ~tag~; convert ~tags~ from vector to list
       (if tag (-contains? (append (ht-get d "tags") nil) tag) t)))

(defun vi/filter-lsp-diagnostics (diag severity tag)
  ;; ~diag~ will be a hash table with keys (diagnostics, uri) (ie. PublishDiagnosticsParams when called from lsp-diagnostic-filter)
  ;;
  ;; where each diagnostic is a hashtable with keys ~("range", "message", "severity", "tags", "source")~
  ;;
  ;; severity: https://microsoft.github.io/language-server-protocol/specifications/lsp/3.17/specification/#diagnosticSeverity
  ;; tags: https://microsoft.github.io/language-server-protocol/specifications/lsp/3.17/specification/#diagnosticTag
  ;;
  ;; Note that ~(lsp-diagnostics)~ is not identical to PublishDiagnosticsParams:
  ;;
  ;; - PublishDiagnosticsParams has keys (uri, diagnostics), while lsp-diagnostics returns a hash table {uri: [diagnostics]}
  ;; - PublishDiagnosticsParams[diagnostics] is a vector, not a list
  ;;
  ;; #+begin_example
  ;; (ht-get* (-second-item (-second-item (ht-values (lsp-diagnostics)))) "message")
  ;; #+end_example
  ;;

  ;;
  (require 'ht)
  (require 'dash)
  ;; mutate diag to remove any diagnostics that match severity/tag
  ;; For each item in ~diag~:
  (-let* ((diagnostics (append (ht-get diag "diagnostics") nil))
          (filtered (--remove (vi/diag-matches-p it severity tag) diagnostics)))
     ;; update diag with filtered list
    (ht-set! diag "diagnostics" filtered)
    diag))
#+end_src

** COMMENT pylsp

needs pipx install 'python-lsp-server[rope,black,ruff]'
& +lsp/switch-client (TODO: figure out how to set priority!)


#+begin_src emacs-lisp
(setq! lsp-pylsp-plugins-yapf-enabled nil)
(setq! lsp-pylsp-plugins-flake8-enabled nil)
(setq! lsp-pylsp-plugins-autopep8-enabled nil)
(setq! lsp-pylsp-plugins-pydocstyle-enabled nil)
(setq! lsp-pylsp-plugins-pycodestyle-enabled nil)
(setq! lsp-pylsp-plugins-mccabe-enabled nil)
(setq! lsp-pylsp-plugins-pylint-enabled nil)
(setq! lsp-pylsp-plugins-black-enabled t)
(setq! lsp-pylsp-plugins-rope-completion-enabled t)
(setq! lsp-pylsp-plugins-ruff-enabled t)
#+end_src

** COMMENT pylsp-rope

not sure why this isn't working!

#+begin_src emacs-lisp :tangle packages.el
(package! pylsp-rope :recipe (:host github :repo "sonofhypnos/pylsp-rope.el"))
#+end_src



#+begin_src emacs-lisp
(use-package! pylsp-rope)
#+end_src
** COMMENT lsp-pyright
:PROPERTIES:
:CREATED:  [2023-08-14 Mon 13:45]
:END:

Note: workspace root must have the pyrightconfig.json?

*** redeclare as :add-on
:PROPERTIES:
:CREATED:  [2023-08-31 Thu 00:51]
:END:


#+begin_src emacs-lisp
(after! lsp-pyright
  ;; https://github.com/emacs-lsp/lsp-pyright/blob/cea14f6c9da899778ce1d8888af1508931bb7fb7/lsp-pyright.el#L227C1-L247C1
  (lsp-register-client
    (make-lsp-client
      :new-connection (lsp-stdio-connection (lambda ()
                                              (cons (lsp-package-path 'pyright)
                                                lsp-pyright-langserver-command-args)))
      :major-modes '(python-mode python-ts-mode)
      :server-id 'pyright
      :multi-root lsp-pyright-multi-root
      :priority 2
      :add-on? t
      :initialized-fn (lambda (workspace)
                        (with-lsp-workspace workspace
                          ;; we send empty settings initially, LSP server will ask for the
                          ;; configuration of each workspace folder later separately
                          (lsp--set-configuration
                            (make-hash-table :test 'equal))))
      :download-server-fn (lambda (_client callback error-callback _update?)
                            (lsp-package-ensure 'pyright callback error-callback))
      :notification-handlers (lsp-ht ("pyright/beginProgress" 'lsp-pyright--begin-progress-callback)
                               ("pyright/reportProgress" 'lsp-pyright--report-progress-callback)
                               ("pyright/endProgress" 'lsp-pyright--end-progress-callback))))

  )

#+end_src

** LSP setup
:PROPERTIES:
:CREATED:  [2023-08-13 Sun 15:17]
:END:

#+begin_src emacs-lisp
(defun vi/python-mode-lsp ()

  ;;;; EDIT: this also filters out the visual rendering (https://discord.com/channels/789885435026604033/b789890622424219658/993942950331551814)
  ;;;; Filter out "lsp-info-flycheck-"
  ;;;; severity=4 ("hint"), tag=1 ("unnecessary") -- see vi/filter-tag-diagnostics for reference
  ;; (setq-local lsp-diagnostic-filter (lambda (param work) (vi/filter-lsp-diagnostics param 4 1)))


  ;; So that lsp is available as a checker
  (add-hook! 'lsp-after-open-hook #'vi/setup-python-flycheck)

  ;; we prefer rainbow-delimiters-mode
  ;; (tree-sitter-hl-mode)
  )

(add-hook! 'python-mode-hook #'vi/python-mode-lsp)

#+end_src

ruff-lsp support is built into emacs lsp (https://emacs-lsp.github.io/lsp-mode/page/lsp-ruff-lsp/)


** Flycheck checkers

*** COMMENT ruff flycheck
:PROPERTIES:
:CREATED:  [2023-08-09 Wed 14:15]
:END:


#+begin_src emacs-lisp
;; From https://github.com/flycheck/flycheck/issues/1974#issuecomment-1343495202
(flycheck-define-checker python-ruff
  "A Python syntax and style checker using the ruff utility.
To override the path to the ruff executable, set
`flycheck-python-ruff-executable'.
See URL `http://pypi.python.org/pypi/ruff'."
  :command ("ruff"
            "--format=text"
            (eval (when buffer-file-name
                    (concat "--stdin-filename=" buffer-file-name)))
            "-")
  :standard-input t
  :error-filter (lambda (errors)
                  (let ((errors (flycheck-sanitize-errors errors)))
                    (seq-map #'flycheck-flake8-fix-error-level errors)))
  :error-patterns
  ((warning line-start
            (file-name) ":" line ":" (optional column ":") " "
            (id (one-or-more (any alpha)) (one-or-more digit)) " "
            (message (one-or-more not-newline))
            line-end))
  :modes python-mode)

(add-to-list 'flycheck-checkers 'python-ruff)
#+end_src

*** COMMENT Define flake8 checkers (for file and project)

- the builtin flake8 has to be configured via flake8rc, and I want a python-flake8-project-vi anyway
- also the builtin flake8 looks for setup.cfg instead of projectile-project-root for :working-directory
- filters flake8 to only pyflakes errors
- skips .venv directory

#+begin_src emacs-lisp
(after! flycheck
  (flycheck-define-checker python-flake8-vi
    "flake8 -> pyflakes "

    :command ("flake8"
              "--format" "default"
              "--select" "F"                ;only pyflakes
              "--extend-exclude" ".venv"  ;no venvs
              (config-file "--append-config" flycheck-flake8rc)
              (option "--max-complexity" flycheck-flake8-maximum-complexity nil
                      flycheck-option-int)
              (option "--max-line-length" flycheck-flake8-maximum-line-length nil
                      flycheck-option-int)
              source-original)
    :working-directory (lambda (_) (projectile-project-root))
    :error-filter (lambda (errors)
                    (let ((errors (flycheck-sanitize-errors errors)))
                      (seq-map #'flycheck-flake8-fix-error-level errors)))
    :error-patterns
    ((warning line-start
              (file-name) ":" line ":" (optional column ":") " "
              (id (one-or-more (any alpha)) (one-or-more digit)) " "
              (message (one-or-more not-newline))
              line-end))
    :modes python-mode
    )

  (add-to-list 'flycheck-checkers 'python-flake8-vi)

  (flycheck-define-checker python-flake8-project-vi
    "flake8 -> pyflakes, and running on whole project"

    ;; Not calling flake8 directly makes it easier to switch between different
    ;; Python versions; see https://github.com/flycheck/flycheck/issues/1055.
    :command ("flake8"
              "--format" "default"
              "--select" "F"                ;only pyflakes
              "--extend-exclude" ".venv"  ;no venvs
              (config-file "--append-config" flycheck-flake8rc)
              (option "--max-complexity" flycheck-flake8-maximum-complexity nil
                      flycheck-option-int)
              (option "--max-line-length" flycheck-flake8-maximum-line-length nil
                      flycheck-option-int)
              "."
              )
    :working-directory (lambda (_) (projectile-project-root))
    :error-filter (lambda (errors)
                    (let ((errors (flycheck-sanitize-errors errors)))
                      (seq-map #'flycheck-flake8-fix-error-level errors)))
    :error-patterns
    ((warning line-start
              (file-name) ":" line ":" (optional column ":") " "
              (id (one-or-more (any alpha)) (one-or-more digit)) " "
              (message (one-or-more not-newline))
              line-end))
    :modes python-mode
    )

  (add-to-list 'flycheck-checkers 'python-flake8-project-vi)
  )
#+end_src
*** COMMENT Run mypy from projectile root dir

There are some weird errors that show up if you don't run mypy from the root directory

#+begin_src emacs-lisp
(after! flycheck
  (flycheck-define-checker python-mypy-vi
    "Mypy syntax and type checker (copied from flycheck, but with :working-directory)"
    :command ("mypy"
              "--show-column-numbers"
              (config-file "--config-file" flycheck-python-mypy-config)
              (option "--cache-dir" flycheck-python-mypy-cache-dir)
              source-original)
    :error-patterns
    ((error line-start (file-name) ":" line (optional ":" column)
            ": error:" (message) line-end)
     (warning line-start (file-name) ":" line (optional ":" column)
              ": warning:" (message) line-end)
     (info line-start (file-name) ":" line (optional ":" column)
           ": note:" (message) line-end))
    :working-directory (lambda (_) (projectile-project-root))
    :modes python-mode
    ;; Ensure the file is saved, to work around
    ;; https://github.com/python/mypy/issues/4746.
    :predicate flycheck-buffer-saved-p)

  (add-to-list 'flycheck-checkers 'python-mypy-vi))
#+end_src

*** COMMENT Run mypy for the entire project

#+begin_src emacs-lisp
(after! flycheck
  (flycheck-define-checker python-mypy-project-vi
    "Mypy the entire project"
    :command ("mypy"
              "--show-column-numbers"
              (config-file "--config-file" flycheck-python-mypy-config)
              (option "--cache-dir" flycheck-python-mypy-cache-dir)
              "."
              )
    :error-patterns
    ((error line-start (file-name) ":" line (optional ":" column)
            ": error:" (message) line-end)
     (warning line-start (file-name) ":" line (optional ":" column)
              ": warning:" (message) line-end)
     (info line-start (file-name) ":" line (optional ":" column)
           ": note:" (message) line-end))
    :working-directory (lambda (_) (projectile-project-root))
    :modes python-mode
    )
  (add-to-list 'flycheck-checkers 'python-mypy-project-vi)
  )
#+end_src

** Hydra

#+begin_src emacs-lisp
(major-mode-hydra-define (python-mode python-pytest-mode) (:exit t :quit-key ("q" "C-g"))
  (
   "Pytest"
    (
      ("d" python-pytest-dispatch "Dispatch")
      ("R" python-pytest-repeat "Repeat")
    )
    "Misc"
    (("i" vi/pyflyby-tidy-imports "Imports"))
    "Jump"
    (("t" lsp-find-type-definition "Type def"))
  ))
#+end_src
** Pyflyby

pipx install pyflyby
pipx inject pyflyby 'black[jupyter]'

#+begin_src emacs-lisp
(use-package! pyflyby
  :commands (pyflyby-transform-region-with-command)
  :load-path "~/dev/plus/python/.venv/share/emacs/site-lisp"
  )

(defun vi/pyflyby-tidy-imports ()
  (interactive "*")
  ;; even with this, it will drop comments https://github.com/deshaw/pyflyby/issues/154
  ;;  "--align=0" "--from-spaces=1")
  (pyflyby-transform-region-with-command "tidy-imports" "--hanging-indent=never" "--align=0" "--no-align-future" "--no-separate-from-imports")
  )
#+end_src

** COMMENT lsp-jedi

pipx install jedi-language-server
& +lsp/switch-client

but it's just not that useful -- extract_function and extract_variable are pretty basic

#+begin_src emacs-lisp :tangle packages.el
(package! lsp-jedi)
#+end_src


#+begin_src emacs-lisp
(use-package! lsp-jedi)
#+end_src


** COMMENT traad
:PROPERTIES:
:CREATED:  [2023-08-13 Sun 13:53]
:END:

seems to be old, not working with 3.11 <2023-08-13 Sun>

#+begin_src emacs-lisp :tangle packages.el
(package! traad)
#+end_src


#+begin_src emacs-lisp
(setq venv-location "~/.emacs.d/virtualenvs")
#+end_src
** ruff server


#+begin_src emacs-lisp
(after! python-mode
  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection '("ruff" "server" "--preview"))
     :major-modes '(python-mode)
     :priority 1
     :add-on? t
     :multi-root t
     :server-id 'ruff-server)
    )
  )
(setq! lsp-disabled-clients '(python-mode . (ruff-lsp)))
#+end_src

