.config/doom/config.el
;; :CREATED:  [2023-08-13 Sun 15:17]
;; :END:


;; [[file:config.org::*LSP setup][LSP setup:1]]
(defun vi/python-mode-lsp ()

  ;;;; EDIT: this also filters out the visual rendering (https://discord.com/channels/789885435026604033/b789890622424219658/993942950331551814)
  ;;;; Filter out "lsp-info-flycheck-"
  ;;;; severity=4 ("hint"), tag=1 ("unnecessary") -- see vi/filter-tag-diagnostics for reference
  ;; (setq-local lsp-diagnostic-filter (lambda (param work) (vi/filter-lsp-diagnostics param 4 1)))


  ;; So that lsp is available as a checker
  (add-hook! 'lsp-after-open-hook #'vi/setup-python-flycheck)

  ;; we prefer rainbow-delimiters-mode
  ;; (tree-sitter-hl-mode)
  )

(add-hook! 'python-mode-hook #'vi/python-mode-lsp)
;; LSP setup:1 ends here

;; Hydra


;; [[file:config.org::*Hydra][Hydra:1]]
(major-mode-hydra-define (python-mode python-pytest-mode) (:exit t :quit-key ("q" "C-g"))
  (
   "Pytest"
    (
      ("d" python-pytest-dispatch "Dispatch")
      ("R" python-pytest-repeat "Repeat")
    )
    "Misc"
    (("i" vi/pyflyby-tidy-imports "Imports"))
    "Jump"
    (("t" lsp-find-type-definition "Type def"))
  ))
;; Hydra:1 ends here

;; Pyflyby

;; pipx install pyflyby
;; pipx inject pyflyby 'black[jupyter]'


;; [[file:config.org::*Pyflyby][Pyflyby:1]]
(use-package! pyflyby
  :commands (pyflyby-transform-region-with-command)
  :load-path "~/dev/plus/python/.venv/share/emacs/site-lisp"
  )

(defun vi/pyflyby-tidy-imports ()
  (interactive "*")
  ;; even with this, it will drop comments https://github.com/deshaw/pyflyby/issues/154
  ;;  "--align=0" "--from-spaces=1")
  (pyflyby-transform-region-with-command "tidy-imports" "--hanging-indent=never" "--align=0" "--no-align-future" "--no-separate-from-imports")
  )
;; Pyflyby:1 ends here

;; ruff server



;; [[file:config.org::*ruff server][ruff server:1]]
(after! python-mode
  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection '("ruff" "server" "--preview"))
     :major-modes '(python-mode)
     :priority 1
     :add-on? t
     :multi-root t
     :server-id 'ruff-server)
    )
  )
(setq! lsp-disabled-clients '(python-mode . (ruff-lsp)))
;; ruff server:1 ends here
