.config/doom/config.org
* Code Formatting

[[https://github.com/lassik/emacs-format-all-the-code/issues/170#issuecomment-1079740651][See]] for some context on the comparison b/w apheleia and format-all available --
these may be merged in the near future. Based on the table there, we are
choosing b/w format-all (more formatters, synchronous, chaining), and apheleia
(fewer but maybe the ones we need, async, chaining).

In addition, there is doom-emacs' adaptation of format-all, which is [[https://github.com/hlissner/doom-emacs/issues/6203][old]], [[https://github.com/hlissner/doom-emacs/issues/4526][due
for a rewrite for a long while]], does not support multiple formatters. Calling
set-formatter! can silently break the chain (?)


#+begin_src emacs-lisp :tangle packages.el
(package! py-isort :disable t)
#+end_src

** apheleia


#+begin_src emacs-lisp :tangle packages.el
(package! apheleia)
#+end_src

#+begin_src emacs-lisp
;;; Doom -style setting doesn't allow multiple formatters per mode
;; pipx install ruff
;; (set-formatter! 'ruff-check '("ruff" "check" "--fix" "--exit-zero" "-" "--stdin-filename" filepath) :modes '(python-mode))
;; (set-formatter! 'ruff-format '("ruff" "format" "--target-version" "py311" "-" "--stdin-filename" filepath) :modes '(python-mode))
;; ;; this may require `npm install -g prettier prettier-plugin-toml --save-dev --save-exact`
;; (set-formatter! 'prettier-toml '(npx "prettier" "--stdin-filepath" filepath "--parser=toml") :modes '(conf-toml-mode))

(after! apheleia
  ;; (setf (alist-get 'isort apheleia-formatters) '("isort" "--profile=black" "--stdout" "-"))
  ;; (setf (alist-get 'usort apheleia-formatters) '("usort" "format" "-"))

  ;; pipx install ruff
  (setf (alist-get 'ruff-check apheleia-formatters) '("ruff" "check" "--fix" "--exit-zero" "-" "--stdin-filename" filepath))
  (setf (alist-get 'ruff-format apheleia-formatters) '("ruff" "format" "--target-version" "py311" "-" "--stdin-filename" filepath))

  ;; this may require `npm install -g prettier prettier-plugin-toml --save-dev --save-exact`
  (setf (alist-get 'prettier-toml apheleia-formatters) '(npx "prettier" "--stdin-filepath" filepath "--parser=toml"))

  ;; Black uses config in ~/.config/black but not if a pyproject.toml is present (https://github.com/psf/black/issues/2863)
  ;;  (setf (alist-get 'black apheleia-formatters) '("black" "--config" (substitute-in-file-name "$HOME/.config/black") "-"))
  ;; (setf (alist-get 'black apheleia-formatters) '("black" "-"))

  ;; isort messes up type:ignore on imports (eg: https://github.com/psf/black/issues/997)
  ;; isort also messes up jupytext paired files by moving imports around
  ;; pyflyby also messes it up!
  ;; (setf (alist-get 'python-mode apheleia-mode-alist) '(isort black))

  (setf (alist-get 'python-mode apheleia-mode-alist) '(ruff-check ruff-format))
  (setf (alist-get 'conf-toml-mode apheleia-mode-alist) '(prettier-toml))
  (setf (alist-get 'jinja2-mode apheleia-mode-alist) nil)
  (apheleia-global-mode)
  )
#+end_src

** python-black

For ein notebooks. this requires black-macchiato via pipx

#+begin_src emacs-lisp :tangle packages.el
(package! python-black)
#+end_src


** COMMENT format-all (doom-emacs version)

This requires ~(format +onsave)~ to be uncommented in the ~doom!~ block

*** python

we want to use isort with black, but there is no real chaining.

so we attempt to use python-black-on-save-mode (for black), and set ~+format-with~
to ~'isort~, hoping that they will work together, but in practice isort doesn't
happen on save; only explicitly on ~+format/buffer~

#+begin_src emacs-lisp :tangle packages.el
(package! python-black)
#+end_src


#+begin_src emacs-lisp
(set-formatter! 'isort "isort --profile=black --stdout -")
(setq-hook! 'python-mode-hook +format-with-lsp nil)
(setq-hook! 'python-mode-hook +format-with 'isort)
(add-hook! 'python-mode-hook #'python-black-on-save-mode)
#+end_src

*** docker
dockfmt does a bad job: rips out comments, uses tabs.

#+begin_src emacs-lisp
(after! dockerfile-mode
  (setq-hook! 'dockerfile-mode-hook +format-with :none))
#+end_src
*** shell mode


#+begin_src emacs-lisp
(add-hook! '(sh-mode sh-set-shell-hook)
  (defun set-sh-formatter ()
    ;; never use lsp
    (setq-local +format-with-lsp nil)
    ;;  (message "Found: %S" sh-shell)
    (if (string-equal sh-shell "bash")

        ;; if bash :: use the default. we need to do this explicitly because the
        ;; var might get set to :none first, and then either sh-set-shell or a
        ;; local var might switch it
        (setq-local +format-with nil)
      ;; else :: don't format
      (setq-local +format-with :none))
    )
  )
#+end_src

**** COMMENT Quiet messages

Trying to get rid of "Setting up indent for shell type bash" etc messages ;
doesn't appear to be working..

In fact, sh-set-shell already has advice ~doom-shut-up-a~ around it

#+begin_src emacs-lisp
(require 'cl-lib)
(advice-add 'sh-set-shell :around
            (lambda (orig-fun &rest args)
              (cl-letf (((symbol-function 'message) #'ignore))
                (apply orig-fun args))))
#+end_src


*** javascript/typescript

#+begin_src emacs-lisp
(setq-hook! '(typescript-mode-hook rjsx-mode-hook) +format-with-lsp nil)
#+end_src

** align comments
:PROPERTIES:
:CREATED:  [2024-02-17 Sat 23:35]
:END:


#+begin_src emacs-lisp
(defun vi/align-comments (beginning end)
  "Align comments within marked region."
  (interactive "*r")
  (align-regexp beginning end (concat "\\(\\s-*\\)"
                                (regexp-quote comment-start))))
#+end_src

* Javascript/Typescript

#+begin_src emacs-lisp :tangle packages.el
(package! add-node-modules-path :recipe (:host github :repo "codesuki/add-node-modules-path"))
#+end_src

#+begin_src emacs-lisp
(add-hook! '(typescript-mode-hook rjsx-mode-hook) #'add-node-modules-path)
#+end_src


* Directory/Project navigation

** Treemacs

#+begin_src emacs-lisp
(after! treemacs
  (setq treemacs-show-hidden-files nil
        treemacs-is-never-other-window nil)
  (treemacs-project-follow-mode t)
  (treemacs-follow-mode t)
  )
#+end_src

** dired

- [X] todo: add hydra
- See dired-subtree [https://github.com/Fuco1/dired-hacks#dired-subtree] and dired-sidebar [https://github.com/jojojames/dired-sidebar]



*** dirvish


#+begin_src emacs-lisp :tangle packages.el
(package! dirvish)
#+end_src


#+begin_src emacs-lisp
(use-package! dirvish
  :custom
  (dirvish-side-width 40)
  ;; allow switching to dirvish-side window
  (dirvish-side-window-parameters '((no-delete-other-windows . t) (no-other-window . nil)))
  (dirvish-attributes '(subtree-state vc-state collapse))
  (dirvish-reuse-session nil)
  :config
  (dirvish-override-dired-mode)
  (dirvish-side-follow-mode)
  (dirvish-peek-mode))

(add-hook 'dirvish-find-entry-hook
          (lambda (&rest _) (setq-local truncate-lines t)))

#+end_src

**** COMMENT bug in dirvish-side
:PROPERTIES:
:CREATED:  [2023-09-21 Thu 17:01]
:END:

this breaks hydra!!!!!

https://github.com/alexluigit/dirvish/issues/194#issuecomment-1593481086

#+begin_src emacs-lisp
(defun dirvish-side-buffer-p (buffer-or-name)
  "Return t if BUFFER-OR-NAME is a dirvish buffer and a side buffer."
  (with-current-buffer buffer-or-name
    (let ((dv (dirvish-curr)))
        (if (and dv (member 'side (dv-type dv)))
            t
          nil))))

(defun dirvish-ignore-display-buffer (original-function buffer-or-name &rest original-arguments)
  (let ((switch-to-buffer-obey-display-actions (not (dirvish-side-buffer-p buffer-or-name))))
    (apply original-function buffer-or-name original-arguments)))
(advice-add 'switch-to-buffer :around #'dirvish-ignore-display-buffer)


#+end_src

*** dired git info/log


#+begin_src emacs-lisp :tangle packages.el
(package! dired-git-log :recipe (:host github :repo "amno1/dired-git-log"))
#+end_src

doesn't work well with subtree inserts

#+begin_src emacs-lisp
;; (add-hook 'dired-after-readin-hook 'dired-git-log-mode)
#+end_src

*** COMMENT dired-git
doesn't seem to do anything!

#+begin_src emacs-lisp :tangle packages.el
(package! dired-git)
#+end_src

