.config/doom/config.el

;; [[file:config.org::*apheleia][apheleia:2]]
;;; Doom -style setting doesn't allow multiple formatters per mode
;; pipx install ruff
;; (set-formatter! 'ruff-check '("ruff" "check" "--fix" "--exit-zero" "-" "--stdin-filename" filepath) :modes '(python-mode))
;; (set-formatter! 'ruff-format '("ruff" "format" "--target-version" "py311" "-" "--stdin-filename" filepath) :modes '(python-mode))
;; ;; this may require `npm install -g prettier prettier-plugin-toml --save-dev --save-exact`
;; (set-formatter! 'prettier-toml '(npx "prettier" "--stdin-filepath" filepath "--parser=toml") :modes '(conf-toml-mode))

(after! apheleia
  ;; (setf (alist-get 'isort apheleia-formatters) '("isort" "--profile=black" "--stdout" "-"))
  ;; (setf (alist-get 'usort apheleia-formatters) '("usort" "format" "-"))

  ;; pipx install ruff
  (setf (alist-get 'ruff-check apheleia-formatters) '("ruff" "check" "--fix" "--exit-zero" "-" "--stdin-filename" filepath))
  (setf (alist-get 'ruff-format apheleia-formatters) '("ruff" "format" "--target-version" "py311" "-" "--stdin-filename" filepath))

  ;; this may require `npm install -g prettier prettier-plugin-toml --save-dev --save-exact`
  (setf (alist-get 'prettier-toml apheleia-formatters) '(npx "prettier" "--stdin-filepath" filepath "--parser=toml"))

  ;; Black uses config in ~/.config/black but not if a pyproject.toml is present (https://github.com/psf/black/issues/2863)
  ;;  (setf (alist-get 'black apheleia-formatters) '("black" "--config" (substitute-in-file-name "$HOME/.config/black") "-"))
  ;; (setf (alist-get 'black apheleia-formatters) '("black" "-"))

  ;; isort messes up type:ignore on imports (eg: https://github.com/psf/black/issues/997)
  ;; isort also messes up jupytext paired files by moving imports around
  ;; pyflyby also messes it up!
  ;; (setf (alist-get 'python-mode apheleia-mode-alist) '(isort black))

  (setf (alist-get 'python-mode apheleia-mode-alist) '(ruff-check ruff-format))
  (setf (alist-get 'conf-toml-mode apheleia-mode-alist) '(prettier-toml))
  (setf (alist-get 'jinja2-mode apheleia-mode-alist) nil)
  (apheleia-global-mode)
  )
;; apheleia:2 ends here

;; align comments
;; :PROPERTIES:
;; :CREATED:  [2024-02-17 Sat 23:35]
;; :END:



;; [[file:config.org::*align comments][align comments:1]]
(defun vi/align-comments (beginning end)
  "Align comments within marked region."
  (interactive "*r")
  (align-regexp beginning end (concat "\\(\\s-*\\)"
                                (regexp-quote comment-start))))
;; align comments:1 ends here

;; [[file:config.org::*Javascript/Typescript][Javascript/Typescript:2]]
(add-hook! '(typescript-mode-hook rjsx-mode-hook) #'add-node-modules-path)
;; Javascript/Typescript:2 ends here

;; Treemacs


;; [[file:config.org::*Treemacs][Treemacs:1]]
(after! treemacs
  (setq treemacs-show-hidden-files nil
        treemacs-is-never-other-window nil)
  (treemacs-project-follow-mode t)
  (treemacs-follow-mode t)
  )
;; Treemacs:1 ends here

;; [[file:config.org::*dirvish][dirvish:2]]
(use-package! dirvish
  :custom
  (dirvish-side-width 40)
  ;; allow switching to dirvish-side window
  (dirvish-side-window-parameters '((no-delete-other-windows . t) (no-other-window . nil)))
  (dirvish-attributes '(subtree-state vc-state collapse))
  (dirvish-reuse-session nil)
  :config
  (dirvish-override-dired-mode)
  (dirvish-side-follow-mode)
  (dirvish-peek-mode))

(add-hook 'dirvish-find-entry-hook
          (lambda (&rest _) (setq-local truncate-lines t)))
;; dirvish:2 ends here



;; doesn't work well with subtree inserts


;; [[file:config.org::*dired git info/log][dired git info/log:2]]
;; (add-hook 'dired-after-readin-hook 'dired-git-log-mode)
;; dired git info/log:2 ends here
