.config/doom/packages.el

;; Code Formatting

;; [[https://github.com/lassik/emacs-format-all-the-code/issues/170#issuecomment-1079740651][See]] for some context on the comparison b/w apheleia and format-all available --
;; these may be merged in the near future. Based on the table there, we are
;; choosing b/w format-all (more formatters, synchronous, chaining), and apheleia
;; (fewer but maybe the ones we need, async, chaining).

;; In addition, there is doom-emacs' adaptation of format-all, which is [[https://github.com/hlissner/doom-emacs/issues/6203][old]], [[https://github.com/hlissner/doom-emacs/issues/4526][due
;; for a rewrite for a long while]], does not support multiple formatters. Calling
;; set-formatter! can silently break the chain (?)



;; [[file:config.org::*Code Formatting][Code Formatting:1]]
(package! py-isort :disable t)
;; Code Formatting:1 ends here

;; apheleia



;; [[file:config.org::*apheleia][apheleia:1]]
(package! apheleia)
;; apheleia:1 ends here

;; python-black

;; For ein notebooks. this requires black-macchiato via pipx


;; [[file:config.org::*python-black][python-black:1]]
(package! python-black)
;; python-black:1 ends here

;; Javascript/Typescript


;; [[file:config.org::*Javascript/Typescript][Javascript/Typescript:1]]
(package! add-node-modules-path :recipe (:host github :repo "codesuki/add-node-modules-path"))
;; Javascript/Typescript:1 ends here

;; dirvish



;; [[file:config.org::*dirvish][dirvish:1]]
(package! dirvish)
;; dirvish:1 ends here

;; dired git info/log



;; [[file:config.org::*dired git info/log][dired git info/log:1]]
(package! dired-git-log :recipe (:host github :repo "amno1/dired-git-log"))
;; dired git info/log:1 ends here

;; all the icons
