.config/doom/config.org
*** Stage files from dired

+TODO: Use https://github.com/conao3/dired-git.el instead for the git portion of+
+this. I wonder if it will also "just" work for the yadm case if I'm using+
+/yadm:: dired via tramp+ <-- this sucks

https://gist.github.com/justinhj/5945047
#+begin_src emacs-lisp

(defun git-add-files(files)
  "Run git add with the input file"
  (shell-command (format "git add %s" files)))

(defun yadm-add-files(files)
  "Run git add with the input file"
  (let ((default-directory "~/"))
    (shell-command (format "yadm add %s" files))))

(defun dired-git-add-marked-files()
  "For each marked file in a dired buffer add it to the index"
  (interactive)
  (if (eq major-mode 'dired-mode)
      (let ((filenames (dired-get-marked-files))
	    (files ""))
	(dolist (fn filenames)
	  (setq fn (shell-quote-argument fn))
	  (setq files (concat files " " fn)))
	(git-add-files files))
    (error (format "Not a Dired buffer \(%s\)" major-mode))))

(defun dired-yadm-add-marked-files()
  "For each marked file in a dired buffer add it to the index"
  (interactive)
  (if (eq major-mode 'dired-mode)
      (let ((filenames (dired-get-marked-files))
	    (files ""))
	(dolist (fn filenames)
	  (setq fn (shell-quote-argument fn))
	  (setq files (concat files " " fn)))
	(yadm-add-files files))
    (error (format "Not a Dired buffer \(%s\)" major-mode))))
#+end_src


*** subtree


#+begin_src emacs-lisp
(after! dired
  (map! :map dired-mode-map
    "<tab>" #'dired-subtree-toggle
    "<backtab>" #'dired-subtree-cycle)
)
#+end_src

*** COMMENT sidebar

#+begin_src emacs-lisp :tangle packages.el
(package! dired-sidebar)
#+end_src


#+begin_src emacs-lisp
(after! dired-sidebar
  (add-hook! 'dired-sidebar-mode-hook  #'hide-mode-line-mode))
#+end_src

*** xdg open

#+begin_src emacs-lisp
(defun dired-open-file ()
  "In dired, open the file named on this line."
  (interactive)
  (let* ((file (dired-get-filename nil t)))
    (message "Opening %s..." file)
    ;; (call-process "xdg-open" nil 0 nil file)
    (call-process "open" nil 0 nil file)
    (message "Opening %s done" file)))

(map! :map dired-mode-map "C-<return>" #'dired-open-file)
#+end_src

*** wdired

#+begin_src emacs-lisp
(map! :map dired-mode-map "w" #'wdired-change-to-wdired-mode)
#+end_src
*** all the icons


#+begin_src emacs-lisp :tangle packages.el
(package! all-the-icons-dired)
#+end_src
https://old.reddit.com/r/emacs/comments/imy9f1/all_the_icons_dired_subtree/

#+begin_src emacs-lisp
(use-package! all-the-icons-dired
  :after dired
  :config
  :hook (dired-mode . (lambda ()
                       (interactive)
                       (unless (file-remote-p default-directory)
                         (all-the-icons-dired-mode)))))

(use-package! dired-subtree
  :commands (dired-subtree-toggle)
  :config
  (advice-add 'dired-subtree-toggle :after (lambda ()
                                             (interactive)
                                             (when all-the-icons-dired-mode
                                               (revert-buffer)))))
#+end_src

*** sudo


#+begin_src emacs-lisp :tangle packages.el
(package! dired-togle-sudo :recipe (:host github :repo "renard/dired-toggle-sudo"))
#+end_src

#+begin_src emacs-lisp
(eval-after-load 'tramp
 '(progn
    ;; Allow to use: /sudo:user@host:/path/to/file
    (add-to-list 'tramp-default-proxies-alist
		  '(".*" "\\`.+\\'" "/ssh:%h:"))))
#+end_src

*** hydra

#+begin_src emacs-lisp
(major-mode-hydra-define dired-mode (:hint nil :color pink)
    (
     "Act"
     (
      ("+" dired-create-directory "mkdir")
      ("C" dired-do-copy "Copy")        ;; Copy all marked files
      ("D" dired-do-delete "Delete")
      ("R" dired-do-rename "mv")
      ("$" dired-hide-subdir-nomove "hide-subdir")
      ("i" dired-maybe-insert-subdir "insert subdir")
      ("w" dired-kill-subdir "kill subdir")
      ("M-d" vi/dired-popup-dragon "Drag with dragon")
       ("a" dired-git-add-marked-files "Git add")
      )
     "view"
     (
      ("v" dired-view-file "view")      ;; q to exit, s to search, = gets line #
      ("o" dired-find-file-other-window "open other")
      ("O" dired-display-file "view other")
      ("F" dired-do-find-marked-files "find marked")
      ("A" dired-do-find-regexp "find rx")
      ("Q" dired-do-find-regexp-and-replace "rx replace")

      )
     "listing"
     (
      ("(" dired-hide-details-mode "details")
      (")" dired-omit-mode "omit-mode")
      ("s" dired-sort-toggle-or-edit "sort")
       ;; ("?" dired-summary "summary")
      ;; ("l" dired-do-redisplay "redisplay")   ;; relist the marked or singel directory
      )
     "mark"
     (
      ("m" dired-mark "mark")
      ("u" dired-unmark "unmark")
      ("t" dired-toggle-marks "toggle")
      ("U" dired-unmark-all-marks "unmark all")
      ("E" dired-mark-extension "mark ext")
      )

     "Misc"
     (
      ("z" diredp-compress-this-file "Compress file")
      ("Z" dired-do-compress "Compress")
      ("Y" dired-do-relsymlink "rel symlink")
      ("L" dired-do-symlink "symlink")
      ("M" dired-do-chmod "chmod")
      ("G" dired-do-chgrp "chgrp")
       ("S" dired-toggle-sudo "SUDO")
      )
     )
    )
#+end_src
*** drag and drop

brew install indigoviolet/tap/dragon

https://old.reddit.com/r/emacs/comments/uq6gxy/drag_files_from_dired_to_other_applications/i8xyxsn/

#+begin_src emacs-lisp
(defun vi/dired-popup-dragon (&optional arg)
  "Open xdragon with the marked files or the file at point.
With optional prefix argument ARG, drag all the files at once."
  (interactive "P")
  ;; xdragon rename is a nix thing, pretty sure.
  (make-process
   :name "dragon"
   :command (append '("dragon")
                    (when arg '("-a"))
                    (dired-get-marked-files))
   :noquery t))
#+end_src
** COMMENT Projectile

Note: doom has significant customizations in advices around projectile: for
instance, it forces projectile to use the "generic" command and not the
vcs-specific command.

#+begin_src emacs-lisp
(use-package! projectile
  :after-call doom-first-buffer-hook
  :custom
  (projectile-project-search-path '("~/dev"))
  (projectile-auto-discover t)
  ;; copied from doom-projects.el to add -I to fd
  (projectile-generic-command
        (lambda (_)
          ;; If fd exists, use it for git and generic projects. fd is a rust
          ;; program that is significantly faster than git ls-files or find, and
          ;; it respects .gitignore. This is recommended in the projectile docs.
          (cond
           ((when-let*
                ((bin (if (ignore-errors (file-remote-p default-directory nil t))
                          (cl-find-if (doom-rpartial #'executable-find t)
                                      (list "fdfind" "fd"))
                        doom-projectile-fd-binary))
                 ;; REVIEW Temporary fix for #6618. Improve me later.
                 (version (with-memoization doom-projects--fd-version
                            (cadr (split-string (cdr (doom-call-process bin "--version"))
                                                " " t))))
                 ((ignore-errors (version-to-list version))))
                (concat (format "%s . -0 -H -I --color=never --type file --type symlink --follow --exclude .git --exclude .venv --exclude .dvc %s"
                                bin (if (version< version "8.3.0")
                                        "" "--strip-cwd-prefix"))
                        (if IS-WINDOWS " --path-separator=/"))))
           ;; Otherwise, resort to ripgrep, which is also faster than find
           ((executable-find "rg" t)
            (concat "rg -0 --files --follow --color=never --hidden -g!.git"
                    (if IS-WINDOWS " --path-separator=/")))
           ("find . -type f -print0"))))
  :config
  (add-to-list 'projectile-project-root-files "pyproject.toml")
  )
#+end_src

