.config/doom/packages.el



;; [[file:config.org::*all the icons][all the icons:1]]
(package! all-the-icons-dired)
;; all the icons:1 ends here

;; sudo



;; [[file:config.org::*sudo][sudo:1]]
(package! dired-togle-sudo :recipe (:host github :repo "renard/dired-toggle-sudo"))
;; sudo:1 ends here

;; Firestarter
