.config/doom/config.org
*** COMMENT open all project files

#+begin_src emacs-lisp
(after! projectile
  (defun vi/find-all-project-files ()
    (interactive)
    (let* (
           (root (projectile-acquire-root))
           (files (projectile-project-files root))
           (filenames (--map (expand-file-name it root) files)))
      (dolist-with-progress-reporter (f filenames) (format "Opening files in project [%s] " root) (find-file-noselect f))
      ))
  )
#+end_src


* Firestarter

Execute commands on save
https://github.com/emacsmirror/firestarter

#+begin_src emacs-lisp :tangle packages.el
(package! firestarter)
#+end_src

#+begin_src emacs-lisp
(use-package! firestarter
  :after-call doom-first-file-hook
  :custom
  (firestarter-mode)
  )
#+end_src
* dir-locals

https://emacs.stackexchange.com/questions/13080/reloading-directory-local-variables
#+begin_src emacs-lisp
(defun vi/reload-dir-locals-for-current-buffer ()
  "reload dir locals for the current buffer"
  (interactive)
  (let ((enable-local-variables :all))
    (hack-dir-local-variables-non-file-buffer)))

(defun vi/reload-dir-locals-for-all-buffer-in-this-directory ()
  "For every buffer with the same `default-directory` as the
current buffer's, reload dir-locals."
  (interactive)
  (let ((dir default-directory))
    (dolist (buffer (buffer-list))
      (with-current-buffer buffer
        (when (equal default-directory dir))
        (vi/reload-dir-locals-for-current-buffer)))))
#+end_src

* docker

#+begin_src emacs-lisp :tangle packages.el
(package! dockerfile-mode)
#+end_src



#+begin_src emacs-lisp

(after! ob-tangle
  (setq org-babel-pre-tangle-hook
        (list (lambda ()
                (let (before-save-hook after-save-hook)
                  (save-buffer))))))
#+end_src

^ this doesn't work https://github.com/hlissner/doom-emacs/issues/4651


Also note that dockerfile-mode sets up an auto-mode-alist rule that maps
Dockerfile.* -> dockerfile-mode, including ~Dockerfile.org~

This seems to mainly depend on load order, since it conflicts with the org mode
rule for "*.org" :/

So we could:

- add another rule in dockerfile-mode use-package :mode that maps *.org to org
  mode
- use file-local-variables like below in Dockerfile.org


#+begin_example
# Local Variables:
# mode: org
# End:
#+end_example

* Tramp


#+begin_src emacs-lisp
;; set in .ssh/config
(after! tramp
  (setq tramp-use-ssh-controlmaster-options nil)
  )
#+end_src

** Debugging tramp

(setq tramp-verbose 6)

C-x C-f ~/sudo::/~ and look for the tramp debug buffer

ensure that you can execute the ssh command on the terminal - tramp doesn't always
handle the prompts correctly


* Misc

#+begin_src emacs-lisp :tangle packages.el
(package! git-modes)
(package! ssh-config-mode)
(package! jsonnet-mode)
;; (package! sparql-mode)
(package! jinja2-mode)
#+end_src

** jsonnet


#+begin_src emacs-lisp :tangle packages.el
(package! jsonnet-mode)
#+end_src


#+begin_src emacs-lisp
(use-package! jsonnet-mode
  :after-call doom-first-file-hook
  :mode ("\\.jsonnet\\'"
         "\\.libsonnet\\'"))
#+end_src

** json
:PROPERTIES:
:CREATED:  [2023-11-15 Wed 18:55]
:END:


#+begin_src emacs-lisp
(use-package! json-mode
  :mode ("\\.json\\'"
          "\\.jsonl\\'"))
#+end_src
** Just

#+begin_src emacs-lisp :tangle packages.el
(package! just-mode)
(package! justl)
#+end_src


#+begin_src emacs-lisp
(setq-hook! '(just-mode-hook) comment-start "# ")
#+end_src

** Cuda mode doesn't inherit from prog-mode?
#+begin_src emacs-lisp
(add-hook! 'cuda-mode-hook #'prog-mode)
#+end_src

** case cycle

#+begin_src emacs-lisp
(defun cycle-letter-case ()
  "Toggle the letter case of current word or text selection.
Always cycle in this order: Init Caps, ALL CAPS, all lower.

URL `http://ergoemacs.org/emacs/modernization_upcase-word.html'
Version 2016-01-08"
  (interactive)
  (let (
        (deactivate-mark nil)
        -p1 -p2)
    (if (use-region-p)
        (setq -p1 (region-beginning)
              -p2 (region-end))
      (save-excursion
        (skip-chars-backward "[:alnum:]")
        (setq -p1 (point))
        (skip-chars-forward "[:alnum:]")
        (setq -p2 (point))))
    (when (not (eq last-command this-command))
      (put this-command 'state 0))
    (cond
     ((equal 0 (get this-command 'state))
      (upcase-initials-region -p1 -p2)
      (put this-command 'state 1))
     ((equal 1  (get this-command 'state))
      (upcase-region -p1 -p2)
      (put this-command 'state 2))
     ((equal 2 (get this-command 'state))
      (downcase-region -p1 -p2)
      (put this-command 'state 0)))))

(map! :g "M-c" #'cycle-letter-case)
#+end_src
** numbers commas


#+begin_src emacs-lisp :tangle packages.el
(package! commify)
#+end_src


#+begin_src emacs-lisp
(use-package! commify)
  ;; :chords (",," . commify-toggle))
#+end_src



** latex

alternative: https://github.com/karthink/org-auctex


#+begin_src emacs-lisp :tangle packages.el
(package! org-latex-impatient)
#+end_src


#+begin_src emacs-lisp
(use-package! org-latex-impatient
  :after org
  :hook (org-mode . org-latex-impatient-mode)
  :custom
  ( org-latex-impatient-tex2svg-bin "/home/venky/.asdf/shims/tex2svg")
  )
#+end_src




** COMMENT jq-mode

 too slow

#+begin_src emacs-lisp :tangle packages.el
(package! jq-mode :recipe (:host github :repo "ljos/jq-mode"))
#+end_src


#+begin_src emacs-lisp
(after! json-mode
  (define-key json-mode-map (kbd "C-c C-j") #'jq-interactively))
#+end_src

** Force kill buffer



#+begin_src emacs-lisp
(defun vi/force-kill-buffer ()
  (interactive)
  (let (kill-buffer-hook kill-buffer-query-functions)
    (kill-buffer)))
#+end_src

* Prodigy


#+begin_src emacs-lisp :tangle packages.el
(package! prodigy)
#+end_src


#+begin_src emacs-lisp
(prodigy-define-service
  :name "ruff"
  :command "just"
  :args '("ruff-watch")
  :cwd "~/dev/plus/python"
  :stop-signal 'sigkill
  :env '(("TERM" "xterm"))
  :kill-process-buffer-on-stop t
  :tags '(dev))

(prodigy-define-service
  :name "pyright"
  :command "just"
  :args '("pyright-watch")
  :cwd "~/dev/plus/python"
  :env '(("TERM" "xterm"))
  :stop-signal 'sigkill
  :kill-process-buffer-on-stop t
  :tags '(dev))

(prodigy-define-service
  :name "lint"
  :command "just"
  :args '("lint")
  :cwd "~/dev/plus/"
  :stop-signal 'sigkill
  :env '(("TERM" "xterm"))
  :kill-process-buffer-on-stop t
  :tags '(dev))

#+end_src

* COMMENT atomic chrome

TODO: see https://github.com/KarimAziev/chrome-emacs

#+begin_src emacs-lisp :tangle packages.el
(package! atomic-chrome)
#+end_src
#+begin_src emacs-lisp
(use-package! atomic-chrome
  :after-call doom-first-file-hook
  :custom
  (atomic-chrome-default-major-mode 'python-mode)
  (atomic-chrome-url-major-mode-alist
   '(("\\.ipynb$" . python-mode))
   )
  ;; (atomic-chrome-extension-type-list '(atomic-chrome))
  (atomic-chrome-buffer-open-style 'full)

  :config
  (atomic-chrome-start-server)
  )
#+end_src


* COMMENT Annotations

- annot breaks things quite badly
- bookmark+ is too convoluted, no inline display

** TODO org-remark

https://github.com/nobiot/org-remark
* Screencasts

** gif screencast

#+begin_src emacs-lisp :tangle packages.el
(package! gif-screencast :recipe (:host gitlab :repo "ambrevar/emacs-gif-screencast"))
#+end_src

Turn on gif-screencast to initiate these bindings

#+begin_src emacs-lisp
(use-package! gif-screencast
  :bind (:map gif-screencast-mode-map
         (("<f8>" . #'gif-screencast-stop)
          ("<f9>" . #'gif-screencast-toggle-pause)))
  )
#+end_src

