.config/doom/config.el

;; open all project files


;; [[file:config.org::*open all project files][open all project files:1]]
(after! projectile
  (defun vi/find-all-project-files ()
    (interactive)
    (let* (
           (root (projectile-acquire-root))
           (files (projectile-project-files root))
           (filenames (--map (expand-file-name it root) files)))
      (dolist-with-progress-reporter (f filenames) (format "Opening files in project [%s] " root) (find-file-noselect f))
      ))
  )
;; open all project files:1 ends here

;; [[file:config.org::*Firestarter][Firestarter:2]]
(use-package! firestarter
  :after-call doom-first-file-hook
  :custom
  (firestarter-mode)
  )
;; Firestarter:2 ends here

;; dir-locals

;; https://emacs.stackexchange.com/questions/13080/reloading-directory-local-variables

;; [[file:config.org::*dir-locals][dir-locals:1]]
(defun vi/reload-dir-locals-for-current-buffer ()
  "reload dir locals for the current buffer"
  (interactive)
  (let ((enable-local-variables :all))
    (hack-dir-local-variables-non-file-buffer)))

(defun vi/reload-dir-locals-for-all-buffer-in-this-directory ()
  "For every buffer with the same `default-directory` as the
current buffer's, reload dir-locals."
  (interactive)
  (let ((dir default-directory))
    (dolist (buffer (buffer-list))
      (with-current-buffer buffer
        (when (equal default-directory dir))
        (vi/reload-dir-locals-for-current-buffer)))))
;; dir-locals:1 ends here

;; [[file:config.org::*docker][docker:2]]
(after! ob-tangle
  (setq org-babel-pre-tangle-hook
        (list (lambda ()
                (let (before-save-hook after-save-hook)
                  (save-buffer))))))
;; docker:2 ends here

;; Tramp



;; [[file:config.org::*Tramp][Tramp:1]]
;; set in .ssh/config
(after! tramp
  (setq tramp-use-ssh-controlmaster-options nil)
  )
;; Tramp:1 ends here

;; [[file:config.org::*jsonnet][jsonnet:2]]
(use-package! jsonnet-mode
  :after-call doom-first-file-hook
  :mode ("\\.jsonnet\\'"
         "\\.libsonnet\\'"))
;; jsonnet:2 ends here

;; json
;; :PROPERTIES:
;; :CREATED:  [2023-11-15 Wed 18:55]
;; :END:



;; [[file:config.org::*json][json:1]]
(use-package! json-mode
  :mode ("\\.json\\'"
          "\\.jsonl\\'"))
;; json:1 ends here

;; [[file:config.org::*Just][Just:2]]
(setq-hook! '(just-mode-hook) comment-start "# ")
;; Just:2 ends here

;; Cuda mode doesn't inherit from prog-mode?

;; [[file:config.org::*Cuda mode doesn't inherit from prog-mode?][Cuda mode doesn't inherit from prog-mode?:1]]
(add-hook! 'cuda-mode-hook #'prog-mode)
;; Cuda mode doesn't inherit from prog-mode?:1 ends here

;; case cycle


;; [[file:config.org::*case cycle][case cycle:1]]
(defun cycle-letter-case ()
  "Toggle the letter case of current word or text selection.
Always cycle in this order: Init Caps, ALL CAPS, all lower.

URL `http://ergoemacs.org/emacs/modernization_upcase-word.html'
Version 2016-01-08"
  (interactive)
  (let (
        (deactivate-mark nil)
        -p1 -p2)
    (if (use-region-p)
        (setq -p1 (region-beginning)
              -p2 (region-end))
      (save-excursion
        (skip-chars-backward "[:alnum:]")
        (setq -p1 (point))
        (skip-chars-forward "[:alnum:]")
        (setq -p2 (point))))
    (when (not (eq last-command this-command))
      (put this-command 'state 0))
    (cond
     ((equal 0 (get this-command 'state))
      (upcase-initials-region -p1 -p2)
      (put this-command 'state 1))
     ((equal 1  (get this-command 'state))
      (upcase-region -p1 -p2)
      (put this-command 'state 2))
     ((equal 2 (get this-command 'state))
      (downcase-region -p1 -p2)
      (put this-command 'state 0)))))

(map! :g "M-c" #'cycle-letter-case)
;; case cycle:1 ends here

;; [[file:config.org::*numbers commas][numbers commas:2]]
(use-package! commify)
  ;; :chords (",," . commify-toggle))
;; numbers commas:2 ends here

;; [[file:config.org::*latex][latex:2]]
(use-package! org-latex-impatient
  :after org
  :hook (org-mode . org-latex-impatient-mode)
  :custom
  ( org-latex-impatient-tex2svg-bin "/home/venky/.asdf/shims/tex2svg")
  )
;; latex:2 ends here

;; Force kill buffer




;; [[file:config.org::*Force kill buffer][Force kill buffer:1]]
(defun vi/force-kill-buffer ()
  (interactive)
  (let (kill-buffer-hook kill-buffer-query-functions)
    (kill-buffer)))
;; Force kill buffer:1 ends here

;; [[file:config.org::*Prodigy][Prodigy:2]]
(prodigy-define-service
  :name "ruff"
  :command "just"
  :args '("ruff-watch")
  :cwd "~/dev/plus/python"
  :stop-signal 'sigkill
  :env '(("TERM" "xterm"))
  :kill-process-buffer-on-stop t
  :tags '(dev))

(prodigy-define-service
  :name "pyright"
  :command "just"
  :args '("pyright-watch")
  :cwd "~/dev/plus/python"
  :env '(("TERM" "xterm"))
  :stop-signal 'sigkill
  :kill-process-buffer-on-stop t
  :tags '(dev))

(prodigy-define-service
  :name "lint"
  :command "just"
  :args '("lint")
  :cwd "~/dev/plus/"
  :stop-signal 'sigkill
  :env '(("TERM" "xterm"))
  :kill-process-buffer-on-stop t
  :tags '(dev))
;; Prodigy:2 ends here



;; Turn on gif-screencast to initiate these bindings


;; [[file:config.org::*gif screencast][gif screencast:2]]
(use-package! gif-screencast
  :bind (:map gif-screencast-mode-map
         (("<f8>" . #'gif-screencast-stop)
          ("<f9>" . #'gif-screencast-toggle-pause)))
  )
;; gif screencast:2 ends here
