.config/doom/packages.el

;; Execute commands on save
;; https://github.com/emacsmirror/firestarter


;; [[file:config.org::*Firestarter][Firestarter:1]]
(package! firestarter)
;; Firestarter:1 ends here

;; docker


;; [[file:config.org::*docker][docker:1]]
(package! dockerfile-mode)
;; docker:1 ends here

;; Misc


;; [[file:config.org::*Misc][Misc:1]]
(package! git-modes)
(package! ssh-config-mode)
(package! jsonnet-mode)
;; (package! sparql-mode)
(package! jinja2-mode)
;; Misc:1 ends here

;; jsonnet



;; [[file:config.org::*jsonnet][jsonnet:1]]
(package! jsonnet-mode)
;; jsonnet:1 ends here

;; Just


;; [[file:config.org::*Just][Just:1]]
(package! just-mode)
(package! justl)
;; Just:1 ends here

;; numbers commas



;; [[file:config.org::*numbers commas][numbers commas:1]]
(package! commify)
;; numbers commas:1 ends here

;; latex

;; alternative: https://github.com/karthink/org-auctex



;; [[file:config.org::*latex][latex:1]]
(package! org-latex-impatient)
;; latex:1 ends here

;; Prodigy



;; [[file:config.org::*Prodigy][Prodigy:1]]
(package! prodigy)
;; Prodigy:1 ends here

;; gif screencast


;; [[file:config.org::*gif screencast][gif screencast:1]]
(package! gif-screencast :recipe (:host gitlab :repo "ambrevar/emacs-gif-screencast"))
;; gif screencast:1 ends here

;; Keycast
