.config/doom/config.org
** Keycast
#+begin_src emacs-lisp :tangle packages.el
(package! keycast :recipe (:host github :repo "tarsius/keycast"))
#+end_src

#+begin_src emacs-lisp
(use-package! keycast
  :commands (keycast-mode)
  :config
  (define-minor-mode keycast-mode
    "Show current command and its key binding in the mode line (fix for use with doom-mode-line)."
    :global t
    (if keycast-mode
        (add-hook 'pre-command-hook 'keycast--update t)
      (remove-hook 'pre-command-hook 'keycast--update)))
  )
(after! (keycast doom-modeline)
  ;; based on keycast-mode-line function
  (doom-modeline-def-segment keycast
    (and keycast-mode-line-window-predicate (keycast--format keycast-mode-line-format))
    )
  (doom-modeline-def-modeline 'vi/keycast
    '(bar buffer-info keycast)
    '(minor-modes major-mode)
    )
  (add-hook! 'keycast-mode-hook (doom-modeline-set-modeline 'vi/keycast))
  )
;; (add-hook! keycast-mode-hook
;;   (add-to-list 'global-mode-string '("" keycast-mode-line)))
#+end_src

* COMMENT Bookmarks

- Linkmarks depends on helm. also it doesn't play nice with org-capture
  templates in Doom. Unclear if it even offers anything beyond org-capture.

- Bookmark+ is very complicated

** COMMENT Linkmarks
#+begin_src emacs-lisp :tangle packages.el
(package! linkmarks :recipe (:host github :repo "dustinlacewell/linkmarks"))
#+end_src


#+begin_src emacs-lisp
(defun vi/setup-linkmarks ()
  (setq-local linkmarks-file (expand-file-name (concat (projectile-acquire-root) "/Bookmarks.org")))
  )

(use-package! linkmarks
  :hook (prog-mode . vi/setup-linkmarks)
  )
#+end_src

** TODO harpoon

https://github.com/otavioschwanck/harpoon.el
* PDF


#+begin_src emacs-lisp :tangle packages.el
(unpin! pdf-tools)
#+end_src

** pdf tools fork with smooth scrolling


#+begin_src emacs-lisp :tangle packages.el
(package! pdf-tools :recipe
          (:host github
                 :repo "dalanicolai/pdf-tools"
                 :branch "pdf-roll"
                 :files ("lisp/*.el"
                         "README"
                         ("build" "Makefile")
                         ("build" "server")
                         (:exclude "lisp/tablist.el" "lisp/tablist-filter.el"))))

(package! image-roll :recipe
          (:host github
                 :repo "dalanicolai/image-roll.el"))
#+end_src

** COMMENT zotxt (zotero + emacs)


#+begin_src emacs-lisp :tangle packages.el
(package! zotxt)
#+end_src


#+begin_src emacs-lisp

(use-package! zotxt
  :hook (org-mode . org-zotxt-mode)
  :commands (org-zotxt-noter org-zotxt-mode)
  )

#+end_src

** org-noter


#+begin_src emacs-lisp :tangle packages.el
(package! org-noter)
#+end_src

#+begin_src emacs-lisp
(use-package! org-noter
  :commands (org-noter)
  :custom
  (setq org-noter-always-create-frame nil
        org-noter-separate-notes-from-heading t
        org-noter-default-heading-title "Page $p$"
        org-noter-auto-save-last-location t
        org-noter-notes-search-path '("~/org")
        org-noter-separate-notes-from-heading t
        org-noter-doc-property-in-notes t
        )
  )
#+end_src
** Rotation
#+begin_src emacs-lisp
(after! pdf-view
  ;; https://emacs.stackexchange.com/questions/24738/how-do-i-rotate-pages-in-pdf-tools/24766#24766
  (defun pdf-view--rotate (&optional counterclockwise-p page-p)
    "Rotate PDF 90 degrees.  Requires pdftk to work.\n
Clockwise rotation is the default; set COUNTERCLOCKWISE-P to
non-nil for the other direction.  Rotate the whole document by
default; set PAGE-P to non-nil to rotate only the current page.
\nWARNING: overwrites the original file, so be careful!"
    ;; error out when pdftk is not installed
    (if (null (executable-find "pdftk"))
        (error "Rotation requires pdftk")
      ;; only rotate in pdf-view-mode
      (when (eq major-mode 'pdf-view-mode)
        (let* ((rotate (if counterclockwise-p "left" "right"))
               (file   (format "\"%s\"" (pdf-view-buffer-file-name)))
               (page   (pdf-view-current-page))
               (pages  (cond ((not page-p)                        ; whole doc?
                              (format "1-end%s" rotate))
                             ((= page 1)                          ; first page?
                              (format "%d%s %d-end"
                                      page rotate (1+ page)))
                             ((= page (pdf-info-number-of-pages)) ; last page?
                              (format "1-%d %d%s"
                                      (1- page) page rotate))
                             (t                                   ; interior page?
                              (format "1-%d %d%s %d-end"
                                      (1- page) page rotate (1+ page))))))
          ;; empty string if it worked
          (if (string= "" (shell-command-to-string
                           (format (concat "pdftk %s cat %s "
                                           "output %s.NEW "
                                           "&& mv %s.NEW %s")
                                   file pages file file file)))
              (pdf-view-revert-buffer nil t)
            (error "Rotation error!"))))))

  (defun pdf-view-rotate-clockwise (&optional arg)
    "Rotate PDF page 90 degrees clockwise.  With prefix ARG, rotate
entire document."
    (interactive "P")
    (pdf-view--rotate nil (not arg)))

  (defun pdf-view-rotate-counterclockwise (&optional arg)
    "Rotate PDF page 90 degrees counterclockwise.  With prefix ARG,
rotate entire document."
    (interactive "P")
    (pdf-view--rotate :counterclockwise (not arg)))

  (define-key pdf-view-mode-map (kbd "R") 'pdf-view-rotate-clockwise)

  )
#+end_src

* COMMENT Pomodoro


#+begin_src emacs-lisp :tangle packages.el
(package! org-pomodoro)
#+end_src
* COMMENT detached
sr.ht is down


#+begin_src emacs-lisp :tangle packages.el
(package! detached)
#+end_src


#+begin_src emacs-lisp
(use-package! detached
  :after vterm
  :init
  (detached-init)
  :bind (;; Replace `async-shell-command' with `detached-shell-command'
          ([remap async-shell-command] . detached-shell-command)
          ;; Replace `compile' with `detached-compile'
          ([remap compile] . detached-compile)
          ([remap recompile] . detached-compile-recompile)
          ;; Replace built in completion of sessions with `consult'
          ([remap detached-open-session] . detached-consult-session))
  :custom ((detached-show-output-on-attach t)
            (detached-session-directory "/tmp")
            (detached-terminal-data-command system-type))

  :config
  (connection-local-set-profile-variables
    'remote-detached
    '((detached-session-directory . "/tmp")
       (detached-dtach-program . "dtach")))
  (connection-local-set-profiles
    '(:application tramp :protocol "ssh") 'remote-detached)
  :hook (vterm-mode . detached-vterm-mode)
  )
#+end_src

* COMMENT Documentation

** dash

#+begin_src emacs-lisp
(after! dash-docs
  ;; (dash-docs-install-docset "Python_3")
  (set-docsets! 'python-mode "Python 3")
  )
#+end_src

** COMMENT dev-docs

#+begin_src emacs-lisp :tangle packages.el
(package! devdocs)
#+end_src

** hydra


#+begin_src emacs-lisp
(pretty-hydra-define doc-hydra (:exit t)
  (
    "Reference"
   (
     ("d" +lookup/in-docsets "Dash")
    ("D" devdocs-lookup "Devdocs")
    ("O" +lookup/online-select "Online"))
   "Jump"
    (("c" +lookup/documentation "Docstring")
    ("f" +lookup/definition "Definition")
    ("u" +lookup/references "Usages")
    ("i" +lookup/implementations "Impls")
    ("t" +lookup/type-definition "Type")
    ("F" +lookup/file "file"))
   ))
#+end_src

* Profiling

** Keyfreq


#+begin_src emacs-lisp :tangle packages.el
(package! keyfreq :recipe (:host github :repo "dacap/keyfreq"))
#+end_src


#+begin_src emacs-lisp
(use-package! keyfreq
  :after-call doom-first-input-hook
  :custom
  (keyfreq-excluded-commands
   '(self-insert-command
     forward-char
     backward-char
     previous-line
     next-line))
  :config
  (keyfreq-mode 1)
  (keyfreq-autosave-mode 1)
  )
#+end_src

** COMMENT explain-pause

?? seems to be built into doom.. but it works?
seems to be broken in nativecomp emacs <2022-05-05 Thu>

#+begin_src emacs-lisp :tangle packages.el
(package! explain-pause-mode :recipe (:host github :repo "lastquestion/explain-pause-mode"))
#+end_src


#+begin_src emacs-lisp
(use-package! explain-pause-mode
  :config
  (explain-pause-mode)
  )
#+end_src
