.config/doom/packages.el

;; [[file:config.org::*Keycast][Keycast:1]]
(package! keycast :recipe (:host github :repo "tarsius/keycast"))
;; Keycast:1 ends here

;; PDF



;; [[file:config.org::*PDF][PDF:1]]
(unpin! pdf-tools)
;; PDF:1 ends here

;; pdf tools fork with smooth scrolling



;; [[file:config.org::*pdf tools fork with smooth scrolling][pdf tools fork with smooth scrolling:1]]
(package! pdf-tools :recipe
          (:host github
                 :repo "dalanicolai/pdf-tools"
                 :branch "pdf-roll"
                 :files ("lisp/*.el"
                         "README"
                         ("build" "Makefile")
                         ("build" "server")
                         (:exclude "lisp/tablist.el" "lisp/tablist-filter.el"))))

(package! image-roll :recipe
          (:host github
                 :repo "dalanicolai/image-roll.el"))
;; pdf tools fork with smooth scrolling:1 ends here

;; org-noter



;; [[file:config.org::*org-noter][org-noter:1]]
(package! org-noter)
;; org-noter:1 ends here

;; Keyfreq



;; [[file:config.org::*Keyfreq][Keyfreq:1]]
(package! keyfreq :recipe (:host github :repo "dacap/keyfreq"))
;; Keyfreq:1 ends here
